{
  "laws": [
    {
      "lawData": {
        "title": "A bill to rename the community-based outpatient clinic of the Department of Veterans Affairs in Butte, Montana, as the \"Charlie Dowd VA Clinic\".",
        "date": "2024-07-30",
        "summary": "This bill designates the community-based outpatient clinic of the Department of Veterans Affairs in Butte, Montana, as the Charlie Dowd Department of Veterans Affairs Clinic or the Charlie Dowd VA Clinic."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 76,
        "billType": "s",
        "billNumber": 3285
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the outpatient clinic of the Department of Veterans Affairs in Wyandotte County, Kansas City, Kansas, as the \"Captain Elwin Shopteese VA Clinic\".",
        "date": "2024-07-30",
        "summary": "This bill designates the outpatient clinic of the Department of Veterans Affairs at 9201 Parallel Parkway, Kansas City, Kansas, as the Captain Elwin Shopteese Department of Veterans Affairs Clinic or the Captain Elwin Shopteese VA Clinic."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 75,
        "billType": "s",
        "billNumber": 3249
      }
    },
    {
      "lawData": {
        "title": "All-American Flag Act",
        "date": "2024-07-30",
        "summary": "All-American Flag ActThis bill prohibits agencies from using funds to procure a U.S. flag unless such flag has been manufactured in the United States from materials that have been U.S. grown, produced, or manufactured. The bill specifies exceptions to this prohibition, including an exception if flags of satisfactory quality and sufficient quantity cannot be procured as needed at market prices."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 74,
        "billType": "s",
        "billNumber": 1973
      }
    },
    {
      "lawData": {
        "title": "Improving Access to Our Courts Act",
        "date": "2024-07-30",
        "summary": "Improving Access to Our Courts Act This bill adds Alpine to the list of places where court must be held in the Pecos Division of the Western District of Texas.  Additionally, the bill adds Mount Vernon to the list of places where court must be held in the Western District of Washington."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 73,
        "billType": "s",
        "billNumber": 227
      }
    },
    {
      "lawData": {
        "title": "Debbie Smith Act of 2023",
        "date": "2024-07-30",
        "summary": "Debbie Smith Act of 2023 This bill reauthorizes through FY2029 the Debbie Smith DNA Backlog Grant Program. The program provides grants to state and local governments to improve and expand the collection and analysis of DNA evidence, including evidence in sexual assault kits."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 72,
        "billType": "hr",
        "billNumber": 1105
      }
    },
    {
      "lawData": {
        "title": "Federal Prison Oversight Act",
        "date": "2024-07-25",
        "summary": "Federal Prison Oversight Act This bill establishes an inspections regime for the Bureau of Prisons (BOP).  The Department of Justice (DOJ) Office of the Inspector General must conduct risk-based evaluations of BOP facilities.  An inspection of a facility may be announced or unannounced. Higher risk facilities must receive more frequent inspections. The bill (1) provides for the establishment in DOJ of an Ombudsman who may receive complaints, make inquiries, and recommend actions, and decline to investigate or take action, as specified; and (2) prohibits BOP retaliation against any person or entity that has instituted or caused to be instituted any proceeding, investigation, or inspection under this bill.  The ombudsman shall coordinate with the BOP to educate incarcerated people, their representatives, and the public about the existence and functions of the ombudsman."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 71,
        "billType": "hr",
        "billNumber": 3019
      }
    },
    {
      "lawData": {
        "title": "FAA Reauthorization Act of 2024",
        "date": "2024-05-16",
        "summary": "Securing Growth and Robust Leadership in American Aviation Act This bill reauthorizes the Federal Aviation Administration (FAA) through FY2028, including activities and programs related to airport planning and development, facilities and equipment, and operations. The National Transportation Safety Board is also reauthorized through FY2028.  The bill also addresses a wide range of issues. For example, the bill   directs the FAA to increase air traffic controller hiring targets;  establishes a workforce development program to support the education, recruitment, and retention of aviation professionals; establishes an FAA Ombudsman to coordinate the response to submissions of inquiries or objections relating to issues such as aircraft certifications and registrations, pilot certificates, and operational approvals, waivers, or exemptions; raises the commercial airline pilot retirement age to 67 (currently 65); prohibits aircraft dispatchers from working remotely, with limited exceptions for emergencies; requires the Department of Transportation (DOT) to establish standards to ensure the aircraft boarding and deplaning process is accessible for individuals with disabilities, including for individuals who use wheelchairs; requires DOT to establish a policy directing certain air carriers to seat a young child next to an accompanying adult if adjacent seats are available without charging an additional fee;  prohibits the FAA from requiring mask wearing or COVID-19 vaccines for passengers, air carrier employees, or FAA employees; requires the FAA to issue rules to update the requirements for testing and operating unmanned aircraft (i.e., drones), including for drones operating beyond the visual line of sight; and requires the FAA to issue rules for certifying pilots for powered-lift aircraft (i.e., capable of vertical takeoff and landing) and operational rules for powered-lift aircraft.  "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 63,
        "billType": "hr",
        "billNumber": 3935
      }
    },
    {
      "lawData": {
        "title": "TRANQ Research Act of 2023",
        "date": "2023-12-19",
        "summary": "Testing, Rapid Analysis, and Narcotic Quality Research Act of 2023 or the TRANQ Research Act of 2023 This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances. In particular, NIST must support  basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities.  Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 23,
        "billType": "hr",
        "billNumber": 1734
      }
    },
    {
      "lawData": {
        "title": "Promoting a Resolution to the Tibet-China Dispute Act",
        "date": "2024-07-12",
        "summary": "Promoting a Resolution to the Tibet-China Dispute Act&nbsp;This bill addresses issues relating to Tibet, including by establishing a statutory definition of Tibet that includes areas in Chinese provinces outside the Tibet Autonomous Region (TAR).For the purposes of U.S. policies and activities relating to Tibet, this bill defines Tibet to include the TAR and the Tibetan areas of the Qinghai, Sichuan, Gansu, and Yunnan provinces. (Generally, when China's government refers to Tibet, it means only the TAR, but it recognizes the areas included in this bill's definition as Tibetan. China's government formally established the TAR in 1965.)Furthermore, the duties of the Office of the U.S. Special Coordinator for Tibetan Issues shall include working with relevant bureaus in the Department of State and the U.S. Agency for International Development&nbsp;to ensure that U.S. government statements and documents counter, as appropriate, disinformation about Tibet by China's government and the Chinese Communist Party, including disinformation about Tibet's history and institutions."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 70,
        "billType": "s",
        "billNumber": 138
      }
    },
    {
      "lawData": {
        "title": "Maternal and Child Health Stillbirth Prevention Act of 2024",
        "date": "2024-07-12",
        "summary": "Maternal and Child Health Stillbirth Prevention Act of 2024This act expands the scope of the Maternal and Child Health Services Block Grant to include research and activities to prevent stillbirths."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 69,
        "billType": "hr",
        "billNumber": 4581
      }
    },
    {
      "lawData": {
        "title": "Winnebago Land Transfer Act of 2023",
        "date": "2024-07-12",
        "summary": "Winnebago Land Transfer Act of 2023 This bill takes specified lands in Iowa into trust for the benefit of the Winnebago Tribe of Nebraska. The land is made part of the tribe's reservation. The bill prohibits gaming on the land taken into trust."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 68,
        "billType": "hr",
        "billNumber": 1240
      }
    },
    {
      "lawData": {
        "title": "A bill to authorize appropriations for the United States Fire Administration and firefighter assistance grant programs, to advance the benefits of nuclear energy, and for other purposes.",
        "date": "2024-07-09",
        "summary": "Fire Grants and Safety Act This bill reauthorizes through FY2030 the U.S. Fire Administration, the Assistance to Firefighters Grants Program, and the Staffing for Adequate Fire and Emergency Response Grant Program. The Government Accountability Office must conduct an audit of and issue a publicly available report on   barriers that prevent fire departments from accessing federal funds, and  the U.S. Fire Administration.  The bill makes the government of China, and any entity or organization operating or incorporated in China, ineligible to be a recipient or subrecipient of federal assistance under such programs."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 67,
        "billType": "s",
        "billNumber": 870
      }
    },
    {
      "lawData": {
        "title": "Dr. Emmanuel Bilirakis and Honorable Jennifer Wexton National Plan to End Parkinson’s Act",
        "date": "2024-07-02",
        "summary": "Dr. Emmanuel Bilirakis and Honorable Jennifer Wexton National Plan to End Parkinson's ActThis act requires the Department of Health and Human Services (HHS) to carry out a project to address Parkinson's disease (a progressive brain disorder that causes unintended or uncontrollable movements) and related conditions.Among other components of the project, HHS must (1) implement and periodically update a national plan to coordinate and guide efforts to prevent, diagnose, treat, and cure the disease; and (2) improve the care of those with the disease. HHS must also annually assess the preparations for and response to the increased burden of Parkinson's disease.In addition, the act establishes a council, comprised of federal and nonfederal stakeholders, to advise HHS on and make recommendations concerning the prevention and treatment of Parkinson's disease.The provisions of the act terminate at the end of calendar year 2035."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 66,
        "billType": "hr",
        "billNumber": 2365
      }
    },
    {
      "lawData": {
        "title": "Airport and Airway Extension Act of 2023, Part II",
        "date": "2023-12-26",
        "summary": "Airport and Airway Extension Act of 2023, Part II This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through March 8, 2024. For example, the bill extends the FAA   Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program),  weather reporting programs,  Remote Tower Pilot Program, and Essential Air Service Program.  The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.) Further, the bill extends through March 8, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)  "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 34,
        "billType": "hr",
        "billNumber": 6503
      }
    },
    {
      "lawData": {
        "title": "Prohibiting Russian Uranium Imports Act",
        "date": "2024-05-13",
        "summary": "This bill limits the importation of uranium from Russia.Specifically, it bans unirradiated low-enriched uranium (i.e., uranium that has not been in a reactor) that is produced in Russia or by a Russian entity from being imported into the United States. The bill also prohibits the importation of unirradiated low-enriched uranium that has been swapped for the banned uranium or otherwise obtained in a manner designed to circumvent the ban's restrictions.However, the Department of Energy (DOE) may waive this ban if DOE determines that (1) no alternative viable source of low-enriched uranium is available to sustain the continued operation of a nuclear reactor or a U.S. nuclear energy company, or (2) importation of the uranium is in the national interest. Any waiver issued must terminate by January 1, 2028. The ban terminates on December 31, 2040. &nbsp;"
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 62,
        "billType": "hr",
        "billNumber": 1042
      }
    },
    {
      "lawData": {
        "title": "Recruit and Retain Act",
        "date": "2024-05-24",
        "summary": "Recruit and Retain Act This bill expands the Community Oriented Policing Services (COPS) grant program to support recruitment efforts by law enforcement agencies. Specifically, the bill expands the COPS program by  allowing funds to be used for reducing application-related fees (e.g., fees for background checks, psychological evaluations, and testing); and directing the Department of Justice (DOJ) to award competitive grants to partnerships between law enforcement agencies and educational institutions (e.g., elementary and secondary schools and institutions of higher education) for recruiting activities, such as for career and job fairs.  The bill requires DOJ to establish guidance for understaffed law enforcement agencies applying for COPS grants. The Government Accountability Office must study and report on the effects of recruitment and attrition rates on federal, state, tribal, and local law enforcement agencies."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 64,
        "billType": "s",
        "billNumber": 546
      }
    },
    {
      "lawData": {
        "title": "To rename the Department of Veterans Affairs community-based outpatient clinic in Hinesville, Georgia, as the \"John Gibson, Dan James, William Sapp, and Frankie Smiley VA Clinic\".",
        "date": "2024-05-13",
        "summary": "This act designates the community-based outpatient clinic of the Department of Veterans Affairs in Hinesville, Georgia, as the John Gibson, Dan James, William Sapp, and Frankie Smiley VA Clinic.&nbsp;"
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 61,
        "billType": "hr",
        "billNumber": 593
      }
    },
    {
      "lawData": {
        "title": "Airport and Airway Extension Act of 2024, Part II",
        "date": "2024-05-10",
        "summary": "Airport and Airway Extension Act of 2024, Part IIThis bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through May 17, 2024.For example, the bill extends the FAAUnmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program),weather reporting programs, andRemote Tower Pilot Program.The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through May 17, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)The bill also extends through May 17, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from a UAS. These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.&nbsp;"
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 60,
        "billType": "hr",
        "billNumber": 8289
      }
    },
    {
      "lawData": {
        "title": "REPORT Act",
        "date": "2024-05-07",
        "summary": "Revising Existing Procedures On Reporting via Technology Act or the REPORT Act This bill makes changes to the federal framework governing the reporting of crimes involving the online&nbsp;sexual&nbsp;exploitation&nbsp;of children. Specifically, the bill makes changes to the requirements for electronic communication service providers and remote computing service providers (providers) to submit reports to the National Center for Missing and Exploited Children (NCMEC) when they become aware of violations involving the online sexual exploitation of children.  Among the changes, the bill  increases the amount of time—from 90 days to 1 year—that a provider must preserve the contents of a report,  requires (currently, authorizes) providers to report on a violation that may be planned or imminent, and  extends the requirement for providers to report apparent&nbsp;violations involving the sexual&nbsp;exploitation of children to instances involving child sex trafficking or coercion or enticement of a minor to engage in prostitution or any other illegal sexual activity.   Additionally, the bill increases the maximum fines for providers who knowingly and willfully fail to submit reports.  Finally, the bill limits the liability of vendors that contract with NCMEC for claims arising from storing and transferring visual depictions of child sexual abuse material (i.e., child pornography). It also limits the liability of minors, or persons acting on behalf of minors, for reporting to NCMEC's CyberTipline apparent violations involving child sexual abuse material in which the child is depicted, including a copy of the visual depiction of the minor. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 59,
        "billType": "s",
        "billNumber": 474
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 859 North State Road 21 in Melrose, Florida, as the \"Pamela Jane Rock Post Office Building\".",
        "date": "2024-05-07",
        "summary": "This bill designates the facility of the U.S. Postal Service located at 859 North State Road 21 in Melrose, Florida, as the Pamela Jane Rock Post Office Building."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 58,
        "billType": "hr",
        "billNumber": 3947
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 120 West Church Street in Mount Vernon, Georgia, as the \"Second Lieutenant Patrick Palmer Calhoun Post Office\".",
        "date": "2024-05-07",
        "summary": "Designates the facility of the United States Postal Service located at 120 West Church Street in Mount Vernon, Georgia, as the \"Second Lieutenant Patrick Palmer Calhoun Post Office.\""
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 57,
        "billType": "hr",
        "billNumber": 3944
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 101 South 8th Street in Lebanon, Pennsylvania, as the \"Lieutenant William D. Lebo Post Office Building\".",
        "date": "2024-05-07",
        "summary": "This bill designates the facility of the U.S. Postal Service located at 101 South 8th Street in Lebanon, Pennsylvania, as the Lieutenant William D. Lebo Post Office Building."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 56,
        "billType": "hr",
        "billNumber": 3865
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 2395 East Del Mar Boulevard in Laredo, Texas, as the \"Lance Corporal David Lee Espinoza, Lance Corporal Juan Rodrigo Rodriguez & Sergeant Roberto Arizola Jr. Post Office Building\".",
        "date": "2024-05-07",
        "summary": "This bill designates the facility of the U.S. Postal Service located at 2395 East Del Mar Boulevard in Laredo, Texas, as the Lance Corporal David Lee Espinoza, Lance Corporal Juan Rodrigo Rodriguez & Sergeant Roberto Arizola Jr. Post Office Building."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 55,
        "billType": "hr",
        "billNumber": 2754
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 616 East Main Street in St. Charles, Illinois, as the \"Veterans of the Vietnam War Memorial Post Office\".",
        "date": "2024-05-07",
        "summary": "Designates the facility of the United States Postal Service located at 616 East Main Street in St. Charles, Illinois, as the \"Veterans of the Vietnam War Memorial Post Office.\""
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 54,
        "billType": "hr",
        "billNumber": 2379
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 3901 MacArthur Blvd., in New Orleans, Louisiana, as the \"Dr. Rudy Lombard Post Office\".",
        "date": "2024-05-07",
        "summary": "Designates the facility of the United States Postal Service located at 3901 MacArthur Blvd, in New Orleans, Louisiana, as the \"Dr. Rudy Lombard Post Office.\""
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 53,
        "billType": "hr",
        "billNumber": 996
      }
    },
    {
      "lawData": {
        "title": "To designate the facility of the United States Postal Service located at 24355 Creekside Road in Santa Clarita, California, as the \"William L. Reynolds Post Office Building\".",
        "date": "2024-05-07",
        "summary": "Designates the facility of the United States Postal Service located at 24355 Creekside Road in Santa Clarita, California, as the \"William L. Reynolds Post Office Building.\""
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 52,
        "billType": "hr",
        "billNumber": 292
      }
    },
    {
      "lawData": {
        "title": "Making emergency supplemental appropriations for the fiscal year ending September 30, 2024, and for other purposes.",
        "date": "2024-04-24",
        "summary": "This act provides FY2024 supplemental appropriations to several federal agencies for assistance to Ukraine, Israel, and U.S. allies in the Indo-Pacific region. The act also addresses various foreign policy issues. &nbsp;The funding provided by the act is designated as emergency spending, which is exempt from discretionary spending limits.&nbsp;DIVISION A--ISRAEL SECURITY SUPPLEMENTAL APPROPRIATIONS ACT, 2024Israel Security Supplemental Appropriations Act, 2024This division provides FY2024 supplemental appropriations for federal departments and agencies to respond to the conflict in Israel.TITLE I--DEPARTMENT OF DEFENSEThis title provides appropriations to the Department of Defense (DOD) forOperation and Maintenance,Procurement, andDefense Production Act Purchases.The title provides the funding for purposes such assupporting current U.S. military operations in the region;replacing defense articles that were provided to Israel;reimbursing DOD for defense services and training provided to Israel; andprocuring Israel's Iron Dome, David's Sling, and Iron Beam defense systems to counter short-range rocket threats.(Sec.101) This section provides additional funding to DOD for&nbsp;U.S. operations, force protection, deterrence, and the replacement of combat expenditures in the U.S. Central Command region.TITLE II--DEPARTMENT OF HOMELAND SECURITYThis title provides appropriations to the Federal Emergency Management Agency for Operations and Support and Federal Assistance, including funding for the Nonprofit Security Grant Program.TITLE III--DEPARTMENT OF STATE AND RELATED AGENCYThis title provides appropriations to the Department of State for the Administration of Foreign Affairs, includingDiplomatic Programs,the Office of the Inspector General, andEmergencies in the Diplomatic and Consular Service.The title also provides appropriations to the State Department and the President forthe U.S. Agency for International Development’s (USAID’s) Office of Inspector General,Internatio..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 50,
        "billType": "hr",
        "billNumber": 815
      }
    },
    {
      "lawData": {
        "title": "Migratory Birds of the Americas Conservation Enhancements Act of 2023",
        "date": "2024-04-24",
        "summary": "Migratory Birds of the Americas Conservation Enhancements Act of 2023This bill reauthorizes through FY2028 and revises the Neotropical Migratory Bird Conservation Act, which provides financial assistance for projects to promote the conservation of neotropical migratory birds. The bill increases the cap on the federal share of project costs. It also directs the Department of the Interior to report on an advisory group established under the act. If applicable, Interior must include a description of the composition of the advisory group in the report."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 51,
        "billType": "hr",
        "billNumber": 4389
      }
    },
    {
      "lawData": {
        "title": "Reforming Intelligence and Securing America Act",
        "date": "2024-04-20",
        "summary": "Reforming Intelligence and Securing America Act  This bill reauthorizes Title VII of the Foreign Intelligence Surveillance Act (FISA) for five years and makes changes to FISA, including certain restrictions on surveillance under Section 702. (Sec. 702 concerns electronic surveillance of non-U.S. persons believed to be outside the United States to obtain foreign intelligence information. Information about U.S. persons may incidentally be acquired by this type of surveillance and subsequently searched or &quot;queried&quot; under certain circumstances.)  The bill places statutory limits on querying the contents of information collected under Section 702, including   prohibiting Federal Bureau of Investigation (FBI) personnel from making U.S. person queries without prior approval by certain FBI supervisors or attorneys unless the query might mitigate or eliminate a threat to life or serious bodily harm;  requiring the FBI Deputy Director to approve certain politically sensitive query terms (such as those that identify certain elected and appointed officials);  prohibiting the involvement of political appointees in the approval process for such politically sensitive query requests; and   requiring the FBI Director to establish consequences for noncompliant querying of U.S. person terms, including zero tolerance for willful misconduct.   Other provisions include    requiring applications for a surveillance order under FISA to be supported by sworn statements and limiting the use of information in such applications derived from political organizations or media sources,  increasing criminal penalties related to FISA, and   requiring adverse consequences (e.g., suspension without pay or removal) for government officers and employees who engage in intentional misconduct with respect to proceedings before the Foreign Intelligence Surveillance Court or the Foreign Intelligence Surveillance Court of Review.  "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 49,
        "billType": "hr",
        "billNumber": 7888
      }
    },
    {
      "lawData": {
        "title": "Puyallup Tribe of Indians Land Into Trust Confirmation Act of 2023",
        "date": "2024-04-19",
        "summary": "Puyallup Tribe of Indians Land Into Trust Confirmation Act of 2023This bill takes approximately 17.264 acres of specified lands in Pierce County, Washington, into trust for the benefit of the Puyallup Tribe of the Puyallup Reservation. Lands taken into trust shall be part of the tribe's reservation.The United States shall not be liable for any environmental contamination that occurred on or before the date on which the land is taken into trust.Further, the bill prohibits gaming on the land taken into trust. &nbsp;"
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 48,
        "billType": "s",
        "billNumber": 382
      }
    },
    {
      "lawData": {
        "title": "Further Consolidated Appropriations Act, 2024",
        "date": "2024-03-23",
        "summary": "Further Consolidated Appropriations Act, 2024 This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities.  Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills:  the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024.  The departments, agencies, and activities funded in the bill include   the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President,  the judiciary,  federal payments to the District of Columbia,  the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress,  the Department of State, and several related and independent agencies.  In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration. The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 47,
        "billType": "hr",
        "billNumber": 2882
      }
    },
    {
      "lawData": {
        "title": "I-27 Numbering Act of 2023",
        "date": "2024-03-22",
        "summary": "I&#8211;27 Numbering Act of 2023 This bill designates the future interstate highway system portions of the Ports-to-Plains Corridor within the states of Texas and New Mexico as Interstate Route I&#8211;27.  In Texas, from Sterling City to Lamesa, U.S. Route 87 is designated as Interstate Route I&#8211;27E and Texas Routes 158 and 349 via I&#8211;20 are designated as Interstate Route I&#8211;27W. U.S. Route 287 from Dumas, Texas to the border between Texas and Oklahoma is designated as Interstate Route I&#8211;27N."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 45,
        "billType": "s",
        "billNumber": 992
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the Federal building located at 985 Michigan Avenue in Detroit, Michigan, as the \"Rosa Parks Federal Building\", and for other purposes.",
        "date": "2024-03-22",
        "summary": "This bill designates the federal building located at 985 Michigan Avenue in Detroit, Michigan, as the Rosa Parks Federal Building."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 46,
        "billType": "s",
        "billNumber": 1278
      }
    },
    {
      "lawData": {
        "title": "Disaster Assistance Deadlines Alignment Act",
        "date": "2024-03-18",
        "summary": "Disaster Assistance Deadlines Alignment Act This bill modifies the deadline for applying for disaster unemployment assistance. Specifically, the bill matches the deadline for an individual seeking unemployment assistance for a major disaster under the Robert T. Stafford Disaster Relief and Emergency Assistance Act to the application deadline for individuals and households seeking other assistance under that act. The bill authorizes an extension of that deadline if the individual (1) has good cause for the late submission, and (2) submits the application during the period when disaster assistance is being provided."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 44,
        "billType": "s",
        "billNumber": 1858
      }
    },
    {
      "lawData": {
        "title": "END FENTANYL Act",
        "date": "2024-03-18",
        "summary": "Eradicating Narcotic Drugs and Formulating Effective New Tools to Address National Yearly Losses of life Act or the END FENTANYL Act This bill requires U.S. Customs and Border Protection to review and update, as necessary, manuals and policies related to inspections at ports of entry to ensure the uniformity of inspection practices to effectively detect illegal activity along the border, such as the smuggling of drugs and humans. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 43,
        "billType": "s",
        "billNumber": 206
      }
    },
    {
      "lawData": {
        "title": "Airport and Airway Extension Act of 2024",
        "date": "2024-03-08",
        "summary": "Airport and Airway Extension Act of 2024 This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through May 10, 2024.  For example, the bill extends the FAA   Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program),  weather reporting programs,  Remote Tower Pilot Program, and Essential Air Service Program.  The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.) Further, the bill extends through May 10, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.) The bill also extends through May 10, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from a UAS. These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 41,
        "billType": "hr",
        "billNumber": 7454
      }
    },
    {
      "lawData": {
        "title": "Consolidated Appropriations Act, 2024",
        "date": "2024-03-09",
        "summary": "Consolidated Appropriations Act, 2024  This act provides FY2024 appropriations for several federal departments and agencies. It also extends several expiring programs and authorities, including various public health programs.  Specifically, the act includes 6 of the 12 regular FY2024 appropriations bills:    the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024;   the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024;   the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024;   the Energy and Water Development and Related Agencies Appropriations Act, 2024;   the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and   the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024.   The act also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.  (Sec. 3) This section provides that references to this Act included in any division of this act refer only to the provisions of that division unless the act expressly provides otherwise.  (Sec. 4) This section provides that the explanatory statement regarding this act that was printed in the Congressional Record has the same effect as a joint explanatory statement of a conference committee.  (Sec. 5) This section specifies that the sums in this act are appropriated for FY2024.  (Sec. 6) This section specifies that funds designated by this act as emergency spending are only available if the President subsequently designates all of the funds as emergency spending and transmits the designations to Congress.  DIVISION A--MILITARY CONSTRUCTION, VETERANS AFFAIRS, AND RELATED AGENCIES APPROPRIATIONS ACT, 2024  Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024  T..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 42,
        "billType": "hr",
        "billNumber": 4366
      }
    },
    {
      "lawData": {
        "title": "Extension of Continuing Appropriations and Other Matters Act, 2024",
        "date": "2024-03-01",
        "summary": "Extension of Continuing Appropriations and Other Matters Act, 2024 This act provides continuing FY2024 appropriations for federal agencies, modifies the requirements for determining eligibility for federal student aid, and provides additional funding for Federal Pell Grants.  DIVISION A--EXTENSION OF CONTINUING APPROPRIATIONS ACT, 2024 Extension of Continuing Appropriations Act, 2024 This division is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.  The CR provides funding through March 8, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:   the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023;  the Energy and Water Development and Related Agencies Appropriations Act, 2023;  the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and  the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.   For most other federal agencies and programs, the CR provides funding through March 22, 2024.  (Under the current CR, the first group of agencies is funded through March 1, 2024, and the remaining agencies are funded through March 8, 2024.) The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. DIVISION B--OTHER MATTERS This division modifies the requirements for determining eligibility for federal student aid and provides additional funding for Federal Pell Grants.  (Sec. 101) This section revises the computation of the student aid index (SAI) for dependent students, which is used to determine eligibility for federal student aid. The SAI for a dependent student is calculated using the Free Application for Federal Student Aid (FAFSA) dat..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 40,
        "billType": "hr",
        "billNumber": 7463
      }
    },
    {
      "lawData": {
        "title": "Further Continuing Appropriations and Other Extensions Act, 2024",
        "date": "2023-11-17",
        "summary": "Further Continuing Appropriations and Other Extensions Act, 2024 This act provides continuing FY2024 appropriations for federal agencies. The act also extends several expiring programs and authorities, including programs authorized by the 2018 farm bill and several public health programs.  DIVISION A--FURTHER CONTINUING APPROPRIATIONS ACT, 2024 Further Continuing Appropriations Act, 2024 (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies and extends several expiring programs and authorities. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires on November 17, 2023. The CR provides funding through January 19, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:  the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.  For most other federal agencies and programs, the CR provides funding through February 2, 2024. The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for:  the Navy's procurement of one Columbia Class Submarine,  activities of the U.S. Secret Service that are related to National Special Security Events and the 2024 Presidential Campaign, and  activities of the Department of Education that are necessary to ensure the continuation of student loan servicing activities.  This section also extends several expiring programs and authorities, including  t..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 22,
        "billType": "hr",
        "billNumber": 6363
      }
    },
    {
      "lawData": {
        "title": "Making further continuing appropriations for the fiscal year ending September 30, 2024, and for other purposes.",
        "date": "2024-01-19",
        "summary": "Further Additional Continuing Appropriations and Other Extensions Act, 2024 This act provides continuing FY2024 appropriations for federal agencies. The act also extends several expiring programs and authorities, including several public health programs.  DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2024  Further Additional Continuing Appropriations Act, 2024   (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.  The CR provides funding through March 1, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:    the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023;   the Energy and Water Development and Related Agencies Appropriations Act, 2023;   the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and   the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.   (Under the current CR, these agencies and programs are funded through January 19, 2024.)  For most other federal agencies and programs, the CR provides funding through March 8, 2024. (Under the current CR, these agencies and programs are funded through February 2, 2024.)  The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for the National Nuclear Security Administration and the Federal Aviation Administration.  In addition, the CR allows the Department of Defense to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.  The CR also extends the aut..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 35,
        "billType": "hr",
        "billNumber": 2872
      }
    },
    {
      "lawData": {
        "title": "Moving Americans Privacy Protection Act",
        "date": "2024-02-09",
        "summary": "Moving Americans Privacy Protection ActThis act revises requirements regarding the public disclosure of personally identifiable information contained in the manifest of vessels or aircraft entering a U.S. port or place. Specifically, the act directs U.S. Customs and Border Protection (CBP) to remove such information, including Social Security numbers and passport numbers, from a manifest signed and transmitted to CBP before it is accessible by the public."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 39,
        "billType": "hr",
        "billNumber": 1568
      }
    },
    {
      "lawData": {
        "title": "Overtime Pay for Protective Services Act of 2023",
        "date": "2024-02-06",
        "summary": "Overtime Pay for Protective Services Act of 2023 This bill extends through 2028 and modifies the authority to provide premium pay for protective services employees of the U.S. Secret Service that exceeds certain statutory limits on premium pay. The bill also requires the Secret Service to provide related information to Congress.  The bill provides that, if the bill is enacted after December 31, 2023, the extension applies as if it were enacted on December 31, 2023. The bill also specifies that employees who perform routine administrative or technical work are not eligible for this premium pay. Next, within 180 days of the bill's enactment, the Secret Service must report to Congress on how it is addressing the demand for Secret Service protection personnel and recommend strategies for reducing the use of overtime. The bill also requires the Secret Service to report to Congress: (1) the number of employees receiving premium pay above the statutory cap; (2) the number of employees who were not fully compensated due to the statutory cap and the total amount that employees would have been paid without the cap; (3) the total, median, mean, and greatest amounts of premium pay above the cap; and (4) a list of personnel who received premium pay above the cap and separated from the agency. This information must be provided for each calendar year and updated quarterly. Further, the Secret Service must report to Congress on the effect that the bill has had on this data. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 38,
        "billType": "s",
        "billNumber": 3427
      }
    },
    {
      "lawData": {
        "title": "A bill to provide remote access to court proceedings for victims of the 1988 Bombing of Pan Am Flight 103 over Lockerbie, Scotland.",
        "date": "2024-01-26",
        "summary": "This bill requires federal courts to make remote access to certain criminal court proceedings available for victims of the bombing of Pan American Flight 103 over&nbsp;Lockerbie, Scotland, on December 21, 1988. Specifically, federal courts must make remote access available to the proceedings in the criminal case against Abu Agila Mohammed Mas'ud Kheir Al-Marimi and against any co-conspirator subsequently charged and prosecuted in federal court for crimes related to the bombing of Pan American Flight 103. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 37,
        "billType": "s",
        "billNumber": 3250
      }
    },
    {
      "lawData": {
        "title": "National Defense Authorization Act for Fiscal Year 2024",
        "date": "2023-12-22",
        "summary": "National Defense Authorization Act for Fiscal Year 2024  This bill authorizes FY2024 appropriations and sets forth policies for Department of Defense (DOD) programs and activities, military construction, the national security programs of the Department of Energy (DOE), and the Maritime Administration, as well as the Department of State and the Central Intelligence Agency (CIA). It also authorizes appropriations for the Defense Nuclear Safety Board and the Naval Petroleum Reserves, and sets policy for several other agencies, including the Department of Homeland Security (DHS). The bill authorizes appropriations, but it does not provide budget authority, which is provided by appropriations legislation. For additional information on the National Defense Authorization Act (NDAA) see  CRS In Focus IF10516, Defense Primer: Navigating the NDAA, CRS In Focus IF10515, Defense Primer: The NDAA Process, and CRS Insight IN12210, FY2024 NDAA: Status of Legislative Activity.    TITLE I--PROCUREMENT This title authorizes appropriations for the acquisition or modification of various military items (such as aircraft, ships, tracked combat vehicles, missiles, and ammunition) and sets policy for certain procurement programs.  Below are some examples of provisions in this title.  Sec. 113 requires the Army to submit a strategy for FY2025 and every five years afterwards for its tactical wheeled vehicle program. Sec. 123 authorizes the Navy to enter into multiyear procurement contracts for 10 Virginia class attack submarines. Sec. 131 prohibits the Air Force from retiring RQ-4 Global Hawk unmanned aerial vehicles until after the end of FY2028 and limits the Air Force from reducing the fleet below 10 aircraft. Sec. 132 limits the Air Force from retiring T-1A training aircraft until the Air Force certifies the implementation of the Undergraduate Pilot Training 2.5 curriculum. Sec. 133 reduces the minimum number of A-10 aircraft that the Air Force must maintain. Sec. 134 reduces the total m..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 31,
        "billType": "hr",
        "billNumber": 2670
      }
    },
    {
      "lawData": {
        "title": "Grand Ronde Reservation Act Amendment of 2023",
        "date": "2023-12-26",
        "summary": "Grand Ronde Reservation Act Amendment of 2023  This act revises the land claims of the Confederated Tribes of the Grand Ronde Community of Oregon. In particular, the act specifies that only the tribe's claims to the 84 acres of land known as the Thompson Strip, rather than the tribe's claims to any lands within Oregon, are extinguished. Additionally, the act prohibits gaming on any real property obtained by the tribe as part of a land claim settlement approved by the United States, including any real property purchased with funds granted as part of any land claim settlement."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 32,
        "billType": "hr",
        "billNumber": 1722
      }
    },
    {
      "lawData": {
        "title": "To amend the Siletz Reservation Act to address the hunting, fishing, trapping, and animal gathering rights of the Confederated Tribes of Siletz Indians, and for other purposes.",
        "date": "2023-12-26",
        "summary": "This act provides a process by which the Confederated Tribes of Siletz Indians and Oregon may negotiate to amend or replace the existing agreement defining the tribe's hunting, fishing, trapping, and animal gathering rights. The current agreement, which was made effective by a May 2, 1980, consent decree by the U.S. District Court for the District of Oregon, serves as the exclusive and final determination of the tribe's hunting, fishing, trapping, and gathering rights. This act instead allows an April 22, 1980, agreement between the United States, Oregon, and the tribe (known as the Siletz Agreement) to define the tribe's rights until and unless it is amended or replaced upon mutual agreement of the tribe and Oregon (with specified limitations regarding a new agreement). The act allows the tribe and Oregon to return to the U.S. District Court for the District of Oregon to request the modification or termination of the May 2, 1980, consent decree."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 33,
        "billType": "hr",
        "billNumber": 2839
      }
    },
    {
      "lawData": {
        "title": "Providing for the reappointment of Roger W. Ferguson as a citizen regent of the Board of Regents of the Smithsonian Institution.",
        "date": "2023-12-21",
        "summary": "This joint resolution provides for the reappointment of Roger W. Ferguson as a citizen regent of the Board of Regents of the Smithsonian Institution."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 30,
        "billType": "hjres",
        "billNumber": 64
      }
    },
    {
      "lawData": {
        "title": "Providing for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution.",
        "date": "2023-12-21",
        "summary": "This joint resolution provides for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 28,
        "billType": "hjres",
        "billNumber": 62
      }
    },
    {
      "lawData": {
        "title": "Providing for the appointment of Antoinette Bush as a citizen regent of the Board of Regents of the Smithsonian Institution.",
        "date": "2023-12-21",
        "summary": "This joint resolution provides for the appointment of Antoinette Bush as a citizen regent of the Board of Regents of the Smithsonian Institution."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 29,
        "billType": "hjres",
        "billNumber": 63
      }
    },
    {
      "lawData": {
        "title": "5G SALE Act",
        "date": "2023-12-19",
        "summary": "5G Spectrum Authority Licensing Enforcement Act or the 5G SALE Act This act temporarily authorizes the Federal Communications Commission (FCC) to process applications for licenses or permits for the use of specified bands of the electromagnetic spectrum that were auctioned on or before March 9, 2023. The authorization terminates 90 days after the enactment of the act. The FCC has not processed the licenses or permits for the previously auctioned spectrum because its authority to conduct auctions lapsed on March 9, 2023."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 27,
        "billType": "s",
        "billNumber": 2787
      }
    },
    {
      "lawData": {
        "title": "Duck Stamp Modernization Act of 2023",
        "date": "2023-12-19",
        "summary": "Duck Stamp Modernization Act of 2023 This act modifies provisions regarding the Migratory Bird Hunting and Conservation Stamp, commonly referred to as the duck stamp, including to allow an individual to be carrying an electronic stamp, rather than a paper stamp, at the time of taking waterfowl. The act requires states to issue electronic stamps at the time of purchase and the Department of the Interior to issue a paper stamp after March 10 each year to each individual who purchased an electronic stamp for the preceding waterfowl season. The electronic stamps are valid through the first June 30 after issuance."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 25,
        "billType": "s",
        "billNumber": 788
      }
    },
    {
      "lawData": {
        "title": "National Guard and Reservists Debt Relief Extension Act of 2023",
        "date": "2023-12-19",
        "summary": "National Guard and Reservists Debt Relief Extension Act of 2023 This act extends for an additional four years the exemption from the presumption of abuse means test under Chapter 7 (liquidation) bankruptcy for qualifying members of an Armed Forces reserve component or the National Guard. Specifically, members who, after September 11, 2001, are called to active duty or to perform a homeland defense activity for not less than 90 days qualify for this exemption. The exemption expires on December 19, 2023. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 24,
        "billType": "hr",
        "billNumber": 3315
      }
    },
    {
      "lawData": {
        "title": "A bill to amend the Federal Election Campaign Act of 1971 to extend the Administrative Fine Program for certain reporting violations.",
        "date": "2023-12-19",
        "summary": "This act extends through December 31, 2033, the statutory authorization for the Federal Election Commission Administration Fine Program. This program provides expedited enforcement for late and nonfiled campaign finance disclosure reports."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 26,
        "billType": "s",
        "billNumber": 2747
      }
    },
    {
      "lawData": {
        "title": "Wounded Warrior Access Act",
        "date": "2023-11-13",
        "summary": "Wounded Warrior Access Act This act requires the Department of Veterans Affairs (VA) to establish and maintain a secure online tool or website to enable a claimant or their representative to make records requests related to VA claims and benefits. Requests for records must specify in which format the copy is desired. The VA must notify a requester within 10 days that their request has been received and must fulfill the request within 120 days. The act also requires the VA to ensure that each time a claimant logs in to a website or online tool of the VA, the website or online tool displays in plain language (1) a warning regarding violations of laws related to agents and attorneys, (2) a link to an online tool to report violations, (3) a link to an online tool to search for a VA-recognized agent or attorney, and (4) a link to a website or online tool providing final decisions on discipline of agents and attorneys for violations."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 21,
        "billType": "hr",
        "billNumber": 1226
      }
    },
    {
      "lawData": {
        "title": "Korean American VALOR Act",
        "date": "2023-11-13",
        "summary": "Korean American Vietnam Allies Long Overdue for Relief Act or the Korean American VALOR Act This act expands eligibility for specified Department of Veterans Affairs (VA) benefits (e.g., medical and dental care) to certain veterans of the armed forces of South Korea who served in Vietnam between January 9, 1962, and May 7, 1975, or during a time period determined by the VA. The act authorizes the VA to furnish such benefits under an existing law, which requires (1) a request by South Korea, and (2) a reciprocity agreement that provides for reimbursement of expenses incurred by the VA for the provision of care. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 20,
        "billType": "hr",
        "billNumber": 366
      }
    },
    {
      "lawData": {
        "title": "Pala Band of Mission Indians Land Transfer Act of 2023",
        "date": "2023-07-28",
        "summary": "Pala Band of Mission Indians Land Transfer Act of 2023 This act directs the Department of the Interior to take approximately 721.12 acres of land in San Diego County, California, into trust for the benefit of the Pala Band of Mission Indians, if the tribe transfers title to that land to the United States. The land is made part of the Pala Indian Reservation. The act generally prohibits gaming on any of the land taken into trust."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 11,
        "billType": "hr",
        "billNumber": 423
      }
    },
    {
      "lawData": {
        "title": "Continuing Appropriations Act, 2024 and Other Extensions Act",
        "date": "2023-09-30",
        "summary": "Continuing Appropriations Act, 2024 and Other Extensions Act This act provides continuing FY2024 appropriations to federal agencies through November 17, 2023, and provides emergency funding for disaster relief. It also extends several expiring programs and authorities, including several Federal Aviation Administration programs, the National Flood Insurance Program, Federal Drug Administration user fees for animal drug applications, and several public health programs. DIVISION A--CONTINUING APPROPRIATIONS ACT, 2024 This division provides continuing FY2024 appropriations to federal agencies through the earlier of November 17, 2023, or the enactment of the applicable appropriations act. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when FY2024 begins on October 1, 2023. The CR funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. This division also provides emergency funding to respond to natural disasters. (Sec. 101) This section provides FY2024 appropriations to federal agencies for continuing projects or activities at the levels and under the conditions included in specified FY2023 appropriations acts. The section also extends several immigration-related programs and specifies several exceptions. (Sec. 102) This section prohibits the Department of Defense (DOD) from funding new or accelerated production of certain projects and other activities and certain multiyear procurements prior to the enactment of the regular annual appropriations act. (Sec. 103) This section specifies that funds provided by Section 101 of this division shall be available to the extent and in the manner that would be provided in the pertinent appropriations act. (Sec. 104) This section generally prohibits appropriations provided by Section 101 of this division from bein..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 15,
        "billType": "hr",
        "billNumber": 5860
      }
    },
    {
      "lawData": {
        "title": "A bill to amend title 38, United States Code, to strengthen benefits for children of Vietnam veterans born with spina bifida, and for other purposes.",
        "date": "2023-10-06",
        "summary": "This act addresses Department of Veterans Affairs (VA) benefits and care for certain children with spina bifida or other birth defects. The act requires the VA to provide health care, job training, and monetary benefits for the duration of the child's life. The act covers a child, regardless of age or marital status, who (1) has spina bifida and is the natural child of a Vietnam veteran or a veteran of specified service in Korea or Thailand who was conceived after the date on which the veteran entered service in Vietnam, Korea, or Thailand; or (2) has certain birth defects and is the natural child of a woman Vietnam veteran. The act requires the VA to establish an advisory council on health care and benefits for covered children. Additionally, the VA must establish care and coordination teams for covered children. At least every 180 days, the teams must conduct outreach to ensure the continued care of the children and assist with any necessary changes in care.  The VA must report to Congress a list of conditions that will trigger outreach to covered children and must attempt to contact such children as soon as practicable after the identification of a condition. The Veterans Benefits Administration and the Veterans Health Administration must enter into a memorandum of understanding to better assist covered children."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 18,
        "billType": "s",
        "billNumber": 112
      }
    },
    {
      "lawData": {
        "title": "Protecting Hunting Heritage and Education Act",
        "date": "2023-10-06",
        "summary": "Protecting Hunting Heritage and Education Act This act authorizes the use of federal elementary and secondary education funds to purchase or use dangerous weapons for purposes of providing students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts.  Current law prohibits the use of these funds to provide any person with a dangerous weapon or training in the use of a dangerous weapon. The act specifies that this prohibition shall not apply to the use of these funds for permissible program activities that provide students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 17,
        "billType": "hr",
        "billNumber": 5110
      }
    },
    {
      "lawData": {
        "title": "A bill to amend title 38, United States Code, to extend and modify certain authorities and requirements relating to the Department of Veterans Affairs, and for other purposes.",
        "date": "2023-10-06",
        "summary": "This act extends the eligibility or applicability of various Department of Veterans Affairs (VA) programs and benefits. First, the act extends from three to five years the authority for additional licensed health care professionals (i.e., physician assistants, nurse practitioners, audiologists, and psychologists) to perform medical disability examinations as part of the existing VA pilot program related to the use of contract physicians for disability examinations. Currently, when an individual transfers fewer than 12 credits from a program of education that is closed or disapproved, the individual is deemed to have not received those credits, and no charge from the individual's entitlement to education assistance may be made for that period of enrollment. Under the act, this period of relief for those affected by a closure or disapproval is extended by two years to apply to programs that close or discontinue before September 30, 2025. The act extends through FY2028 the authorization for VA emergency preparedness for public health emergencies. The act also extends the applicability of certain loan fee rates through November 15, 2031, under the VA's home loan program."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 19,
        "billType": "s",
        "billNumber": 2795
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the clinic of the Department of Veterans Affairs in Gallup, New Mexico, as the Hiroshi \"Hershey\" Miyamura VA Clinic.",
        "date": "2023-10-02",
        "summary": "This act designates the clinic of the Department of Veterans Affairs in Gallup, New Mexico, as the Hiroshi &quot;Hershey&quot; Miyamura Department of Veterans Affairs Clinic or the Hiroshi &quot;Hershey&quot; Miyamura VA Clinic."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 16,
        "billType": "s",
        "billNumber": 475
      }
    },
    {
      "lawData": {
        "title": "COVID-19 Origin Act of 2023",
        "date": "2023-03-20",
        "summary": "COVID-19 Origin Act of 2023 This bill requires the Office of the Director of National Intelligence (ODNI) to declassify all information relating to potential links between the Wuhan Institute of Virology and the origin of COVID-19. The ODNI must submit to Congress an unclassified report with all such information with redactions only as necessary to protect sources and methods."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 2,
        "billType": "s",
        "billNumber": 619
      }
    },
    {
      "lawData": {
        "title": "Securing the U.S. Organ Procurement and Transplantation Network Act",
        "date": "2023-09-22",
        "summary": "Securing the U.S. Organ Procurement and Transplantation Network Act This bill modifies how the Health Resources and Services Administration (HRSA) funds and manages the Organ Procurement and Transplantation Network. This network is a public-private partnership that links the professionals involved in the U.S. donation and transplantation system. Historically, only one organization has received a contract for managing the network. The bill expressly authorizes HRSA to award multiple grants, contracts, or cooperative agreements to support the operation of the network and eliminates a cap on the amount of funding available for supporting the network. The bill also specifies that the network shall be operated through awards that are distinct from awards for supporting the operation of the network's board of directors. Additionally, the Government Accountability Office must review the historical financing of the network, including the use of registration fees."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 14,
        "billType": "hr",
        "billNumber": 2544
      }
    },
    {
      "lawData": {
        "title": "United States-Taiwan Initiative on 21st-Century Trade First Agreement Implementation Act",
        "date": "2023-08-07",
        "summary": "United States-Taiwan Initiative on 21st-Century Trade First Agreement Implementation Act This bill expresses the approval of Congress for the June 1, 2023, agreement regarding trade between the United States and Taiwan. The bill also imposes requirements on the negotiations of certain further trade agreements between the United States and Taiwan. (The June 1, 2023, agreement, which addresses issues such as customs administration and regulatory practices, is the first of several expected agreements under the United States-Taiwan Initiative on 21st-Century Trade.) The June 1, 2023, agreement may enter into force no earlier than 30 days after the President certifies in writing to Congress that Taiwan has taken measures necessary to comply with the agreement. The bill also imposes requirements on the negotiation of further agreements under the United States-Taiwan Initiative on 21st-Century Trade, such as requiring the U.S. Trade Representative (USTR) to (1) share any U.S. negotiating texts with Congress prior to sharing the text with Taiwan or any parties outside of the executive branch, (2) share any negotiating texts from Taiwan within three days of receipt, and (3) provide daily briefings to certain Members of Congress during negotiating rounds. A further agreement shall not take effect unless (1) the President, at least 60 days before entering into the further agreement, makes the text publicly available on a USTR website; and (2) a bill is enacted into law expressly approving the further agreement."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 13,
        "billType": "hr",
        "billNumber": 4004
      }
    },
    {
      "lawData": {
        "title": "Fiscal Responsibility Act of 2023",
        "date": "2023-06-03",
        "summary": "Fiscal Responsibility Act of 2023 This act increases the federal debt limit, establishes new discretionary spending limits, rescinds unobligated funds, expands work requirements for federal programs, and modifies other requirements related to the federal budget process.  DIVISION A--LIMIT FEDERAL SPENDING TITLE I--DISCRETIONARY SPENDING LIMITS FOR DISCRETIONARY CATEGORY  (Sec. 101) This section establishes new discretionary spending limits (also known as spending caps) for FY2024 and FY2025 that are enforced with sequestration (i.e., automatic, across-the-board spending reductions). The Congressional Budget Office (CBO) has estimated that the spending limits will reduce spending below the levels included in its baseline projections.  In addition, this section extends and establishes new limits for several adjustments to discretionary spending limits that are permitted under current law to accommodate additional appropriations for certain activities. These adjustments apply to spending for    continuing disability reviews and redeterminations,   health care fraud and abuse control, and   reemployment services and eligibility assessments.  The section also extends the adjustment to discretionary spending limits for disaster relief funding. The limits for this adjustment are based on a statutory formula, which is modified by this section.  During FY2026-FY2029, if the annual budget resolution has not been adopted by Congress by April 15, this section requires the chairman of the House Budget Committee to submit to the House a spending allocation for the House Appropriations Committee that is consistent with levels specified in this section.  Finally, the section provides funding for (1) the Department of Veterans Affairs Cost of War Toxic Exposures Fund, and (2) the Department of Commerce Nonrecurring Expenses Fund.  (Sec. 102) This section requires the discretionary spending limits to be revised if a continuing resolution (CR) is in effect at the beginning of the cale..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 5,
        "billType": "hr",
        "billNumber": 3746
      }
    },
    {
      "lawData": {
        "title": "Relating to a national emergency declared by the President on March 13, 2020.",
        "date": "2023-04-10",
        "summary": "This joint resolution terminates the national emergency concerning COVID-19 declared by the President on March 13, 2020."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 3,
        "billType": "hjres",
        "billNumber": 7
      }
    },
    {
      "lawData": {
        "title": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \"Pfc. Justin T. Paton Department of Veterans Affairs Clinic\".",
        "date": "2023-07-28",
        "summary": "This act designates the new community-based outpatient clinic of the Department of Veterans Affairs in Indian River, Michigan, as the Pfc. Justin T. Paton Department of Veterans Affairs Clinic."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 12,
        "billType": "hr",
        "billNumber": 3672
      }
    },
    {
      "lawData": {
        "title": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
        "date": "2023-07-26",
        "summary": "250th Anniversary of the United States Marine Corps Commemorative Coin Act This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.  All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 10,
        "billType": "hr",
        "billNumber": 1096
      }
    },
    {
      "lawData": {
        "title": "Providing Accountability Through Transparency Act of 2023",
        "date": "2023-07-25",
        "summary": "Providing Accountability Through Transparency Act of 2023 This act requires the notice of a proposed rule by a federal agency to include the internet address of a summary of the rule. The summary must be 100 words or fewer, written in plain language, and posted on regulations.gov."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 9,
        "billType": "s",
        "billNumber": 111
      }
    },
    {
      "lawData": {
        "title": "Fiscal Year 2023 Veterans Affairs Major Medical Facility Authorization Act",
        "date": "2023-07-18",
        "summary": "Fiscal Year 2023 Veterans Affairs Major Medical Facility Authorization Act This act authorizes the Department of Veterans Affairs to carry out specified major medical facility projects during FY2023. The bill also indicates the maximum amount that can be spent on each project."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 8,
        "billType": "s",
        "billNumber": 30
      }
    },
    {
      "lawData": {
        "title": "CADETS Act",
        "date": "2023-06-30",
        "summary": "Changing Age-Determined Eligibility To Student Incentive Payments Act or the CADETS Act  This act modifies the age requirements for the Student Incentive Payment Program, which provides financial support to cadets who attend one of six state maritime academies and commit to a post-graduation service obligation.  Specifically, the act modifies the age requirements to allow older cadets to qualify for the program if they will meet the age requirements for enlistment or commission in the Navy Reserve at the time of their graduation. Current age requirements prohibit cadets older than 25 from participating in the program."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 7,
        "billType": "s",
        "billNumber": 467
      }
    },
    {
      "lawData": {
        "title": "Veterans' COLA Act of 2023",
        "date": "2023-06-14",
        "summary": "Veterans' Compensation Cost-of-Living Adjustment Act of 2023 or the Veterans' COLA Act of 2023 This act requires the Department of Veterans Affairs (VA) to increase the amounts payable for wartime disability compensation, additional compensation for dependents, the clothing allowance for certain disabled veterans, and dependency and indemnity compensation for surviving spouses and children. Specifically, the VA must increase the amounts by the same percentage as the cost-of-living increase in benefits for Social Security recipients that is effective on December 1, 2023. The bill requires the VA to publish the amounts payable, as increased, in the Federal Register. The VA is authorized to make a similar adjustment to the rates of disability compensation payable to persons who have not received compensation for service-connected disability or death."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 6,
        "billType": "s",
        "billNumber": 777
      }
    },
    {
      "lawData": {
        "title": "NOTAM Improvement Act of 2023",
        "date": "2023-06-03",
        "summary": "NOTAM Improvement Act of 2023 This act directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.  Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations. By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 4,
        "billType": "hr",
        "billNumber": 346
      }
    },
    {
      "lawData": {
        "title": "Disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
        "date": "2023-03-20",
        "summary": "This joint resolution nullifies the Revised Criminal Code Act of 2022, enacted by the council of the District of Columbia (DC). The act makes a variety of changes to DC criminal laws, including by providing statutory definitions for various elements of criminal offenses, modifying sentencing guidelines and penalties, and expanding the right to a jury trial for certain misdemeanor crimes."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 1,
        "billType": "hjres",
        "billNumber": 26
      }
    },
    {
      "lawData": {
        "title": "Building Chips in America Act of 2023",
        "date": "2024-10-02",
        "summary": "Building Chips in America Act of 2023This bill modifies and limits the review of certain semiconductor (i.e., microchip) projects under the National Environmental Policy Act of 1969 (NEPA) and the National Historic Preservation Act (NHPA).Specifically, the bill exempts from NEPA and NHPA specified semiconductor projects that receive financial assistance under the William M. (Mac) Thornberry National Defense Authorization Act for Fiscal Year 2021.Next, the bill allows the Department of Commerce to serve as the lead agency for the review of a semiconductor project that receives such financial assistance but is not exempted from review under NEPA. A single environmental document and joint record of decision must be prepared for a semiconductor project.&nbsp;In completing the environmental review, Commerce may adopt a prior study or decision under certain circumstances. The bill also allows a state to assume the responsibility of an environmental review under NEPA for a semiconductor project.Finally, the bill sets a statute of limitations for certain claims under NEPA."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "2228"
      }
    },
    {
      "lawData": {
        "title": "Congressional Budget Office Data Access Act",
        "date": "2024-10-02",
        "summary": "Congressional Budget Office Data Access Act This bill exempts the Congressional Budget Office (CBO) from the Privacy Act of 1974 to expedite the sharing of data and information between CBO and federal agencies.  Under current law, the Privacy Act of 1974 generally prohibits federal agencies from disclosing certain records pertaining to an individual without the individual's prior written consent. This bill allows federal agencies to disclose such records to CBO (or to an authorized representative of CBO) without obtaining the prior written consent of the individual.  Several agencies, including the Government Accountability Office and the National Archives and Records Administration, are currently exempt from these requirements, and this bill adds CBO to the list of exemptions."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "1549"
      }
    },
    {
      "lawData": {
        "title": "Enhanced Presidential Security Act of 2024",
        "date": "2024-10-01",
        "summary": "Enhanced Presidential Security Act of 2024This bill requires the U.S. Secret Service to apply the same standards for determining the number of agents required to protect Presidents, Vice Presidents, and major Presidential and Vice Presidential candidates. (The Department of Homeland Security identifies major Presidential and Vice Presidential candidates after consultation with an advisory committee composed of congressional leaders.)"
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "9106"
      }
    },
    {
      "lawData": {
        "title": "CTPAT Pilot Program Act of 2023",
        "date": "2024-10-01",
        "summary": "Customs Trade Partnership Against Terrorism Pilot Program Act of 2023 or the CTPAT Pilot Program Act of 2023 This bill requires the Department of Homeland Security to carry out a pilot program that assesses whether allowing certain entities to participate in the Customs Trade Partnership Against Terrorism (CTPAT) would enhance port security, combat terrorism, prevent supply chain security breaches, or otherwise meet the goals of CTPAT. Such entities are (1) non-asset-based third-party logistics providers that arrange international freight transportation and are licensed by the Department of Transportation; or (2) asset-based third-party logistics providers that facilitate cross-border activity, are licensed or bonded by specified federal agencies, and execute logistics services using their own warehousing assets and resources. The bill requires the Government Accountability Office to report on the effectiveness of CTPAT."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "794"
      }
    },
    {
      "lawData": {
        "title": "GAO Database Modernization Act of 2023",
        "date": "2024-10-01",
        "summary": "GAO Database Modernization Act of 2023 This bill requires federal agencies to report to the Government Accountability Office certain information about agency rules that are made ineffective due to an agency action or other reason."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "679"
      }
    },
    {
      "lawData": {
        "title": "IMPACTT Human Trafficking Act",
        "date": "2024-10-01",
        "summary": "IMPACTT Human Trafficking Act This bill establishes a program within U.S. Immigration and Customs Enforcement, Homeland Security Investigations (HSI) to provide outreach and training to HSI employees who have been exposed to various forms of trauma in working with victims of human trafficking. The bill also provides statutory authority for the HSI Victim Assistance Program. The bill ceases to have effect beginning October 1, 2030."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "670"
      }
    },
    {
      "lawData": {
        "title": "Veteran Improvement Commercial Driver License Act of 2023",
        "date": "2024-10-01",
        "summary": "Veteran Improvement Commercial Driver License Act of 2023 This bill authorizes approval of certain commercial driver education programs for purposes of Department of Veterans Affairs (VA) educational assistance if the programs meet specified requirements. Under current law, the VA may not approve enrollment of a veteran in courses for programs that do not lead to a standard degree that are offered at a new branch (i.e., a branch that has been operating for less than 2 years) of an educational institution. Under the bill, a commercial driver education program offered at a new branch of an educational institution may be approved if it is appropriately licensed and uses the same curriculum as a commercial driver education program offered by the educational institution at another location that is already approved for purposes of VA educational assistance. The educational institution must submit a report demonstrating the curriculum at the new branch is the same as the curriculum at the primary location in order to be exempt from the current prohibition against course approval at new branches."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "656"
      }
    },
    {
      "lawData": {
        "title": "Lake Tahoe Restoration Reauthorization Act",
        "date": "2024-10-01",
        "summary": "Lake Tahoe Restoration Reauthorization ActThis bill reauthorizes through September 30, 2034, activities to restore Lake Tahoe and its surrounding basin. Lake Tahoe is a large freshwater lake on the border of California and Nevada."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "612"
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the facility of the United States Postal Service located at 90 McCamly Street South in Battle Creek, Michigan, as the \"Sojourner Truth Post Office\".",
        "date": "2024-10-01",
        "summary": "Designates the facility of the United States Postal Service located at 90 McCamly Street South in Battle Creek, Michigan, as the \"Sojourner Truth Post Office.\""
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "3851"
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the facility of the United States Postal Service located at 155 South Main Street in Mount Clemens, Michigan, as the \"Lieutenant Colonel Alexander Jefferson Post Office\".",
        "date": "2024-10-01",
        "summary": "Designates the facility of the United States Postal Service located at 155 South Main Street in Mount Clemens, Michigan, as the \"Lieutenant Colonel Alexander Jefferson Post Office.\""
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "3640"
      }
    },
    {
      "lawData": {
        "title": "A bill to designate the facility of the United States Postal Service located at 2075 West Stadium Boulevard in Ann Arbor, Michigan, as the \"Robert Hayden Post Office\".",
        "date": "2024-10-01",
        "summary": "Designates the facility of the United States Postal Service located at 2075 West Stadium Boulevard in Ann Arbor, Michigan, as the \"Robert Hayden Post Office.\""
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "3639"
      }
    },
    {
      "lawData": {
        "title": "Reuse Excess Property Act",
        "date": "2024-10-01",
        "summary": "Reuse Excess Property ActThis bill requires the General Services Administration (GSA) to make publicly available on the internet the data contained in specified federal agency reports on excess personal property. (Personal property is any property except real property and includes vehicles, furniture, and office equipment.)&nbsp;The bill also requires federal agencies to make public their internal guidance on using excess personal property to meet agency needs. Such guidance must include certain topics, such as (1) a requirement to consider excess personal property before buying new, and (2) how to evaluate the suitability of excess personal property for use. Federal agencies must also provide this information to the GSA.&nbsp;"
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "2685"
      }
    },
    {
      "lawData": {
        "title": "Alzheimer’s Accountability and Investment Act",
        "date": "2024-10-01",
        "summary": "Alzheimer's Accountability and Investment ActThis bill requires the National Institutes of Health to annually submit, beginning in FY2024, an estimate of its budget and personnel needs for carrying out initiatives pursuant to the National Alzheimer's Project directly to the President for review and transmittal to Congress. The Department of Health and Human Services and the Advisory Council on Alzheimer's Research, Care, and Services may comment on the budget estimate but may not change it. The National Alzheimer's Project supports coordination of federal planning, research, and other efforts to address Alzheimer's disease and related dementias."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "134"
      }
    },
    {
      "lawData": {
        "title": "NAPA Reauthorization Act",
        "date": "2024-10-01",
        "summary": "NAPA Reauthorization ActThis bill extends through 2035 and makes other changes to the National Alzheimer's Project. This project supports coordination of federal planning, programs, and other efforts to address Alzheimer's disease and related dementias.In particular, the bill incorporates a focus on promoting healthy aging and reducing risk factors associated with cognitive decline.The bill also expands the Advisory Council on Alzheimer's Research, Care, and Services to include additional members, such as (1) a researcher with experience recruiting and retaining diverse clinical trial participants, (2) an individual diagnosed with Alzheimer's disease, and (3) representatives from additional federal agencies (e.g., the Department of Justice)."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "133"
      }
    },
    {
      "lawData": {
        "title": "Congressional Budget Office Data Sharing Act",
        "date": "2024-09-30",
        "summary": "Congressional Budget Office Data Sharing ActThis bill specifies that the Congressional Budget Office (CBO) is authorized to obtain data from executive branch agencies with or without a written agreement if CBO maintains the same level of confidentiality that is required of the agency that provides the data.The bill also requires CBO to submit a report to Congress regarding requests for information from executive branch agencies and any challenges it faced in accessing the information."
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "7032"
      }
    },
    {
      "lawData": {
        "title": "United States Commission on International Religious Freedom Reauthorization Act of 2024",
        "date": "2024-09-30",
        "summary": "United States Commission on International Religious Freedom Reauthorization Act of 2024This bill reauthorizes the U.S. Commission on International Religious Freedom through FY2026."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "3764"
      }
    },
    {
      "lawData": {
        "title": "Continuing Appropriations and Extensions Act, 2025",
        "date": "2024-09-26",
        "summary": "Continuing Appropriations and Extensions Act, 2025This bill provides continuing FY2025 appropriations for federal agencies, provides additional funding for the U.S. Secret Service, and extends various expiring programs and authorities.Specifically, the bill provides continuing FY2025 appropriations to federal agencies through the earlier of December 20, 2024, or the enactment of the applicable appropriations act. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2025 appropriations bills have not been enacted when FY2025 begins on October 1, 2024.&nbsp;The CR funds most programs and activities at the FY2024 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the bill provides additional funding for the Secret Service to carry out protective operations, including for the 2024 presidential campaign and National Special Security Events.&nbsp;In addition, the bill extends several expiring programs and authorities, includingseveral public health programs,various programs and authorities related to veterans,the National Flood Insurance Program,the Temporary Assistance for Needy Families (TANF) program,the Food for Peace program,the authorities of the&nbsp;U.S. Parole Commission,the Department of Homeland Security (DHS) National Cybersecurity Protection System,authorities for DHS and the Department of Justice to take certain actions to mitigate a credible threat from an unmanned aircraft system,&nbsp;several Department of Agriculture programs and authorities,the Department of Defense's authority to use funds for certain military construction projects, andauthorities for sanctions related to human rights abuses in Hong Kong.&nbsp;&nbsp;"
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "9747"
      }
    },
    {
      "lawData": {
        "title": "Poison Control Centers Reauthorization Act of 2024",
        "date": "2024-09-26",
        "summary": "Poison Control Centers Reauthorization Act of 2024This act reauthorizes through FY2029 several poison control center resources and services.Specifically, the act reauthorizes (1) the national poison control center help line (i.e., the&nbsp;Poison Help line), (2) a national media campaign to educate the public and health care providers about the help line and other resources, and (3) a grant program to support the ability of poison control centers to provide services."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "4351"
      }
    },
    {
      "lawData": {
        "title": "Billie Jean King Congressional Gold Medal Act",
        "date": "2024-09-26",
        "summary": "Billie Jean King Congressional Gold Medal ActThis bill provides for&nbsp;the award of a Congressional Gold Medal to Billie Jean King in recognition of her&nbsp;courageous a groundbreaking leadership in advancing equal rights for women&nbsp;in athletics, education, and society."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "2861"
      }
    },
    {
      "lawData": {
        "title": "Dustoff Crews of the Vietnam War Congressional Gold Medal Act",
        "date": "2024-09-26",
        "summary": "Dustoff Crews of the Vietnam War Congressional Gold Medal Act This bill provides for the award of a single Congressional Gold Medal to Dustoff crews (helicopter air ambulance crews) of the Vietnam War in recognition of their heroic military service."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "2825"
      }
    },
    {
      "lawData": {
        "title": "SIREN Reauthorization Act",
        "date": "2024-09-26",
        "summary": "Supporting and Improving Rural EMS Needs Reauthorization Act or the SIREN Reauthorization Act This bill reauthorizes through FY2028 and otherwise modifies a grant program for improving emergency medical services (EMS) in rural areas. The modifications include requiring the use of grant funds to train EMS personnel on caring for individuals with mental health and substance use disorders in emergency situations and permitting the use of grant funds to acquire overdose reversal drugs and devices."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "265"
      }
    },
    {
      "lawData": {
        "title": "Launch Communications Act",
        "date": "2024-09-26",
        "summary": "Launch Communications ActThis bill requires the Federal Communications Commission (FCC) to facilitate access to specified broadband spectrum frequencies for commercial space launches and reentries.Under current law, commercial missions launching from the United States to space must use government-owned spectrum to communicate with the rockets during launch, and private companies must apply to the FCC to receive special temporary authority to use such spectrum. On June 28, 2021, the FCC issued a final rule adopting a nonfederal secondary allocation of the 2200-2290 megahertz frequencies of the electromagnetic spectrum for use during commercial space launches and reentries.The bill requires the FCC to (1) adopt service rules for access to additional frequencies for commercial space launches and reentries and complete associated rulemaking activities (e.g., those that set technical specifications and eligibility requirements), and (2) allocate the frequencies.The FCC must also streamline the process for access authorizations, including by providing for (1) authorizations to access specified frequencies for multiple commercial space launches and reentries from one or more federal or private launch or reentry sites, (2) authorizations for multiple uses of such frequencies for a commercial space launch or reentry, (3) electronic filing and processing of access applications, and (4) improved coordination between the FCC and the National Telecommunications and Information Administration to increase the speed of the review of such applications.&nbsp;"
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "1648"
      }
    },
    {
      "lawData": {
        "title": "Veterans Benefits Continuity and Accountability Supplemental Appropriations Act, 2024",
        "date": "2024-09-20",
        "summary": "Veterans Benefits Continuity and Accountability Supplemental Appropriations Act, 2024This bill provides FY2024 supplemental appropriations to the Veterans Benefits Administration (VBA) within the Department of Veterans Affairs (VA) and establishes reporting requirements related to VA funding and projected shortfalls.&nbsp;&nbsp;Specifically, the bill provides FY2024 supplemental appropriations to the VBA forCompensation and Pensions, and&nbsp;Readjustment Benefits.In addition, the bill requires the VA to report to Congress on (1) corrections the VA will make to improve forecasting, data quality, and budget assumptions relating to budget submissions for the VBA's Compensation and Pensions and Readjustment Benefits accounts; and (2) the status of funds provided to these accounts for FY2024, FY2025, and FY2026 by this or any other act.The bill also requires the VA Office of Inspector General to report to Congress on (1) the circumstances and causes of certain funding shortfalls that the VA has projected for the VBA and the Veterans Health Administration, and (2) actions that the VA can take to improve the accuracy of the supporting information submitted with the President's budget and prevent funding shortfalls.&nbsp;"
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "9468"
      }
    },
    {
      "lawData": {
        "title": "Royalty Resiliency Act",
        "date": "2024-09-20",
        "summary": "Royalty Resiliency ActThis bill modifies the process under which oil and gas leaseholders who have entered into certain joint drilling agreements (i.e., a communitization agreement or a unit agreement, except agreements containing Indian lands) to drill wells on leased land pay royalties to the Department of the Interior under the Federal Oil and Gas Royalty Management Act of 1982.Under current law, Interior must issue a determination of allocations of royalty payments for oil and gas production under a joint agreement within 120 days of a request for determination. Generally, the first leaseholder to drill must pay any royalties due to Interior for all oil and gas production on the land subject to the agreement until Interior determines the royalty allocations of each leaseholder. If Interior fails to issue the determination by that deadline, then it must waive interest due on royalty obligations until the end of the month following the month in which the determination was made.Under the bill, a leaseholder must pay royalties on oil and gas production based on the lessee's proposed allocation of production under the joint agreement until Interior issues a determination of royalty allocations. After Interior issues the determination, then the lessee must correct, if necessary, the amount of royalties paid by the end of the third month following the month in which the lessee received the determination from Interior. Subject to the full and timely payment of monthly royalties in accordance with the agreement,&nbsp;Interior must waive interest due on royalty obligations until the end of the third month.&nbsp;&nbsp;&nbsp;"
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "7377"
      }
    },
    {
      "lawData": {
        "title": "Starr–Camargo Bridge Expansion Act",
        "date": "2024-09-13",
        "summary": "Starr–Camargo Bridge Expansion ActThis bill authorizes the Starr-Camargo Bridge Company to expand the Starr-Camargo international toll bridge near Rio Grande City, Texas, including expanding and adding adjacent spans to the existing bridge."
      },
      "requestData": {
        "congress": "118",
        "billType": "s",
        "billNumber": "1608"
      }
    },
    {
      "lawData": {
        "title": "Preventing the Financing of Illegal Synthetic Drugs Act",
        "date": "2024-09-13",
        "summary": "Preventing the Financing of Illegal Synthetic Drugs Act This bill requires the Government Accountability Office to carry out a study on illicit financing in connection with the trafficking of synthetic drugs, including fentanyl and methamphetamine, fentanyl- and methamphetamine-related substances, Captagon, and fentanyl and methamphetamine precursors, and to report to Congress."
      },
      "requestData": {
        "congress": "118",
        "billType": "hr",
        "billNumber": "1076"
      }
    }
  ]
}