{
  "userCategories": "Teacher, age 60, female, married, no children, lives in Washington DC, low-income, tax bracket 10%, 3 DUIs (on probation), driving license suspended, works at a public high school, Master's degree in Education, 35 years teaching experience.",
  "filteredLaws": [
    {
      "lawData": {
        "title": "Debbie Smith Act of 2023",
        "date": "2024-07-30",
        "summary": "Debbie Smith Act of 2023 This bill reauthorizes through FY2029 the Debbie Smith DNA Backlog Grant Program. The program provides grants to state and local governments to improve and expand the collection and analysis of DNA evidence, including evidence in sexual assault kits."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 72,
        "billType": "hr",
        "billNumber": 1105
      },
      "affectedCategories": [
        {
          "categoryName": "Social Impact Awareness",
          "impactLevel": 6
        }
      ]
    },
    {
      "lawData": {
        "title": "Reforming Intelligence and Securing America Act",
        "date": "2024-04-20",
        "summary": "Reforming Intelligence and Securing America Act  This bill reauthorizes Title VII of the Foreign Intelligence Surveillance Act (FISA) for five years and makes changes to FISA, including certain restrictions on surveillance under Section 702. (Sec. 702 concerns electronic surveillance of non-U.S. persons believed to be outside the United States to obtain foreign intelligence information. Information about U.S. persons may incidentally be acquired by this type of surveillance and subsequently searched or &quot;queried&quot; under certain circumstances.)  The bill places statutory limits on querying the contents of information collected under Section 702, including   prohibiting Federal Bureau of Investigation (FBI) personnel from making U.S. person queries without prior approval by certain FBI supervisors or attorneys unless the query might mitigate or eliminate a threat to life or serious bodily harm;  requiring the FBI Deputy Director to approve certain politically sensitive query terms (such as those that identify certain elected and appointed officials);  prohibiting the involvement of political appointees in the approval process for such politically sensitive query requests; and   requiring the FBI Director to establish consequences for noncompliant querying of U.S. person terms, including zero tolerance for willful misconduct.   Other provisions include    requiring applications for a surveillance order under FISA to be supported by sworn statements and limiting the use of information in such applications derived from political organizations or media sources,  increasing criminal penalties related to FISA, and   requiring adverse consequences (e.g., suspension without pay or removal) for government officers and employees who engage in intentional misconduct with respect to proceedings before the Foreign Intelligence Surveillance Court or the Foreign Intelligence Surveillance Court of Review.  "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 49,
        "billType": "hr",
        "billNumber": 7888
      },
      "affectedCategories": [
        {
          "categoryName": "Legal Status",
          "impactLevel": 8
        }
      ]
    },
    {
      "lawData": {
        "title": "Further Consolidated Appropriations Act, 2024",
        "date": "2024-03-23",
        "summary": "Further Consolidated Appropriations Act, 2024 This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities.  Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills:  the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024.  The departments, agencies, and activities funded in the bill include   the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President,  the judiciary,  federal payments to the District of Columbia,  the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress,  the Department of State, and several related and independent agencies.  In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration. The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 47,
        "billType": "hr",
        "billNumber": 2882
      },
      "affectedCategories": [
        {
          "categoryName": "Employment",
          "impactLevel": 7
        },
        {
          "categoryName": "Education Funding",
          "impactLevel": 8
        },
        {
          "categoryName": "Economic Assistance",
          "impactLevel": 6
        }
      ]
    },
    {
      "lawData": {
        "title": "Disaster Assistance Deadlines Alignment Act",
        "date": "2024-03-18",
        "summary": "Disaster Assistance Deadlines Alignment Act This bill modifies the deadline for applying for disaster unemployment assistance. Specifically, the bill matches the deadline for an individual seeking unemployment assistance for a major disaster under the Robert T. Stafford Disaster Relief and Emergency Assistance Act to the application deadline for individuals and households seeking other assistance under that act. The bill authorizes an extension of that deadline if the individual (1) has good cause for the late submission, and (2) submits the application during the period when disaster assistance is being provided."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 44,
        "billType": "s",
        "billNumber": 1858
      },
      "affectedCategories": [
        {
          "categoryName": "Employment Status",
          "impactLevel": 7
        },
        {
          "categoryName": "Income Level",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "END FENTANYL Act",
        "date": "2024-03-18",
        "summary": "Eradicating Narcotic Drugs and Formulating Effective New Tools to Address National Yearly Losses of life Act or the END FENTANYL Act This bill requires U.S. Customs and Border Protection to review and update, as necessary, manuals and policies related to inspections at ports of entry to ensure the uniformity of inspection practices to effectively detect illegal activity along the border, such as the smuggling of drugs and humans. "
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 43,
        "billType": "s",
        "billNumber": 206
      },
      "affectedCategories": [
        {
          "categoryName": "Legal Issues (DUIs and Probation)",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Extension of Continuing Appropriations and Other Matters Act, 2024",
        "date": "2024-03-01",
        "summary": "Extension of Continuing Appropriations and Other Matters Act, 2024 This act provides continuing FY2024 appropriations for federal agencies, modifies the requirements for determining eligibility for federal student aid, and provides additional funding for Federal Pell Grants.  DIVISION A--EXTENSION OF CONTINUING APPROPRIATIONS ACT, 2024 Extension of Continuing Appropriations Act, 2024 This division is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.  The CR provides funding through March 8, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:   the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023;  the Energy and Water Development and Related Agencies Appropriations Act, 2023;  the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and  the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.   For most other federal agencies and programs, the CR provides funding through March 22, 2024.  (Under the current CR, the first group of agencies is funded through March 1, 2024, and the remaining agencies are funded through March 8, 2024.) The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. DIVISION B--OTHER MATTERS This division modifies the requirements for determining eligibility for federal student aid and provides additional funding for Federal Pell Grants.  (Sec. 101) This section revises the computation of the student aid index (SAI) for dependent students, which is used to determine eligibility for federal student aid. The SAI for a dependent student is calculated using the Free Application for Federal Student Aid (FAFSA) dat..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 40,
        "billType": "hr",
        "billNumber": 7463
      },
      "affectedCategories": [
        {
          "categoryName": "Occupation (Teacher)",
          "impactLevel": 8
        },
        {
          "categoryName": "Income Level (Low-income)",
          "impactLevel": 7
        },
        {
          "categoryName": "Education Level (Master's degree in Education)",
          "impactLevel": 6
        }
      ]
    },
    {
      "lawData": {
        "title": "Further Continuing Appropriations and Other Extensions Act, 2024",
        "date": "2023-11-17",
        "summary": "Further Continuing Appropriations and Other Extensions Act, 2024 This act provides continuing FY2024 appropriations for federal agencies. The act also extends several expiring programs and authorities, including programs authorized by the 2018 farm bill and several public health programs.  DIVISION A--FURTHER CONTINUING APPROPRIATIONS ACT, 2024 Further Continuing Appropriations Act, 2024 (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies and extends several expiring programs and authorities. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires on November 17, 2023. The CR provides funding through January 19, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:  the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.  For most other federal agencies and programs, the CR provides funding through February 2, 2024. The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for:  the Navy's procurement of one Columbia Class Submarine,  activities of the U.S. Secret Service that are related to National Special Security Events and the 2024 Presidential Campaign, and  activities of the Department of Education that are necessary to ensure the continuation of student loan servicing activities.  This section also extends several expiring programs and authorities, including  t..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 22,
        "billType": "hr",
        "billNumber": 6363
      },
      "affectedCategories": [
        {
          "categoryName": "Employment (Public Education)",
          "impactLevel": 8
        },
        {
          "categoryName": "Education (Master's Degree in Education)",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Making further continuing appropriations for the fiscal year ending September 30, 2024, and for other purposes.",
        "date": "2024-01-19",
        "summary": "Further Additional Continuing Appropriations and Other Extensions Act, 2024 This act provides continuing FY2024 appropriations for federal agencies. The act also extends several expiring programs and authorities, including several public health programs.  DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2024  Further Additional Continuing Appropriations Act, 2024   (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.  The CR provides funding through March 1, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts:    the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023;   the Energy and Water Development and Related Agencies Appropriations Act, 2023;   the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and   the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023.   (Under the current CR, these agencies and programs are funded through January 19, 2024.)  For most other federal agencies and programs, the CR provides funding through March 8, 2024. (Under the current CR, these agencies and programs are funded through February 2, 2024.)  The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for the National Nuclear Security Administration and the Federal Aviation Administration.  In addition, the CR allows the Department of Defense to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.  The CR also extends the aut..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 35,
        "billType": "hr",
        "billNumber": 2872
      },
      "affectedCategories": [
        {
          "categoryName": "Employment in Education",
          "impactLevel": 7
        },
        {
          "categoryName": "Low-Income Status",
          "impactLevel": 6
        },
        {
          "categoryName": "Public Sector Employment",
          "impactLevel": 8
        },
        {
          "categoryName": "Health Programs",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Continuing Appropriations Act, 2024 and Other Extensions Act",
        "date": "2023-09-30",
        "summary": "Continuing Appropriations Act, 2024 and Other Extensions Act This act provides continuing FY2024 appropriations to federal agencies through November 17, 2023, and provides emergency funding for disaster relief. It also extends several expiring programs and authorities, including several Federal Aviation Administration programs, the National Flood Insurance Program, Federal Drug Administration user fees for animal drug applications, and several public health programs. DIVISION A--CONTINUING APPROPRIATIONS ACT, 2024 This division provides continuing FY2024 appropriations to federal agencies through the earlier of November 17, 2023, or the enactment of the applicable appropriations act. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when FY2024 begins on October 1, 2023. The CR funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. This division also provides emergency funding to respond to natural disasters. (Sec. 101) This section provides FY2024 appropriations to federal agencies for continuing projects or activities at the levels and under the conditions included in specified FY2023 appropriations acts. The section also extends several immigration-related programs and specifies several exceptions. (Sec. 102) This section prohibits the Department of Defense (DOD) from funding new or accelerated production of certain projects and other activities and certain multiyear procurements prior to the enactment of the regular annual appropriations act. (Sec. 103) This section specifies that funds provided by Section 101 of this division shall be available to the extent and in the manner that would be provided in the pertinent appropriations act. (Sec. 104) This section generally prohibits appropriations provided by Section 101 of this division from bein..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 15,
        "billType": "hr",
        "billNumber": 5860
      },
      "affectedCategories": [
        {
          "categoryName": "Employment (Education Sector)",
          "impactLevel": 6
        },
        {
          "categoryName": "Resident Status (Washington DC)",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Protecting Hunting Heritage and Education Act",
        "date": "2023-10-06",
        "summary": "Protecting Hunting Heritage and Education Act This act authorizes the use of federal elementary and secondary education funds to purchase or use dangerous weapons for purposes of providing students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts.  Current law prohibits the use of these funds to provide any person with a dangerous weapon or training in the use of a dangerous weapon. The act specifies that this prohibition shall not apply to the use of these funds for permissible program activities that provide students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 17,
        "billType": "hr",
        "billNumber": 5110
      },
      "affectedCategories": [
        {
          "categoryName": "Occupation",
          "impactLevel": 8
        },
        {
          "categoryName": "Education Background",
          "impactLevel": 6
        }
      ]
    },
    {
      "lawData": {
        "title": "Fiscal Responsibility Act of 2023",
        "date": "2023-06-03",
        "summary": "Fiscal Responsibility Act of 2023 This act increases the federal debt limit, establishes new discretionary spending limits, rescinds unobligated funds, expands work requirements for federal programs, and modifies other requirements related to the federal budget process.  DIVISION A--LIMIT FEDERAL SPENDING TITLE I--DISCRETIONARY SPENDING LIMITS FOR DISCRETIONARY CATEGORY  (Sec. 101) This section establishes new discretionary spending limits (also known as spending caps) for FY2024 and FY2025 that are enforced with sequestration (i.e., automatic, across-the-board spending reductions). The Congressional Budget Office (CBO) has estimated that the spending limits will reduce spending below the levels included in its baseline projections.  In addition, this section extends and establishes new limits for several adjustments to discretionary spending limits that are permitted under current law to accommodate additional appropriations for certain activities. These adjustments apply to spending for    continuing disability reviews and redeterminations,   health care fraud and abuse control, and   reemployment services and eligibility assessments.  The section also extends the adjustment to discretionary spending limits for disaster relief funding. The limits for this adjustment are based on a statutory formula, which is modified by this section.  During FY2026-FY2029, if the annual budget resolution has not been adopted by Congress by April 15, this section requires the chairman of the House Budget Committee to submit to the House a spending allocation for the House Appropriations Committee that is consistent with levels specified in this section.  Finally, the section provides funding for (1) the Department of Veterans Affairs Cost of War Toxic Exposures Fund, and (2) the Department of Commerce Nonrecurring Expenses Fund.  (Sec. 102) This section requires the discretionary spending limits to be revised if a continuing resolution (CR) is in effect at the beginning of the cale..."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 5,
        "billType": "hr",
        "billNumber": 3746
      },
      "affectedCategories": [
        {
          "categoryName": "Income Level",
          "impactLevel": 8
        },
        {
          "categoryName": "Employment in Public Sector",
          "impactLevel": 7
        },
        {
          "categoryName": "Age",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Relating to a national emergency declared by the President on March 13, 2020.",
        "date": "2023-04-10",
        "summary": "This joint resolution terminates the national emergency concerning COVID-19 declared by the President on March 13, 2020."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 3,
        "billType": "hjres",
        "billNumber": 7
      },
      "affectedCategories": [
        {
          "categoryName": "Health",
          "impactLevel": 5
        }
      ]
    },
    {
      "lawData": {
        "title": "Disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
        "date": "2023-03-20",
        "summary": "This joint resolution nullifies the Revised Criminal Code Act of 2022, enacted by the council of the District of Columbia (DC). The act makes a variety of changes to DC criminal laws, including by providing statutory definitions for various elements of criminal offenses, modifying sentencing guidelines and penalties, and expanding the right to a jury trial for certain misdemeanor crimes."
      },
      "requestData": {
        "congress": 118,
        "lawType": "pub",
        "lawNumber": 1,
        "billType": "hjres",
        "billNumber": 26
      },
      "affectedCategories": [
        {
          "categoryName": "Legal Status",
          "impactLevel": 9
        }
      ]
    }
  ]
}