{
    "funFacts": [
        "There are roughly 9,000 staffers serving the 435 voting members of the House and the committee's chambers, according to Capitol Canary data.",
        "About 60% of Congressional staffers are under age 35 and 75% are under age 40, according to New America's Congressional Brain Drain Report in 2020. Most staffers are Millennials, with an average age between 26 and 30.",
        "About two thirds of Congressional staff work more than 50 hours a week, according to the New America report. About 20% work more than 60 hours. It is senior staff rather than junior employees who work the most. “More than one-third of senior staff—defined here as those with supervisory authority, such as CoS, committee staff director, legislative director, and the like—work more than 60 hours per week on average,” the report said.",
        "The average staffer stays in their job for about 3 years, according to the New America report, though many stay in Congress longer, changing jobs within an office or joining other lawmakers.",
        "People of color have long been underrepresented among Congressional staff. Among senior House staff, only 14% were people of color in 2019, according to the New America report. Among senior Senate staff, it was only 11% in 2020. “Though these numbers are still low…they both represent significant improvements in recent years,” the report said. Overall, about 74% of Democratic staff and 94% of Republican staff are white. About 62% of the U.S. population is white, according to the 2020 U.S. Census.",
        "About 1 in 8 staffers did not earn a living wage in 2020, defined as $42,610 for an adult with no children residing in Washington DC, according to the Fair Pay report by Issue One, a reform group. The average salary for a legislative assistant in 2019 was $56,700, according to a Congressional Research Service report.",
        "Pay does rise as staffers gain seniority and take on larger roles. The average salary for a chief of staff in 2019 was about $153,000, according to the CRS report. For a district director, it was about $94,800; a legislative director, $89,600; and a communications director, $77,800.",
        "About 43% of staffers say they eventually plan to work in the private sector, according to the New America report, and about 48% of those will target government relations or similar work.",
        "At least 12,421 people have served in the House and Senate since the first Congress convened, according to House records. About 680 people have served in both chambers.",
        "At the start of the 117th Congress, which will close at the end of the year, the average member of the House was 58 and the average Senate member was 64, according to a Congressional Research Service report.",
        "The average length of service in the Senate is 11 years (1.8 terms) and the average in the House is 8.9 years (4.5 terms), according to the CRS report. The longest-serving member of Congress is currently Representative Don Young of Alaska, who has served for 48 years, according to Axios.",
        "Lawmakers spend a lot of time raising money. The average cost of a winning House campaign was $2.4 million in 2020, according to the Center for Responsive Politics. In the Senate, the cost was $27 million. Interesting fact: women who ran for Congress in the 2020 election had to raise an average of 29% more than men in order to win their seats, according to a Capitol Canary analysis.",
        "The base salary for a member of Congress is $174,000, according to a Congressional Research Service report. However, some in leadership make more. The Speaker of the House makes $223,500, while the Senate president and the majority and minority leaders in the House and Senate make $193,400. The average U.S. salary is about $53,490 a year, according to the Bureau of Labor Statistics.",
        "A majority of the 117th Congress—about 75%—is white while, as stated earlier, only about 62% of the U.S. population is white. In terms of gender, 149 members of Congress are women, or about 28%, while women make up about half the U.S. population. There are 11 LBGTQ+ people serving in Congress, or about 2%, while the latest estimates show the percentage of the population who is LGBTQ+ is 7% to 8%.",
        "About 80% of Congress members are married and a similar percentage have children, according to Capitol Canary data. Yet single parents may be under-represented. Almost a quarter of American children under 18 live with one parent, according to the Pew Research Center. That's not true in Congress.",
        "About 80% of Congress members are married and a similar percentage have children, according to Capitol Canary data. Yet single parents may be under-represented. Almost a quarter of American children under 18 live with one parent, according to the Pew Research Center. That's not true in Congress.",
        "About 96% of Congress is college educated, with about 23% attending Ivy League schools, according to Capitol Canary data. While more than one in three (36%) have a law degree, only about 17% have military experience."
    ]
}