{
    "funFacts": [
        "There are roughly 9,000 staffers serving the 435 voting members of the House and the committee's chambers, according to Capitol Canary data.",
        "About 60% of Congressional staffers are under age 35 and 75% are under age 40, according to New America's Congressional Brain Drain Report in 2020. Most staffers are Millennials, with an average age between 26 and 30.",
        "Standing Committees are permanent committees established under the standing rules of the Senate and specialize in the consideration of particular subject areas. The Senate currently has 16 standing committees.",
        "The average staffer stays in their job for about 3 years, according to the New America report, though many stay in Congress longer, changing jobs within an office or joining other lawmakers.",
        "Joint Committees include membership from both houses of Congress. They are usually established with narrow jurisdictions and normally lack authority to report legislation. There are currently 4 joint committees.",
        "About 1 in 8 staffers did not earn a living wage in 2020, according to the Fair Pay report by Issue One, a reform group. The average salary for a legislative assistant in 2019 was $56,700, according to a Congressional Research Service report.",
        "The position of chair of a joint committee usually alternates each Congress between members from the House and Senate.",
        "About 43% of staffers say they eventually plan to work in the private sector, according to the New America report, and about 48% of those will target government relations or similar work.",
        "At least 12,421 people have served in the House and Senate since the first Congress convened, according to House records. About 680 people have served in both chambers.",
        "At the start of the 117th Congress, which will close at the end of the year, the average member of the House was 58 and the average Senate member was 64, according to a Congressional Research Service report.",
        "The average length of service in the Senate is 11 years (1.8 terms) and the average in the House is 8.9 years (4.5 terms), according to the CRS report. The longest-serving member of Congress is currently Representative Don Young of Alaska, who has served for 48 years, according to Axios.",
        "The average cost of a winning House campaign was $2.4 million in 2020, according to the Center for Responsive Politics. In the Senate, the cost was $27 million.",
        "Women who ran for Congress in the 2020 election had to raise an average of 29% more than men in order to win their seats, according to a Capitol Canary analysis.",
        "The base salary for a member of Congress is $174,000, according to a Congressional Research Service report. However, some in leadership make more. The Speaker of the House makes $223,500, while the Senate president and the majority and minority leaders in the House and Senate make $193,400. The average U.S. salary is about $53,490 a year, according to the Bureau of Labor Statistics.",
        "Special or Select Committees are established by the Senate for a limited period of time to perform a particular study or investigation. They may or may not be given authority to report legislation to the Senate. There are currently 4 special or select committees.",
        "Currently, several hundred congressional caucuses, also known as Congressional Member Organizations (CMOs), exist. A caucus is a group of members of congress that meets to pursue a common legislative goal.",
        "About 96% of Congress is college educated, with about 23% attending Ivy League schools, according to Capitol Canary data. While more than one in three (36%) have a law degree, only about 17% have military experience.",
        "One example of a Congressional Caucus is the Congressional Freethought Caucus which is co-chaired by Representatives Jamie Raskin and Jared Huffman. The caucus focuses on promoting policy solutions based on reason and science and defending the secular character of government.",
        "There are currently 212 Democrats and 220 Republicans serving as members of the House of Representatives.",
        "In the history of the United States Congress, 21 members have been expelled, the most recent being George Santos, a representative from New York’s 3rd Congressional District, in 2023.",
        "Members of the House of Representatives serve 2 year terms and are up for reelection every even year.",
        "Senators serve 6 year terms and are staggered over even years so that only about ⅓ of the Senate is up for reelection during any election year.",
        "A term of Congress is divided into 2 sessions which begin each year on January 3rd, unless Congress selects another date.",
        "Joint sessions of Congress are a gathering of both chambers of Congress which occur on special occasions when a concurrent resolution from both the House and the Senate is required. Examples of joint sessions include the counting of electoral votes, and the President’s state of the union address.",
        "Bills can be introduced by a member of either chamber of congress. However, bills for raising revenue must originate in the House of Representatives. This prevents the Senate from initiating bills imposing taxes.",
        "In order for either chamber of Congress to do business, a quorum (a majority of members) must be present. However, the rules of each chamber state that a quorum is assumed to be present, meaning that congress can continue doing business as long as a quorum call is not held to show that a quorum is not present.",
        "Over 30,000 statutes have been enacted by Congress since 1789.",
        "Congress can override a Presidential veto by a two-thirds vote in both the House and the Senate",
        "In order to be elected Speaker of the House, a representative must receive a majority of the votes of the representatives present. If no candidate receives a majority, the vote is repeated until a speaker is elected. The longest speaker election ever held was in 1856 and took 133 votes."
    ]
}