{
  "bills": [
    {
      "billData": {
        "title": "Native American Language Resource Center Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Native American Language Resource Center Act of 2022 This act authorizes the Department of Education to make a grant to or enter into a contract with an eligible entity (e.g., an institution of higher education) to establish, operate, and staff a Native American language resource center. The center must serve as a resource to improve the capacity to teach and learn Native American languages, further Native American language use and acquisition, and support the revitalization and reclamation of Native American languages.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "989"
      }
    },
    {
      "billData": {
        "title": "Agua Caliente Land Exchange Fee to Trust Confirmation Act",
        "date": "2023-01-05"
      },
      "billSummary": "Agua Caliente Land Exchange Fee to Trust Confirmation Act This act takes approximately 2,560 acres of specified lands in California into trust for the benefit of the Agua Caliente Band of Cahuilla Indians. Lands taken into trust shall be part of the tribe's reservation. Further, the act prohibits gaming on the land taken into trust.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "897"
      }
    },
    {
      "billData": {
        "title": "Veterans Auto and Education Improvement Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Veterans Auto and Education Improvement Act of 2022 This act modifies provisions related to programs and benefits for veterans, including by providing permanent authority for the application of certain flexibilities to assist veterans with their educational assistance benefits during emergency situations. An emergency situation is defined as a situation that the President declares as an emergency and the Department of Veterans Affairs (VA) determines is an emergency for purposes of the laws it administers.  Specifically, the act extends certain program adjustments that were implemented during the COVID-19 emergency (including adjustments made in the Student Veteran Coronavirus Response Act of 2020) to other emergency situations that may arise and have an effect on veterans and their educational assistance benefits. Among other flexibilities, the act (1) authorizes the VA to continue to provide educational assistance, including monthly housing stipends or subsistence allowances, for programs of education that have been converted to distance learning due to an emergency or health-related situation; and (2) extends the time limitation for using educational assistance under the Montgomery GI Bill, Post-9/11 GI Bill, or vocational rehabilitation program when institutions are closed due to an emergency situation or executive order. Due to an emergency situation, the VA is authorized to   extend by two months the payment of vocational rehabilitation subsistence allowances, continue paying work-study allowances and extend work-study agreements, and  continue paying educational assistance and subsistence allowances for a specified amount of time for programs of education that are suspended or closed.  This act also adjusts the administration of certain benefits for veterans participating in an apprenticeship or other on-job training during an emergency situation, including by proportionately reducing the 120-hour monthly training requirement to reflect an individual's period of unemployment without a reduction in training assistance. An educational assistance payment shall not be charged against an individual's entitlement to educational assistance if an individual was unable to complete a course or program due to the temporary closure of an educational institution or the temporary termination of a program by reason of an emergency situation.  The act provides the requirements that must be met for a study-abroad course to be approved for purposes of VA educational assistance. The act provides eligibility for Post-9/11 GI Bill educational assistance for individuals, including officers, who are discharged or released from active duty with a sole survivorship discharge following at least 30 continuous days on qualifying active duty after September 10, 2001. The VA must partner with state approving agencies, educational institutions, and training establishments to require the use of a uniform application for the VA's course approval process. The uniform application must be developed by October 1, 2023, and be required for the approval of any new course of education proposed on or after that day. The act provides notice requirements for VA education surveys. Specifically, the VA or a state approving agency must provide not more than one business day of notice to an educational institution before conducting a targeted risk-based survey. The VA or state approving agency must provide not more than 10 business days of notice to an educational institution or training establishment before conducting a compliance survey. Under the act, educational institutions are excepted from the requirement to verify the enrollment of certain individuals who are receiving VA educational assistance (e.g., individuals who are enrolled in a program on at least a full-time basis before they are able to withdraw from the course without penalty). The act expands eligibility for self-employment assistance under the Veteran Readiness and Employment Program to include certain veterans who have a service-connected disability or employment handicap in addition to those with the most severe service-connected disabilities. The VA must report on possible definitions for student services, marketing, and classroom instruction for purposes of VA educational assistance. The act extends through November 30, 2031, certain limitations on pension payments to veterans who have no dependents and are being furnished domiciliary care by the VA. The act authorizes a servicemember to terminate specified contracts (e.g., contracts for commercial mobile service or internet service) that are entered into in relation to military orders for a permanent change of station if the member then receives a stop movement order in response to a local, national, or global emergency which prevents the member from using the services provided under the contract. The act provides that a spouse of a servicemember may retain their personal residence or domicile for purposes of taxation. Under the act, a servicemember and the spouse of the member are authorized to elect to use the following locations for purposes of taxation:  the residence or domicile of the member, the residence or domicile of the spouse, or the permanent duty station of the member.  The act provides for the portability of professional licenses of servicemembers and their spouses who are relocated, because of military orders, outside of the jurisdiction that issued the license. The act authorizes the VA to provide non-articulating trailers (adaptive equipment) to veterans with specified disabilities or diseases incurred or aggravated due to their military service. The act authorizes the VA to provide (or assist in providing) an eligible veteran or servicemember with an additional automobile or other conveyance under the VA automobile allowance and adaptive equipment program if (1) more than 30 years have elapsed since the person last received such benefit; or (2) beginning 10 years after the date of this act, if more than 10 years have elapsed since the person last received such benefit. Finally, the act includes certain vehicle modifications (e.g., van lifts) under the definition of medical services for VA health care purposes.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7939"
      }
    },
    {
      "billData": {
        "title": "For the relief of Arpita Kurdekar, Girish Kurdekar, and Vandana Kurdekar.",
        "date": "2023-01-05"
      },
      "billSummary": "This bill provides for the relief of Arpita Kurdekar, Girish Kurdekar, and Vandana Kurdekar. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "680"
      }
    },
    {
      "billData": {
        "title": "A bill to amend the Bill Emerson Good Samaritan Food Donation Act to improve the program, and for other purposes.",
        "date": "2023-01-05"
      },
      "billSummary": "This act expands liability protections for the donation of food and grocery products. Specifically, the act expands the liability protections to include donations of an apparently fit grocery product or apparently wholesome food  for which the recipient is charged a good Samaritan reduced price that is no greater than the cost of handling, administering, harvesting, processing, packaging, transporting, and distributing the food or product; or that is donated directly to a needy individual at zero cost by a retail grocer, wholesaler, agricultural producer, agricultural processor, agricultural distributor, restaurant, caterer, school food authority, or institution of higher education. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5329"
      }
    },
    {
      "billData": {
        "title": "A bill to amend the Farm Security and Rural Investment Act of 2002 to extend terminal lakes assistance.",
        "date": "2023-01-05"
      },
      "billSummary": "This act extends through October 1, 2025, authority to provide terminal lakes assistance.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5328"
      }
    },
    {
      "billData": {
        "title": "Energy Security and Lightering Independence Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Energy Security and Lightering Independence Act of 2022 This bill authorizes an alien crewman to obtain a permit to land in the United States for up to 180 days if, during this period, the crewman will perform ship-to-ship liquid cargo transfer operations involving a vessel engaged in foreign trade. Currently, an alien crewman may obtain a permit to land for up to 29 days.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5168"
      }
    },
    {
      "billData": {
        "title": "A bill to amend the Not Invisible Act of 2019 to extend, and provide additional support for, the activities of the Department of the Interior and the Department of Justice Joint Commission on Reducing Violent Crime Against Indians, and for other purposes.",
        "date": "2023-01-05"
      },
      "billSummary": "This act makes changes to the Joint Commission on Reducing Violent Crime Against Indians, which was established to increase intergovernmental coordination to identify and combat violent crime within Indian lands and against Indians. Specifically, the act extends the joint commission for an additional 18 months. It also extends the deadline, from 18 months to 36 months, for the joint commission to make publicly available and submit recommendations to the Department of the Interior, the Department of Justice, and specified congressional committees. Additionally, the act allows the joint commission to accept and use gifts or donations of services or property from Indian tribes or tribal entities, academic institutions, or other not-for-profit organizations.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5087"
      }
    },
    {
      "billData": {
        "title": "Don Young Recognition Act",
        "date": "2023-01-05"
      },
      "billSummary": "Don Young Recognition Act This act designates (1) the volcanic peak known as Mount Cerberus as Mount Young; (2) the Jobs Corps center located at 800 East Lynn Martin Drive in Palmer, Alaska, as the Don Young Alaska Job Corps Center; and (3) the federal office building located at 101 12th Avenue in Fairbanks, Alaska, as the Don Young Federal Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5066"
      }
    },
    {
      "billData": {
        "title": "Colonel Mary Louise Rasmuson Campus of the Alaska VA Healthcare System Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Colonel Mary Louise Rasmuson Campus of the Alaska VA Healthcare System Act of 2022 This act designates the medical center of the Department of Veterans Affairs in Anchorage, Alaska, as the Colonel Mary Louise Rasmuson Campus of the Alaska VA Healthcare System.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5016"
      }
    },
    {
      "billData": {
        "title": "State Offices of Rural Health Program Reauthorization Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "State Offices of Rural Health Program Reauthorization Act of 2022 This act reauthorizes through FY2027 grants awarded to state offices of rural health for improving health care in rural areas.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4978"
      }
    },
    {
      "billData": {
        "title": "National Cemeteries Preservation and Protection Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "National Cemeteries Preservation and Protection Act of 2022 This act addresses the administration and jurisdiction of national cemeteries.  Specifically, the act requires the Department of Veterans Affairs (VA) to pay a plot or interment allowance for a veteran if the veteran was buried before March 15, 2022, in a cemetery on trust land owned by, or held in trust for, a tribal organization, and the organization that maintains or operates the cemetery applies for such allowance. Such allowance is only authorized if a plot or interment allowance was not already paid for the burial of such veteran. The act also authorizes the VA to designate green burial sections in national cemeteries (i.e., sections of cemeteries in which the remains of individuals have been prepared for interment in a manner not involving chemicals or embalming fluids and have been interred in a natural manner or completely biodegradable burial receptacle). The act authorizes the Department of the Army to transfer certain lands to the VA to expand the Fort Bliss National Cemetery.  In addition, the act authorizes the Department of the Interior to transfer certain land to the VA for the land to be used as a national cemetery.  Finally, the act prohibits persons who have committed certain crimes from being interred or memorialized in a cemetery in the National Cemetery Administration or in Arlington National Cemetery.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4949"
      }
    },
    {
      "billData": {
        "title": "Respect for Child Survivors Act",
        "date": "2023-01-05"
      },
      "billSummary": "Respect for Child Survivors Act This act requires the Federal Bureau of Investigation (FBI) to use a multidisciplinary team with investigations of child abuse and related crimes. The act also reauthorizes grants for children's advocacy centers (CACs). CACs use a multidisciplinary response to coordinate the investigation, treatment, and prosecution of child abuse cases. (Sec. 2) This section requires the FBI to use a multidisciplinary team with any investigation of child sexual exploitation or abuse, the production of child sexual abuse material, or child trafficking. The FBI must also use a trained child adolescent forensic interviewer in these investigations. These requirements do not apply if a multidisciplinary team or an interviewer is unavailable or is otherwise inconsistent with applicable federal law.  In implementing these requirements, the FBI must use and coordinate with multidisciplinary teams based at CACs. (Sec. 3) This section modifies and reauthorizes through FY2028 grants for regional and local CACs, as well as for technical assistance and training. Grants for CACs are administered by the Office of Juvenile Justice and Delinquency Prevention (OJJDP) within the Department of Justice.  It adds a finding stating that a key to a child victim healing from abuse is access to supportive and healthy families and communities. The section modifies grant provisions for regional CACs, including by  directing the OJJDP to maintain (in addition to establish) regional CACs; adding, as a new program objective, the provision of technical assistance, training, coordination, and organizational capacity support for state chapters; and requiring the OJJDP to consider, as an additional selection criteria, proposals for regional CACs that best result in supporting state chapters.  The section also modifies grant provisions for local CACs, including by adding as new grant purposes (1) the establishment and maintenance of a network of care for child abuse victims, and (2) the development and dissemination of practice standards for care and best practices in program evaluation.  Finally, the section modifies the criteria that the OJJDP may use to evaluate local CAC programs.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4926"
      }
    },
    {
      "billData": {
        "title": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
        "date": "2023-01-05"
      },
      "billSummary": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021 This act provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley. After it is awarded, the medal shall be given to the National Museum of African American History and Culture.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "450"
      }
    },
    {
      "billData": {
        "title": "Katimiîn and Ameekyáaraam Sacred Lands Act",
        "date": "2023-01-05"
      },
      "billSummary": "Katimi&icirc;n and Ameeky&aacute;araam Sacred Lands Act This act takes approximately 1,031 acres of specified lands in Siskiyou and Humboldt Counties, California, into trust for the benefit of the Karuk Tribe. Land taken into trust may be used for traditional and customary uses for the benefit of the tribe. Additionally, the land taken into trust must allow for continued access by the Forest Service for managing the component of the National Wild and Scenic Rivers System that flows through the land. The Department of Agriculture must enter into a memorandum of understanding with the tribe to establish mutual goals for the protection and enhancement of the river values of such component.  Further, the act prohibits gaming on the land taken into trust.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4439"
      }
    },
    {
      "billData": {
        "title": "A bill to designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the \"Vanessa Guillen Post Office Building\".",
        "date": "2023-01-05"
      },
      "billSummary": "Designates the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the \"Vanessa Guillen Post Office Building.\"",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4411"
      }
    },
    {
      "billData": {
        "title": "Justice for Victims of War Crimes Act",
        "date": "2023-01-05"
      },
      "billSummary": "Justice for Victims of War Crimes Act This act broadens the scope of individuals who are subject to federal prosecution for war crime offenses.  Currently, the federal war crimes statute provides federal jurisdiction over war crime offenses committed anywhere (i.e., inside or outside the United States) if the victim or offender is a member of the Armed Forces or a U.S. national.  First, this act extends federal jurisdiction over war crime offenses committed anywhere to offenses where (1) the victim or offender is an alien lawfully admitted for permanent residence; or (2) the offender is present in the United States, regardless of the nationality of the victim or the offender.  Second, the act expands federal jurisdiction over war crime offenses to include offenses that occur in whole or in part within the United States, regardless of whether the victim or offender is a member of the Armed Forces, a U.S. national, or an alien lawfully admitted for permanent residence.  The act allows an indictment for certain war crime offenses to be instituted any time, making the statute of limitations inapplicable. To undertake a prosecution for war crime offenses, the act requires written certification that prosecution is in the public interest and is necessary to secure substantial justice. The certification is not subject to judicial review. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4240"
      }
    },
    {
      "billData": {
        "title": "Childhood Cancer STAR Reauthorization Act",
        "date": "2023-01-05"
      },
      "billSummary": "Childhood Cancer Survivorship, Treatment, Access, and Research Reauthorization Act of 2022 or the Childhood Cancer STAR Reauthorization Act This act reauthorizes through FY2028 and modifies pediatric cancer research and related programs, including to expand collection of and access to relevant biospecimens and to support the transition of pediatric cancer survivors to primary care.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4120"
      }
    },
    {
      "billData": {
        "title": "Hualapai Tribe Water Rights Settlement Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Hualapai Tribe Water Rights Settlement Act of 2022 This act authorizes, ratifies, and confirms the Hualapai Tribe water rights settlement agreement negotiated between the tribe, the United States, Arizona, and others, thus satisfying the tribe's claims for groundwater and surface water rights to water in Arizona, including the Verde River, the Bill Williams River, and the Colorado River.  The act outlines the tribe's water rights, including the right to divert, use, and store 4,000 acre-feet of agricultural priority water of the Central Arizona Project that was previously allocated to nontribal agricultural entities, but retained by the Department of the Interior for reallocation to tribes in Arizona pursuant to the Central Arizona Project Settlement Act of 2004. Interior must reallocate this priority water to the tribe, firm through 2107 a specified amount of the water, and enter into a water delivery contract with the tribe. The act directs Interior to establish the Hualapai Water Trust Fund Account. Amounts deposited in the trust fund account shall be made available to the tribe for specified purposes, including to construct the Hualapai Water Project. The project must be designed to divert, treat, and convey up to 3,414 acre-feet of water per year from the Colorado River for municipal, commercial, and industrial uses on the Hualapai Reservation. Additionally, the act establishes in the Treasury the Hualapai Water Settlement Implementation Fund Account. Amounts in this account must be used to carry out groundwater monitoring and an estimate for groundwater withdrawals in the Truxton Basin outside the boundaries of the tribe's reservation. The act adds certain land in Arizona to the tribe's reservation and also authorizes Interior to take specified land into trust for the benefit of the tribe. In the future, land located outside the reservation may only be taken into trust through an act of Congress. The act outlines (1) waivers, releases, and retentions of claims by the tribe and the United States under the settlement agreement; and (2) a limited waiver of sovereign immunity by the United States and the tribe with respect to certain claims. The act repeals the settlement agreement (except for provisions related to land added to the reservation and land taken into trust) if Interior does not publish by April 15, 2029, a statement of findings that specified conditions have been fulfilled (including that Interior has executed the required water delivery contract).",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4104"
      }
    },
    {
      "billData": {
        "title": "Trafficking Victims Prevention and Protection Reauthorization Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Trafficking Victims Prevention and Protection Reauthorization Act of 2022 This act reauthorizes, updates, and expands federal efforts to address domestic trafficking, including to make permanent the U.S. Advisory Council on Human Trafficking; reauthorize various grants, activities, and programs that support victims of domestic trafficking; and expand research and reporting related to trafficking. TITLE I--COMBATING TRAFFICKING IN PERSONS IN THE UNITED STATES Subtitle A--Programs To Support Young Victims Who Are Vulnerable To Human Trafficking (Sec. 101) This section authorizes the Department of Health and Human Services (HHS), in collaboration with the Department of Justice (DOJ), to award competitive grants to support collaboration between state&nbsp;child-welfare&nbsp;and&nbsp;juvenile-justice agencies to address the needs of dual-status youth and their families. The term dual-status youth means children who come into contact with both the child welfare and juvenile justice systems. (Sec. 102) This section makes permanent the U.S. Advisory Council on Human Trafficking.  (Sec. 103) This section establishes a pilot program to provide funding for community-based organizations in underserved communities to support youth at risk of being trafficked. Subtitle B--Governmental Efforts To Prevent Human Trafficking (Sec. 121) This section requires the Government Accountability Office (GAO) to report to Congress on federal contract supply chain oversight related to the prevention of trafficking in persons. (Sec. 122) This section expresses the sense of Congress that    federal agencies should incorporate a module on human trafficking into staff training requirements;  the training should teach employees how to prevent, identify, and report trafficking in persons; and agencies should inform all candidates for employment about the anti-trafficking provisions in the code of conduct of the agency.   Additionally, this section requires officers and employees of executive branch agencies to be subject to minimum standards with respect to human trafficking, including a prohibition on engaging in human trafficking while employed by the federal government.  (Sec. 123) This section requires the GAO to (1) study the accessibility of mental health services and substance use disorder treatment and recovery for survivors of human trafficking in the United States of various ages, and (2) report to Congress on the findings of the study and recommendations for increased accessibility and affordability for survivors of trafficking. (Sec. 124) This section directs the National Science Foundation to support merit-reviewed and competitively awarded research on the impact of online social media platforms on the maintenance or expansion of human trafficking. Subtitle C--Monitoring Child, Forced, and Slave Labor (Sec. 131) This section requires federal agencies and departments that receive appropriations to award anti-trafficking grants to report on obligations and expenditures of federal funds for the purpose of combating human trafficking and forced labor. (Sec. 132) This section expresses the sense of Congress that companies headquartered or doing business in the United States that are not small business concerns (e.g., companies with 500 or more employees) should adopt a written policy that prohibits trafficking in persons.   (Sec. 133) This section revises criteria for considering a child to be a victim of child abuse and neglect and of sexual abuse. Specifically, it provides that a child shall be considered a victim of child abuse and neglect and of sexual abuse if the child is identified as being a victim of human trafficking. Currently, a child is considered a victim of child abuse and neglect and of sexual abuse if the child is identified as being a victim of sex trafficking or a victim of severe forms of trafficking in persons. (Sec. 134) This section establishes the sense of Congress that (1) DOJ has failed to meet its reporting requirements under Title IV of the Trafficking Victims Protection Act of 2017, and (2) progress on critical data collection about human trafficking and crime reporting is in jeopardy as a result of the failure and must be addressed immediately.  (Sec. 135) This section expresses the sense of Congress that (1) a person is qualified as a victim of child sex trafficking if the person is a victim, as a child, of human trafficking; and (2) all states and territories should evaluate whether to eliminate the requirement for third-party control to properly qualify a child as a victim of sex trafficking. (Sec. 136) This section expresses the sense of Congress that each state child welfare agency should report information on missing or abducted foster children and youth to the National Center on Missing and Exploited Children (NCMEC) and to law enforcement for inclusion in the National Crime Information Center database.  (Sec. 137) This section modifies the requirements for state plans for foster care and adoption assistance. The section specifies that the plans must require state child welfare agencies that report information on missing or abducted foster children and youth to the NCMEC and to law enforcement authorities to maintain regular communication and share information with the NCMEC and law enforcement agencies to provide a safe recovery of a missing or abducted child or youth. This includes sharing, where reasonably possible, a photo of the missing or abducted child or youth, a description of the child's physical features, and other health or risk factors (e.g., pregnancy status or vulnerability to being sex trafficked).  TITLE II--AUTHORIZATION OF APPROPRIATIONS This title reauthorizes activities and programs at various federal departments and agencies that support victims of trafficking in the United States. (Sec. 201) This section reauthorizes through FY2028  HHS and DOJ grants and programs to expand benefits and services to citizens and lawful permanent residents who are victims of severe forms of trafficking; Department of Labor activities to expand benefits and programs for victims of severe forms of trafficking; and  Department of Homeland Security (DHS) authority to investigate severe forms of trafficking in persons, including to establish a labor trafficking investigations team within DHS.   (Sec. 202) This section authorizes amounts through FY2028 for U.S. Customs and Border Protection to strengthen enforcement of the prohibition on importing any product that was mined, produced, or manufactured by forced labor. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3949"
      }
    },
    {
      "billData": {
        "title": "Abolish Trafficking Reauthorization Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Abolish Trafficking Reauthorization Act of 2022 This act reauthorizes various antitrafficking programs, establishes a national strategy on cybercrime against individuals, and expands information sharing and data collection requirements regarding human trafficking. TITLE I--GRANTS RELATING TO HUMAN TRAFFICKING PREVENTION AND ASSISTANCE FOR VICTIMS OF HUMAN TRAFFICKING (Sec. 101) This section allows funds provided by the Department of Justice (DOJ) for human trafficking training and technical assistance programs to be used for programs funded through the Office of Community Oriented Policing Services that build law enforcement capacity to identify and respond to human trafficking, such as the Interdiction for the Protection of Children Program. (Sec. 102) This section allows a victim of human trafficking (e.g., sex trafficking) to pursue a civil claim against persons who attempt or conspire to benefit from the human trafficking in addition to persons who benefit from the human trafficking. (Sec. 103) This section generally requires grantees and subgrantees that receive funding from DOJ or the Department of Health and Human Services (HHS) to assist victims of trafficking in the United States to protect the confidentiality and privacy of the individuals they serve and their families. (Sec. 104) This section authorizes HHS to make grants to states to develop, improve, or expand programs that help child welfare agencies identify and respond to (1) children who are victims of child abuse and neglect and of sexual abuse because they are identified as victims of sex trafficking or severe forms of trafficking in persons; and (2) child-welfare-involved children who are (or are at risk of being) victims of one or more forms of trafficking in persons.  This section also expresses the sense of Congress that health care and social service licensing boards and professional membership associations should facilitate access to trafficking-specific training.  (Sec. 105) This section reauthorizes the Domestic Trafficking Victims' Fund through FY2027. It also makes permanent the requirement for courts to impose a special assessment on nonindigent persons or entities convicted of certain federal trafficking-related offenses including peonage, slavery, or trafficking in persons; sexual abuse; sexual exploitation and other child abuse; transportation for illegal sexual activity; and certain human smuggling offenses. The special assessments are deposited into the Domestic Trafficking Victims' Fund and support programs for victims of human trafficking. Additionally, this section reauthorizes through FY2027 various grants, programs, and activities that combat human trafficking and assist victims, including  training for airport and airline personnel to identify and report human trafficking;  the Human Exploitation Rescue Operation (HERO) Child-Rescue Corps Program;  grants for the Rape, Abuse &amp; Incest National Network;  the Human Smuggling and Trafficking Center;  the Presidential Award for Extraordinary Efforts To Combat Trafficking in Persons;  additional benefits through HHS and DOJ for domestic victims of severe forms of trafficking; and  research on domestic and international trafficking in persons.   TITLE II--COMPENSATION OF VICTIMS OF HUMAN TRAFFICKING (Sec. 201) This section modifies federal bankruptcy laws to specify that a debtor may not discharge in bankruptcy debts for an injury to an individual related to a trafficking offense under federal criminal law. This includes an injury caused by an instance in which the debtor knowingly benefitted financially, or by receiving anything of value, from participation in a venture that the debtor knew or should have known engaged in an trafficking offense under federal criminal law.  TITLE III--CYBER HARASSMENT PREVENTION Subtitle A--Cybercrime Statistics (Sec. 311) This section requires DOJ to develop a national strategy to reduce, investigate, and prosecute cybercrimes against individuals. The strategy supplements the National Strategy to Combat Human Trafficking and the National Strategy for Child Exploitation Prevention and Interdiction. Additionally, this section specifies that the House and Senate Judiciary Committees are appropriate committees to which the National Academy of Sciences must submit its report on cybercrime taxonomy. Subtitle B--Prioritizing Online Threat Enforcement (Sec. 321) This section requires DOJ to ensure that there are at least 10 additional agents at the Federal Bureau of Investigation (FBI) to investigate cybercrimes against individuals. DOJ must also ensure that there is at least one attorney in each U.S. Attorney office who is responsible for investigating and prosecuting cybercrimes against individuals. Finally, this section requires DOJ to implement a training program for FBI agents related to investigating and prosecuting cybercrimes against individuals, including relevant forensic training.  (Sec. 322) This section requires the Office for Victims of Crime within DOJ to report on the nature, extent, and amount of funding under the Victims of Crime Act of 1984 for victims of cybercrimes against individuals. The Victims of Crime Act of 1984 established the Crime Victims Fund, which provides funding to support victims of crime through various federal programs and state and local victim assistance and compensation initiatives. (Sec. 323) This section allows the Department of State to exchange information with foreign governments pursuant to a bilateral or multilateral agreement that provides for the sharing of information related to individuals who are convicted of sex offenses against minors. Further, it specifies that an individual may not be issued or reissued a passport without a unique identifier solely because the individual has moved or otherwise resides outside the United States. (Sec. 324) This section requires DOJ to disseminate information and provide training and technical assistance to help states and local governments (1) investigate, prosecute, pursue, prevent, understand, and mitigate the impact of physical, sexual, and psychological abuse of cybercrime victims; the exploitation of cybercrime victims; and the deprioritization of cybercrime; and (2)&nbsp;assess, address, and mitigate the physical and psychological trauma to victims of cybercrime. TITLE IV--OTHER FEDERAL IMPROVEMENTS RELATING TO HUMAN TRAFFICKING (Sec. 401) This section requires DOJ and the Department of Homeland Security (DHS) to provide incentive pay to individuals who are appointed to positions requiring significant cyber skills, including to protect victims of trafficking, prevent trafficking in persons, or prosecute technology-facilitated crimes against children.  (Sec. 402) This section prohibits federal agencies from requiring a survivor of human trafficking who is less than 18 years of age or a homeless youth to obtain the consent or signature of a parent or guardian to receive a government-issued identification card. Additionally, it prohibits federal agencies from charging a fee for the identification card.  (Sec. 403) This section allows DOJ to use amounts in its Assets Forfeiture Fund to reimburse operating expenses and program costs incurred by crime-tip organizations that meet certain criteria (e.g., annually waive their qualification for awards for information leading to forfeiture and payments from equitably shared forfeiture funds) and offer rewards for information about violations of federal criminal laws prohibiting human trafficking. (Sec. 404) This section requires DOJ to include additional information in its annual report on U.S. government efforts to combat human trafficking. First, with respect to noncitizen victims of human trafficking whose application for continued presence, T nonimmigrant status (a T-visa), or U nonimmigrant status (a U-visa) are denied, DOJ must include the reason for the denial and the length of time for the denial to be issued. Second, DOJ must include disaggregated data regarding the number of victims trafficked by third parties and by family members, victims trafficked by victim age, and victims trafficked by the type of trafficking.  (Sec. 405) This section requires DOJ and HHS to report biennially on the status of various data collection and reporting requirements related to trafficking.  (Sec. 406) This section requires DOJ and DHS to each establish a team of at least 10 agents to exclusively investigate labor trafficking. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3946"
      }
    },
    {
      "billData": {
        "title": "A bill to authorize leases of up to 99 years for land held in trust for the Confederated Tribes of the Chehalis Reservation.",
        "date": "2023-01-05"
      },
      "billSummary": "This act authorizes the Confederated Tribes of the Chehalis Reservation to lease their land held in trust for a term of up to 99 years. The tribe is located in western Washington State.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3773"
      }
    },
    {
      "billData": {
        "title": "Butterfield Overland National Historic Trail Designation Act",
        "date": "2023-01-05"
      },
      "billSummary": "Butterfield Overland National Historic Trail Designation Act This act designates the trail extending approximately 3,292 miles and following the route operated by the Butterfield Overland Mail Company, known as the Ox-Bow Route, to transport mail and passengers between the eastern end points of St. Louis, Missouri, and Memphis, Tennessee, and extending westward through the states of Arkansas, Oklahoma, Texas, New Mexico, and Arizona, to the western end point of San Francisco, California, as the Butterfield Overland National Historic Trail.  The United States shall not acquire for the trail any land or interest in land outside of the exterior boundary of any federally administered area without the consent of the owner of such land or interest in land.  The Department of the Interior may not use eminent domain or condemnation in carrying out this act.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3519"
      }
    },
    {
      "billData": {
        "title": "Low Power Protection Act",
        "date": "2023-01-05"
      },
      "billSummary": "Low Power Protection Act This act provides for a one-year period during which eligible low-power television stations may apply to the Federal Communications Commission (FCC) for Class A licenses. To be eligible, a station must serve a media market with a limited number of television households, broadcast a minimum number of hours, and meet other requirements. A low-power station with a Class A license obtains certain broadcast rights, including primary status with respect to its allocation of the electromagnetic spectrum. (Typically, low-power stations have secondary status and may be displaced from their spectrum in the event the FCC reallocates it to a primary user.)",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3405"
      }
    },
    {
      "billData": {
        "title": "Colorado River Indian Tribes Water Resiliency Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Colorado River Indian Tribes Water Resiliency Act of 2022 This act authorizes the Colorado River Indian tribes (CRIT) to enter into agreements for the transfer or storage of a portion of its water allocation to be used in other locations in Arizona. The CRIT include four Indian tribes&#8212;the Mohave, Chemehuevi, Hopi, and Navajo. The reservation is located along the Colorado River in both Arizona and California.  (Sec. 4) The CRIT is authorized to enter into an agreement to lease or exchange a portion of the CRIT's consumptive use of water for use off the reservation if the receiving facility is located in the Lower Basin of the Colorado River in Arizona and is not located in Navajo, Apache, or Cochise counties in Arizona. The term of a lease under this section must not exceed 100 years.  (Sec. 5) The CRIT is authorized to enter into a storage agreement, including with the Arizona Water Banking Authority, for the storage of a portion of the consumptive use, or the water received under an exchange pursuant to an exchange agreement under this act, at one or more underground storage facilities or groundwater savings facilities off the reservation if the facility is located in the Lower Basin of the Colorado River in Arizona and is not located in Navajo, Apache, or Cochise counties in Arizona.  (Sec. 6) The CRIT is authorized to enter into an agreement for water conservation or other methods for voluntarily leaving a portion of the CRIT reduced consumptive use in Lake Mead, which is located in Arizona and Nevada. If the conserved water is delivered, the delivery must be located in the Lower Basin of the Colorado River in Arizona and is not located in Navajo, Apache, or Cochise counties in Arizona. The term of an agreement under this section must not exceed 100 years.  (Sec. 7) This section grants authority to the Department of the Interior to approve or disapprove of an agreement under this act. Interior is also authorized to enter into agreements with CRIT under this act, provided Interior pays fair market value for the reduced consumptive use. Among other requirements, Interior must ensure that water agreements under this act do not permanently alienate any portion of the CRIT water allocation.  (Sec. 8) Interior, when approving an agreement under this act, must ensure that such agreement complies with the National Environmental Policy Act of 1969, the Endangered Species Act of 1973, and other federal environmental laws.  (Sec. 9) The CRIT must enter into an agreement with the state of Arizona prior to entering into an agreement under this act. The agreement with Arizona must outline all notice, information sharing, and collaboration requirements.  (Sec. 10) Interior must enter into an agreement with the state of Arizona and the CRIT describing the procedural, technical, and accounting methodologies for an agreement under this act.  (Sec. 11) This section reserves the CRIT's allocated water rights, including by ensuring that no agreement reduces or limits the right of the CRIT to use the remaining portion of their allocation.  (Sec. 12) This section prohibits an agreement under this act from interfering with an allottee's water rights. (Sec. 13) This section establishes that the CRIT is entitled to all consideration from an agreement under this act.  (Sec. 14) The United States has limited liability against claims under this act, except for those relating to the above environmental requirements.      ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3308"
      }
    },
    {
      "billData": {
        "title": "A bill to amend the White Mountain Apache Tribe Water Rights Quantification Act of 2010 to modify the enforceability date for certain provisions, and for other purposes.",
        "date": "2023-01-05"
      },
      "billSummary": "This act revises the White Mountain Apache Tribe Water Rights Quantification Act of 2010, including by extending certain deadlines and establishing reporting requirements. (The quantification act approved the White Mountain Apache Tribe Water Rights Quantification Agreement, settling the tribe's water rights in Arizona. It authorized the design and construction of a rural water system to address the water infrastructure needs on the tribe's reservation.) Specifically, the act extends the enforceability deadline, from 2023 to 2027, for the Department of the Interior to publish a statement of findings required by the quantification act. In particular, the act repeals the settlement agreement on December 31, 2027, if Interior does not publish by December 30, 2027, a statement of findings that specified conditions have been fulfilled (including that funds necessary to construct the rural water system have been deposited into a specified subaccount). The act makes changes to cost indexing for the funds and subaccounts established under the quantification act, including by allowing adjustments for construction costs. The act also requires annual reports to Congress describing all expenditures and including additional information, such as progress and cost accounting on the planning, design, and construction of the Miner Flat Dam and any additional water supply facilities resulting from expenditures.  Finally, the act establishes requirements for determining whether the rural water system is substantially complete. In particular, the rural water system shall be determined to be substantially complete if (1) the infrastructure is capable of storing, diverting, treating, transmitting, and distributing a supply of water as set forth in the final project design; or (2) Interior has expended all available funding and cannot complete construction due solely to the lack of additional authorized funding.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3168"
      }
    },
    {
      "billData": {
        "title": "Dr. Joanne Smith Memorial Rehabilitation Innovation Centers Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Dr. Joanne Smith Memorial Rehabilitation Innovation Centers Act of 2022 This act directs the Centers for Medicare &amp; Medicaid Services (CMS) to publish and biennially update a list of all rehabilitation innovation centers. The act defines rehabilitation innovation centers as rehabilitation facilities that (1) hold specified federal research and training designations for traumatic brain injury or spinal cord injury research, and (2) serve at least a certain number of Medicare patients. The CMS may waive such criteria as it deems appropriate. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2834"
      }
    },
    {
      "billData": {
        "title": "Equal Pay for Team USA Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Equal Pay for Team USA Act of 2022 This bill requires that all athletes representing the United States in international amateur athletic competitions receive equal compensation and benefits for their work, regardless of gender. Specifically, the bill requires, for a sport for which the U.S. Olympic and Paralympic Committees (the corporation) conduct separate programs for female and male athletes who represent the United States in international amateur athletic events, from funds directly provided by the corporation to the athlete (with exceptions), that there be equivalent and nondiscriminatory compensation, wages, benefits, medical care, travel arrangements, and payment or reimbursement for expenses. It shall be permissible to (1) consider merit, performance, seniority, or quantity of play in determining contract or other terms of participation; and (2) provide more beneficial terms of participation to athletes to address disparities in outside income, or the need to foster underdeveloped programs or address documented and justifiable personal need on the part of specific athletes or teams. The corporation must take all reasonable steps to advocate to international sports federations and other event organizers to equalize prizes, compensation, funding, and other support provided to athletes by such federations and organizers. The corporation must report to Congress at least annually on compliance. Each report must include detailed information on the median, minimum, and maximum stipends and bonuses provided to athletes, disaggregated by gender, race, and status of participation on a professional sports team. The bill requires full compliance within one year of this bill's enactment.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2333"
      }
    },
    {
      "billData": {
        "title": "National Heritage Area Act",
        "date": "2023-01-05"
      },
      "billSummary": "National Heritage Area Act This act establishes a National Heritage Area System.  The Department of the Interior may provide technical and financial assistance to local coordinating entities to support the establishment, development, and continuity of such areas. The National Heritage Area System shall be composed of  each National Heritage Area, National Heritage Corridor, National Heritage Canalway, Cultural Heritage Corridor, National Heritage Route, and National Heritage Partnership designated by Congress before or on enactment of this act; and each National Heritage Area designated by Congress after enactment of this act.   A National Heritage Area shall not be considered to be a unit of the National Park System nor subject to the authorities applicable to such units. Interior may carry out or review a study to assess the suitability and feasibility of each proposed heritage area for designation as a National Heritage Area. Interior must review and certify whether the proposed area meets specified requirements, including that it has natural, historic, and cultural resources that represent distinctive aspects of the heritage of the United States. An area shall be designated as a National Heritage Area only by an act of Congress. Interior shall conduct studies to assess the suitability and feasibility of designating specified areas in Hawaii as the Kaena Point National Heritage Area and in Virginia and North Carolina as the Great Dismal Swamp National Heritage Area. The act also (1) establishes or extends specified National Heritage Areas, (2) redesignates the America's Agricultural Heritage Partnership in Iowa as the Silos &amp; Smokestacks National Heritage Area, and (3) extends the deadline for the management plans for certain heritage areas.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1942"
      }
    },
    {
      "billData": {
        "title": "Hazard Eligibility and Local Projects Act",
        "date": "2023-01-05"
      },
      "billSummary": "Hazard Eligibility and Local Projects Act This act makes an entity seeking assistance under a hazard mitigation assistance program eligible to receive such assistance for certain projects already in progress. Specifically, this act covers a project that  is an acquisition and demolition project for which an entity began implementation, including planning or construction, before or after requesting assistance for the project under a hazard mitigation assistance program; and qualifies for a categorical exclusion under the National Environmental Policy Act of 1969.  The Federal Emergency Management Agency (FEMA) must have determined that the project qualifies for a categorical exclusion, is compliant with applicable floodplain management and protection of wetland regulations and criteria, and does not require consultation under any other environmental or historic preservation law or regulation or involve any extraordinary circumstances. FEMA must report to Congress, within 180 days of enactment and annually thereafter for three years, on use of the authority under this act. Such authority terminates three years after enactment.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1917"
      }
    },
    {
      "billData": {
        "title": "Martha Wright-Reed Just and Reasonable Communications Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Martha Wright-Reed Just and Reasonable Communications Act of 2022 This act requires the Federal Communications Commission (FCC) to ensure that rates and charges for payphone services or other calling devices, including advanced (e.g., audio or video) communications services in correctional institutions, are&nbsp;just and reasonable. When promulgating regulations or otherwise implementing this act, the FCC (1) may use industry-wide average costs related to providing telephone and advanced communications services, and (2) must consider costs for safety and security measures related to providing communications services in correctional facilities.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1541"
      }
    },
    {
      "billData": {
        "title": "Durbin Feeling Native American Languages Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Durbin Feeling Native American Languages Act of 2022 This act directs the President to review whether federal agencies are in compliance with requirements to promote the use of Native American languages and make recommendations to improve interagency coordination to support the use of these languages. It also requires the Administration for Native Americans to survey the use of Native American languages in the United States.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1402"
      }
    },
    {
      "billData": {
        "title": "Protecting American Intellectual Property Act of 2022",
        "date": "2023-01-05"
      },
      "billSummary": "Protecting American Intellectual Property Act of 2022 This bill imposes sanctions on certain foreign individuals and entities involved in the theft of trade secrets belonging to a U.S. individual or entity. The President shall periodically report a list of foreign individuals and entities that have knowingly engaged in, benefited from, or assisted in the significant theft of U.S. trade secrets that materially contributed to a significant threat to U.S. national security, foreign policy, or economic health. The report shall also list foreign individuals who are chief executive officers or board members of any foreign entity engaging in such theft. The President shall impose (1) property- and visa-blocking sanctions on individuals named in the report; and (2) property- or export-blocking sanctions, including denial of certain financial assistance, on entities named in the report. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1294"
      }
    },
    {
      "billData": {
        "title": "Great Dismal Swamp National Heritage Area Act",
        "date": "2023-01-05"
      },
      "billSummary": "Great Dismal Swamp National Heritage Area Act This act directs the Department of the Interior to assess the suitability and feasibility of designating a study area comprised of cities and counties in Virginia and counties in North Carolina as a National Heritage Area to be known as the Great Dismal Swamp National Heritage Area. The study shall include analysis, documentation, and determinations on whether the study area (1) has an assemblage of natural, historic, and cultural resources that represent distinctive aspects of the people and culture of the United States; and (2) are worthy of recognition, conservation, interpretation, and continuing use.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1154"
      }
    },
    {
      "billData": {
        "title": "Sami's Law",
        "date": "2023-01-05"
      },
      "billSummary": "Sami's Law This act addresses safety requirements for passengers and drivers of ride-sharing companies (e.g., Uber, Lyft, or taxicabs). The act requires the Government Accountability Office to submit to Congress a biennial report that includes the results of a study regarding (1) the incidence of fatal and non-fatal physical assault and sexual assault in the preceding two calendar years on drivers by passengers of ride-sharing vehicles and on passengers by drivers of such vehicles, (2) the nature and specifics of any background checks conducted on prospective drivers of ride-sharing vehicles, and (3) the safety steps taken by ride-sharing companies related to rider and driver safety.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1082"
      }
    },
    {
      "billData": {
        "title": "DRIVERS Act",
        "date": "2023-01-03"
      },
      "billSummary": "Developing Robust Investments in Vehicle Education for Roadway Safety Act or the DRIVERS Act This bill addresses statewide efforts to improve traffic safety for teen drivers. Specifically, the bill authorizes states to use highway safety program funding for affordable and accessible classroom-based driving instruction to prepare teens for state graduated driving license requirements.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9704"
      }
    },
    {
      "billData": {
        "title": "Ensuring Diverse Leadership Act of 2022",
        "date": "2023-01-03"
      },
      "billSummary": "Ensuring Diverse Leadership Act of 2022 This bill requires that, when appointing a president, a Federal Reserve Bank must interview at least one individual reflective of gender diversity and one reflective of racial or ethnic diversity. The bill amends numerous banking-, finance-, and trade-related acts to make references to officials (including those to the Chairman of the Board of Governors of the Federal Reserve System) gender-neutral. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9706"
      }
    },
    {
      "billData": {
        "title": "Promoting Diverse Investment Advisers Act",
        "date": "2023-01-03"
      },
      "billSummary": "Promoting Diverse Investment Advisers Act This bill requires the Federal Reserve Board to set goals related to woman-, minority-, or veteran-owned or controlled firms in certain investment management agreements made related to the board's authority in unusual and exigent circumstances.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9705"
      }
    },
    {
      "billData": {
        "title": "Protecting the Safety of Air Traffic Control and the Aviation System Act",
        "date": "2023-01-03"
      },
      "billSummary": "Protecting the Safety of Air Traffic Control and the Aviation System Act This bill directs the Federal Aviation Administration to issue specific regulations and policy, where appropriate, on cybersecurity and cyber threat management related to the national airspace system (which includes air traffic control facilities and airports) and aircraft.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9709"
      }
    },
    {
      "billData": {
        "title": "MOM Act",
        "date": "2023-01-03"
      },
      "billSummary": "Making Opportunities for Mothers Act or the MOM Act This bill provides block grants to states to provide child care services to mothers under the age of 18 who are attending school or who are employed after attending courses.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9707"
      }
    },
    {
      "billData": {
        "title": "Fixing Administrations Unethical Corrupt Influence Act",
        "date": "2023-01-03"
      },
      "billSummary": "Fixing Administrations Unethical Corrupt Influence Act or the FAUCI Act This bill prohibits specified federal officials and employees from (1) serving on the board of any association, corporation, or entity that directly manufacturers or researches certain vaccines after their government employment; and (2) owning, profiting from, or applying for patents for vaccines or medical treatments during their federal employment.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9708"
      }
    },
    {
      "billData": {
        "title": "Improving Seniors’ Timely Access to Care Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "Improving Seniors' Timely Access to Care Act of 2022 This bill establishes several requirements and standards relating to prior authorization processes under Medicare Advantage (MA) plans. Specifically, MA plans must (1) establish an electronic prior authorization program that meets specified standards, including the ability to provide real-time decisions in response to requests for items and services that are routinely approved; (2) annually publish specified prior authorization information, including the percentage of requests approved and the average response time; and (3) meet other standards, as set by the Centers for Medicare &amp; Medicaid Services, relating to the quality and timeliness of prior authorization determinations. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8487"
      }
    },
    {
      "billData": {
        "title": "Ocean-Based Climate Solutions Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "Ocean-Based Climate Solutions Act of 2022 This bill establishes a variety of requirements to reduce carbon emissions and protect oceans, coastal habitats, marine mammals, and fish populations from climate change and other threats.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3764"
      }
    },
    {
      "billData": {
        "title": "American Music Fairness Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "American Music Fairness Act of 2022 This bill establishes that the copyright holder of a sound recording shall have the exclusive right to perform the sound recording through an audio transmission and addresses other related issues. (Currently, the public performance right only covers performances through a digital audio transmission in certain instances, which means that nonsubscription terrestrial radio stations generally do not have to secure a license to publicly perform a copyright-protected sound recording.) Under the bill, a nonsubscription broadcast transmission must have a license to publicly perform such sound recordings. The Copyright Royalty Board must periodically determine the royalty rates for such a license. When determining the rates, the board must base its decision on certain information presented by the parties, including the radio stations' effect on other streams of revenue related to the sound recordings.  Terrestrial broadcast stations (and the owners of such stations) that fall below certain revenue thresholds may pay certain flat fees, instead of the board-established rate, for a license to publicly perform copyright-protected sound recordings.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4130"
      }
    },
    {
      "billData": {
        "title": "Environmental Justice For All Act",
        "date": "2022-12-30"
      },
      "billSummary": "Environmental Justice For All Act This bill establishes several environmental justice requirements, advisory bodies, and programs and modifies the scope of environmental review under the National Environmental Policy Act of 1969. The bill sets forth provisions to address the disproportionate adverse human health or environmental effects of federal laws or programs on communities of color, low-income communities, or tribal and indigenous communities. It also prohibits disparate impacts on the basis of race, color, or national origin as discrimination. Aggrieved persons may seek legal remedy when faced with such discrimination. In addition, the bill directs agencies to follow certain requirements concerning environmental justice. For example, agencies must prepare community impact reports that assess the potential impacts of their actions on environmental justice communities under certain circumstances. It also raises coal, oil, and gas royalty rates to create a funding source to support fossil fuel-dependent communities and displaced workers as they transition away from fossil fuel industries.  Additionally, the bill creates a variety of advisory bodies and positions, such as the White House Environmental Justice Interagency Council. Among other things, the council must issue an environmental justice strategy. It also establishes requirements and programs concerning chemicals or toxic ingredients in certain products. For example, the bill (1) requires certain products (e.g., cosmetics) to include a list of ingredients or warnings; and (2) provides grants for research on designing safer alternatives to chemicals in certain consumer, cleaning, toy, or baby products that have an inherent toxicity or that are associated with chronic adverse health effects. Finally, it creates a variety of funding programs, such as a grant program to enhance access to park and recreational opportunities in urban areas.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2021"
      }
    },
    {
      "billData": {
        "title": "Insular Area Climate Change Act",
        "date": "2022-12-30"
      },
      "billSummary": "Insular Area Climate Change Act This bill provides support through programs and financial assistance for climate change planning, mitigation, adaptation, and resilience in U.S. territories (American Samoa, Guam, Northern Mariana Islands, Puerto Rico, and the U.S. Virgin Islands) and the Freely Associated States (Micronesia, Marshall Islands, and Palau). For example, the bill requires the Technical Assistance Program of the Department of the Interior's Office of Insular Affairs to provide technical assistance for climate change planning, mitigation, adaptation, and resilience to the territories and Freely Associated States. It also establishes an Insular Area National Program Office within the Environmental Protection Agency to build and strengthen infrastructure to withstand natural disasters, expand renewable energy and energy efficiency, and provide technical assistance in the territories and Freely Associated States. Additionally, the bill establishes several grant programs to assess and reduce the impacts of climate change, expand renewable energy and energy efficiency, or expand sustainable infrastructure to withstand natural disasters in the territories and Freely Associated States.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2780"
      }
    },
    {
      "billData": {
        "title": "Sustaining America’s Fisheries for the Future Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "Sustaining America's Fisheries for the Future Act of 2022 This bill sets forth and revises various provisions relating to fisheries conservation and management, including to increase the adaptive capacity of fishery management to the impacts of climate change, implement working waterfront plans, establish an innovation prize for data collection technology used in fisheries management, and establish a national standardized reporting program for bycatch.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4690"
      }
    },
    {
      "billData": {
        "title": "Recreation and Public Purposes Tribal Parity Act",
        "date": "2022-12-30"
      },
      "billSummary": "Recreation and Public Purposes Tribal Parity Act This bill authorizes the Department of the Interior to sell or lease public lands to federally recognized Indian tribes for recreational or public purposes, subject to annual acreage limitations.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8115"
      }
    },
    {
      "billData": {
        "title": "Sea Turtle Rescue Assistance Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "Sea Turtle Rescue Assistance Act of 2022 This bill establishes the Sea Turtle Rescue Assistance Grant Program.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7918"
      }
    },
    {
      "billData": {
        "title": "LODGE Act",
        "date": "2022-12-30"
      },
      "billSummary": "Lodging Options Developed for Government Employees Act or the LODGE Act This bill expands the current authority of the Department of the Interior to enter into agreements with housing entities to provide rental housing for employees.  The bill allows Interior to enter agreements with other federal agencies, state or local governments, tribal governments, or other public or private organizations for purposes of facilitating housing accommodation projects for rent to field employees and members of the public  on public lands, including National Park System units; off public lands in the vicinity of system units; or on a combination of such lands.  Interior may allow field employees and members of the public to occupy and lease project quarters.  Field employees and members of the public shall be prohibited from subleasing housing units or quarters developed or leased in accordance with a housing partnership agreement under this bill, including all forms of short-term rentals. To the maximum extent practicable, priority for occupancy in project quarters shall be given to field employees.  Interior may collect, or authorize entities who have entered into partnership housing agreements under this bill to collect, rents directly from field employees and members of the public occupying housing units or quarters. The bill modifies the lease-to-build program to allow Interior to lease federal land and interests in land to qualified persons for the construction of field employee quarters for any period not to exceed 60 years (under current law not to exceed 50 years).",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7615"
      }
    },
    {
      "billData": {
        "title": "To authorize leases of up to 99 years for lands held in trust for the Confederated Tribes of the Chehalis Reservation.",
        "date": "2022-12-30"
      },
      "billSummary": "This bill authorizes the Confederated Tribes of the Chehalis Reservation to lease their land held in trust for a term of up to 99 years. The tribe is located in western Washington State.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6964"
      }
    },
    {
      "billData": {
        "title": "To authorize the Thomas Paine Memorial Association to establish a commemorative work in the District of Columbia and its environs, and for other purposes.",
        "date": "2022-12-30"
      },
      "billSummary": "This bill authorizes the Thomas Paine Memorial Association to establish a commemorative work on federal land in the District of Columbia in honor of the philosopher and patriot, Thomas Paine. Thomas Paine is best known for writing Common Sense, a pamphlet that helped to inspire the Revolutionary War.  The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.  Federal funds may not be used to pay any expense to establish the commemorative work. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6720"
      }
    },
    {
      "billData": {
        "title": "Katimiîn and Ameekyáaraam Sacred Lands Act",
        "date": "2022-12-30"
      },
      "billSummary": "Katimi&icirc;n and Ameeky&aacute;araam Sacred Lands Act This bill takes approximately 1,031 acres of specified lands in Siskiyou and Humboldt Counties, California, into trust for the benefit of the Karuk Tribe. Land taken into trust may be used for traditional and customary uses for the benefit of the tribe. Additionally, the land taken into trust must allow for continued access by the Forest Service for managing the component of the National Wild and Scenic Rivers System that flows through the land. The Department of Agriculture must enter into a memorandum of understanding with the tribe to establish mutual goals for the protection and enhancement of the river values of such component.  Further, the bill prohibits gaming on the land taken into trust.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6032"
      }
    },
    {
      "billData": {
        "title": "Federal Land Asset Inventory Reform Act of 2021",
        "date": "2022-12-30"
      },
      "billSummary": "Federal Land Asset Inventory Reform Act of 2021 This bill directs the Department of the Interior to develop and maintain a current and accurate multipurpose cadastre (inventory) of federal real property (excluding Indian land) to support federal land management activities on federal real property, including resource development and conservation and agricultural use.   Interior may enter cost-sharing agreements with states to include nonfederal real property in the cadastre. Interior shall report on (1) existing real property inventories or any components of any cadastre of federal real property, (2) consolidation of inventories and components, (3) the use of existing inventories and components of any cadastre, (4) cost savings that will be achieved, (5) a plan for implementation of this bill, and (6) recommendations for legislation.  Interior shall (1) make the multipurpose cadastre publicly available on the internet, and (2) ensure that such cadastre includes the identification of all lands suitable for disposal pursuant to the Federal Land Policy and Management Act of 1976.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5522"
      }
    },
    {
      "billData": {
        "title": "Sinkhole Mapping Act of 2021",
        "date": "2022-12-30"
      },
      "billSummary": "Sinkhole Mapping Act of 2021 This bill directs the United States Geological Survey (USGS)&nbsp;to establish a program to map zones that are at greater risk of sinkhole formation. Specifically, the USGS must   study the short-term and long-term mechanisms that cause sinkholes, including extreme storm events, prolonged droughts causing shifts in water management practices, aquifer depletion, and other major changes in water use; and  develop maps depicting the zones that are at greater risk of forming sinkholes.  The USGS&nbsp;must establish a public website that displays such maps and other relevant information critical for use by community planners and emergency managers. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3681"
      }
    },
    {
      "billData": {
        "title": "Recognizing and celebrating the 75th anniversary of the National Association of Conservation Districts and their commitment to our lands.",
        "date": "2022-12-30"
      },
      "billSummary": "This resolution recognizes and celebrates the 75th anniversary of the National Association of Conservation Districts.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "641"
      }
    },
    {
      "billData": {
        "title": "Combating Online Wildlife Trafficking Act of 2021",
        "date": "2022-12-30"
      },
      "billSummary": "Combating Online Wildlife Trafficking Act of 2021 This bill reauthorizes through October 7, 2026, and revises the Presidential Task Force on Wildlife Trafficking. The task force must develop recommendations and establish a working group to address wildlife trafficking online and on social media. In addition, the Department of State and the U.S. Agency for International Development must create a strategy for engaging with internet and social media companies to address wildlife trafficking on their platforms.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1546"
      }
    },
    {
      "billData": {
        "title": "Illegal Fishing and Forced Labor Prevention Act",
        "date": "2022-12-30"
      },
      "billSummary": "Illegal Fishing and Forced Labor Prevention Act This bill sets forth and revises federal law concerning activities to combat human trafficking and illegal, unreported, or unregulated fishing in the seafood industry.  The National Oceanic and Atmospheric Administration (NOAA) shall expand the Seafood Import Monitoring Program to apply to all seafood and seafood products imported into the United States. The Departments of Commerce, Homeland Security, Labor, and Health and Human Services must jointly execute a memorandum of understanding to codify and improve interagency cooperation on seafood safety, preventing illegal, unreported, or unregulated fishing and human trafficking, including forced labor, and seafood fraud prevention, enforcement, and inspections. NOAA shall engage with each flag, coastal, port, and market nation that exports seafood to the United States to collect information sufficient to evaluate the effectiveness of such nation's management of fisheries and control systems to prevent illegal, unreported, or unregulated fishing.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3075"
      }
    },
    {
      "billData": {
        "title": "Advancing Conservation and Education Act",
        "date": "2022-12-30"
      },
      "billSummary": "Advancing Conservation and Education Act  This bill allows the states of Alaska, Arizona, California, Colorado, Idaho, Montana, New Mexico, North Dakota, Oregon, South Dakota, Utah, Washington, or Wyoming to relinquish state land grant parcels wholly or primarily within eligible areas and select, in exchange, public land within the state.  Eligible areas are areas within the outer boundaries of units or components of the National Park, National Wilderness Preservation, National Wildlife Refuge, or National Landscape Conservation Systems, areas identified by the Bureau of Land Management (BLM) as having wilderness characteristics, certain designated lands within the National Forest System or administered by the BLM, and sentinel landscapes designated by the Department of Agriculture, Department of Defense, or Department of the Interior.   Interior shall create a process for the relinquishment of such parcels.   States may select in exchange, and Interior may convey, lands that are mineral in character.   The overall value of the state land grant parcels and the public land to be conveyed shall be equal or made equal.  The bill sets forth requirements regarding hazardous materials on land to be conveyed, water rights, grazing permits, road rights-of-ways, and protection of Indian rights.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2348"
      }
    },
    {
      "billData": {
        "title": "Methane Waste Prevention Act of 2021",
        "date": "2022-12-30"
      },
      "billSummary": "Methane Waste Prevention Act of 2021 This bill establishes requirements to reduce methane emissions from the oil and natural gas sector. Methane is emitted during the production and transport of coal, natural gas, and oil. Specifically, the Environmental Protection Agency (EPA) must issue regulations that require the sector to reduce methane emissions over time. By 2025, methane emissions must be at least 65% below 2012 emissions. By 2030, the emissions must be at least 90% below 2012 emissions. The Department of the Interior must also establish regulations to reduce and prevent the waste of natural gas on federal land and Indian lands, including waste from venting, flaring, and fugitive releases. The regulations must include consistent enforcement mechanisms for any oil or gas operations that are not in compliance.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1492"
      }
    },
    {
      "billData": {
        "title": "Alaska Native Tribal Health Consortium Land Transfer Act",
        "date": "2022-12-30"
      },
      "billSummary": "Alaska Native Tribal Health Consortium Land Transfer Act This bill directs the Department of Health and Human Services to convey specified property in Anchorage, Alaska, to the Alaska Native Tribal Health Consortium for use in connection with health programs. The conveyance shall not require any consideration from, or impose any obligation, term, or condition on, the consortium or allow for any U.S. reversionary interest in the property. The consortium shall not be liable for any environmental contamination that occurred before the date on which the consortium assumes control of, occupies, and uses the property.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "443"
      }
    },
    {
      "billData": {
        "title": "Southeast Alaska Regional Health Consortium Land Transfer Act",
        "date": "2022-12-30"
      },
      "billSummary": "Southeast Alaska Regional Health Consortium Land Transfer Act This bill directs the Department of Health and Human Services (HHS) to convey specified property in Sitka, Alaska, to the Southeast Alaska Regional Health Consortium for use in connection with health and social services programs.  The conveyance shall not require any consideration from, or impose any obligation, term, or condition on, the consortium or allow for any U.S. reversionary interest in the property.  The consortium shall not be liable for any environmental contamination that occurred before the conveyance. Further, HHS shall not be liable for any environmental contamination from the date on which the consortium assumes control of, occupies, and uses the property.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "442"
      }
    },
    {
      "billData": {
        "title": "To amend the Internal Revenue Code of 1986 to allow deductions and credits relating to expenditures in connection with marijuana sales conducted in compliance with State law.",
        "date": "2022-12-30"
      },
      "billSummary": "This bill exempts a trade or business that conducts marijuana sales in compliance with state law from a provision in the Internal Revenue Code that prohibits business-related tax credits or deductions for expenditures in connection with trafficking in controlled substances.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9702"
      }
    },
    {
      "billData": {
        "title": "Examining Educational Redlining in Lending Act",
        "date": "2022-12-30"
      },
      "billSummary": "Examining Educational Redlining in Lending Act  This bill requires the Consumer Financial Protection Bureau to annually assess and report on the use of educational data in determining a consumer's creditworthiness by an individual offering a consumer financial product or service. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9699"
      }
    },
    {
      "billData": {
        "title": "Welfare Reform Act of 2022",
        "date": "2022-12-30"
      },
      "billSummary": "Welfare Reform Act of 2022 This bill directs the Bureau of Land Management (BLM) to establish a program to convey certain federal land to individuals who permanently waive eligibility for certain welfare programs. The BLM shall have final discretion as to the allocation of land to such individuals but must provide them with a means to express their preference for available land, including whether the land will be used for residential or agricultural purposes. The bill prohibits the sale of the land for a 10-year period.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9701"
      }
    },
    {
      "billData": {
        "title": "Taiwan Status Diplomacy Act",
        "date": "2022-12-30"
      },
      "billSummary": "Taiwan Status Diplomacy Act This bill directs the Department of State to issue a legal opinion detailing the reasoning supporting the position of the United States regarding Taiwan's sovereignty and U.S. nonrecognition of China's territorial claim over Taiwan. The State Department must also conduct diplomatic efforts to inform and persuade countries of the legal reasoning supporting the position of the United States regarding Taiwan's status.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9700"
      }
    },
    {
      "billData": {
        "title": "SANTOS Act",
        "date": "2022-12-30"
      },
      "billSummary": "Stopping Another Non-Truthful Office Seeker Act or the SANTOS Act This bill requires congressional candidates to file additional personal information with their principal campaign committees and the Federal Election Commission. The bill also imposes criminal penalties for knowingly and willfully violating this requirement, such as by providing false information. Specifically, the bill requires any individual who is a candidate for the House of Representatives or the Senate to provide information about their educational background, military service (if any), and employment history.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9703"
      }
    },
    {
      "billData": {
        "title": "American Data Privacy and Protection Act",
        "date": "2022-12-30"
      },
      "billSummary": "American Data Privacy and Protection Act This bill establishes requirements for how companies, including nonprofits and common carriers, handle personal data, which includes information that identifies or is reasonably linkable to an individual. Specifically, the bill requires most companies to limit the collection, processing, and transfer of personal data to that which is reasonably necessary to provide a requested product or service and to other specified circumstances. It also generally prohibits companies from transferring individuals' personal data without their affirmative express consent. The bill establishes consumer data protections, including the right to access, correct, and delete personal data. Prior to engaging in targeted advertising, the bill requires companies to provide individuals with a means to opt out of such advertising. The bill also provides additional protections with respect to personal data of individuals under the age of 17. It further prohibits companies from using personal data to discriminate based on specified protected characteristics. Additionally, companies must implement security practices to protect and secure personal data against unauthorized access, and the Federal Trade Commission (FTC) may issue regulations for complying with this requirement. The bill provides for enforcement of these requirements by the FTC and state attorneys general. Beginning two years after the bill takes effect, individuals may, subject to certain notification requirements, bring civil actions for violations of the bill. Finally, the bill preempts state laws that are covered by the provisions of the bill except for certain categories of state laws and specified laws in Illinois and California.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8152"
      }
    },
    {
      "billData": {
        "title": "NTIA Policy and Cybersecurity Coordination Act",
        "date": "2022-12-30"
      },
      "billSummary": "NTIA Policy and Cybersecurity Coordination Act This bill establishes within the National Telecommunications and Information Administration the Office of Policy Development and Cybersecurity to oversee and conduct national communications and information policy analysis and development for the internet and communications technologies. Among its duties, the office shall develop, analyze, and advocate for market-based policies that promote innovation, competition, consumer access, digital inclusion, workforce development, and economic growth in the communications, media, and technology markets. The office must also coordinate processes to create guidance or to support the development and implementation of cybersecurity and privacy policies with respect to the internet and other communications networks.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4046"
      }
    },
    {
      "billData": {
        "title": "Ensuring American Global Leadership and Engagement Act",
        "date": "2022-12-30"
      },
      "billSummary": "Ensuring American Global Leadership and Engagement Act or the EAGLE Act  This bill addresses various foreign relations issues, with a focus on China.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3524"
      }
    },
    {
      "billData": {
        "title": "Consolidated Appropriations Act, 2023",
        "date": "2022-12-29"
      },
      "billSummary": "test",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2617"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 6401 El Cajon Boulevard in San Diego, California, as the \"Susan A. Davis Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 6401 El Cajon Boulevard in San Diego, California, as the Susan A. Davis Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9308"
      }
    },
    {
      "billData": {
        "title": "Faster Payments to Veterans' Survivors Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Faster Payments to Veterans' Survivors Act of 2022 This act modifies policies and procedures related to the payment of benefits under certain life insurance programs administered by the Department of Veterans Affairs (VA). If a primary beneficiary has not made a claim for payment within one year (currently two years) after the death of the insured under the National Service Life Insurance (NSLI) program or the United States Government Life Insurance (USGLI) program, the VA is authorized to make payment to another designated beneficiary as if the primary beneficiary had predeceased the insured. If no designated beneficiary makes a claim within two years (currently four years) after the death of the insured, the VA is authorized to make a payment to a person the VA deems to be equitably entitled to such benefit. The act also modifies the beneficiary designation process under NSLI and USGLI. Specifically, if a person does not designate a beneficiary for insurance, or if the designated beneficiary predeceases the insured person, the VA must determine the beneficiary in a specified order of succession. Additionally, the act requires the VA to improve its processes and procedures with respect to identifying, locating, and paying hard-to-find beneficiaries of life insurance policies, including by improving its website search tools.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8260"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 236 Concord Exchange North in South Saint Paul, Minnesota, as the \"Officer Leo Pavlak Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 236 Concord Exchange North in South Saint Paul, Minnesota, as the Officer Leo Pavlak Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8226"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 651 Business Interstate Highway 35 North Suite 420 in New Braunfels, Texas, as the \"Bob Krueger Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 651 Business Interstate Highway 35 North Suite 420 in New Braunfels, Texas, as the Bob Krueger Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8203"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 825 West 65th Street in Minneapolis, Minnesota, as the \"Charles W. Lindberg Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 825 West 65th Street in Minneapolis, Minnesota, as the Charles W. Lindberg Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8026"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 100 South 1st Street in Minneapolis, Minnesota, as the \"Martin Olav Sabo Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 100 South 1st Street in Minneapolis, Minnesota, as the Martin Olav Sabo Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "8025"
      }
    },
    {
      "billData": {
        "title": "RESPECT Act",
        "date": "2022-12-27"
      },
      "billSummary": "Repealing Existing Substandard Provisions Encouraging Conciliation with Tribes Act or the RESPECT Act This act repeals certain provisions related to the treatment of Indians, including provisions on hostile tribes, alcohol, work requirements, penalties for truancy, and placement of youth in reform school without the consent of a parent or guardian.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "789"
      }
    },
    {
      "billData": {
        "title": "For the relief of Maria Isabel Bueso Barrera, Alberto Bueso Mendoza, and Karla Maria Barrera De Bueso.",
        "date": "2022-12-27"
      },
      "billSummary": "This bill provides for the relief of Maria Isabel Bueso Barrera, Alberto Bueso Mendoza, and Karla Maria Barrera De Bueso. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "785"
      }
    },
    {
      "billData": {
        "title": "Improving Access to the VA Home Loan Benefit Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Improving Access to the VA Home Loan Benefit Act of 2022 This act requires the Department of Veterans Affairs (VA) to update regulations, requirements, and guidance related to appraisals for housing loans guaranteed by the VA. Specifically, such regulations or requirements must specify when an appraisal is required, how an appraisal is to be conducted, and who is eligible to conduct an appraisal for such loans. The act also requires the VA to submit to Congress recommendations for improving the delivery times for appraisals for VA loans and to take such recommendations into consideration in prescribing its updated regulations or requirements. The VA must also provide additional guidance for desktop appraisals, which are performed remotely using information gathered by third parties with whom a VA-approved appraiser has entered into an agreement for such appraisal. In updating such guidance, the VA must specifically take into account situations where (1) desktop appraisals provide cost savings for borrowers, and (2) a traditional appraisal requirement could cause time delays and jeopardize the completion of a transaction.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7735"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 6000 South Florida Avenue in Lakeland, Florida, as the \"U.S. Marine Corporal Ronald R. Payne Jr. Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 6000 South Florida Avenue in Lakeland, Florida, as the U.S. Marine Corporal Ronald R. Payne Jr. Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7638"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 2050 South Boulevard in Bloomfield Township, Michigan, as the \"Dr. Ezra S. Parke Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 2050 South Boulevard in Bloomfield Township, Michigan, as the Dr. Ezra S. Parke Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7519"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 23200 John R Road in Hazel Park, Michigan, as the \"Roy E. Dickens Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 23200 John R Road in Hazel Park, Michigan, as the Roy E. Dickens Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7518"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 345 South Main Street in Butler, Pennsylvania, as the \"Andrew Gomer Williams Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 345 South Main Street in Butler, Pennsylvania, as the Andrew Gomer Williams Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7514"
      }
    },
    {
      "billData": {
        "title": "MST Claims Coordination Act",
        "date": "2022-12-27"
      },
      "billSummary": "MST Claims Coordination Act This act modifies the Department of Veterans Affairs (VA) claims process for claims related to military sexual trauma (MST). During or immediately after a medical examination, hearing before the Board of Veterans' Appeals, or other relevant event, the Veterans Benefits Administration (VBA) must coordinate with the Veterans Health Administration (VHA) to provide veterans who elect to receive materials with outreach letters, information on the Veterans Crisis Line, information on how to make an appointment with a mental health provider, and other information on available resources relating to MST. Additionally, the VHA and the VBA must provide such materials with the determination the VA provides to the claimant in connection with a claim for compensation.  In a claim for compensation arising from MST experienced by a veteran who is enrolled in the VA health care system and consents to the notification system, the VBA must automatically notify the VHA before the veteran (1) participates in a medical examination, hearing, or other relevant event; or (2) receives a determination from the VA in connection with the claim for compensation.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7335"
      }
    },
    {
      "billData": {
        "title": "SVAC Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Strengthening VA Cybersecurity Act of 2022 or the SVAC Act of 2022 This act requires the Department of Veterans Affairs (VA) to seek to enter into an agreement with a federally funded research and development center to provide a cybersecurity assessment of five high-impact VA information systems and the effectiveness of the VA's information security program and information security management system. The VA must submit a plan to Congress to address the findings of the assessment. The Government Accountability Office must review the assessment and the VA's response to the assessment and report its findings to Congress.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7299"
      }
    },
    {
      "billData": {
        "title": "Human Trafficking Prevention Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Human Trafficking Prevention Act of 2022 This act requires the posting of contact information of the national human trafficking hotline in specific places. Specifically, the information must be posted  in a visible place in all federal buildings; in the restrooms of each U.S. aircraft, airport, over-the-road bus, bus station, passenger train, and passenger railroad station; and at each port of entry. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7181"
      }
    },
    {
      "billData": {
        "title": "VAWA Technical Amendment Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "VAWA Technical Amendment Act of 2022 This act allows formula grants for tribal domestic violence and sexual assault coalitions to be used to support women in Native Hawaiian communities in addition to women in tribal communities. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "7"
      }
    },
    {
      "billData": {
        "title": "Dignity for MST Survivors Act",
        "date": "2022-12-27"
      },
      "billSummary": "This act modifies communications and procedures for the Department of Veterans Affairs (VA) and Board of Veterans' Appeals (BVA) regarding claims for compensation based on military sexual trauma (MST) experienced by veterans. The act requires the VA to ensure each member of the BVA is offered annual training on MST and proceedings that concern a claim for compensation based on MST. A proceeding that concerns a claim for compensation based on MST may not be assigned to a member of the BVA (or a panel of members) unless such persons have completed the annual training. When a notice of disagreement is filed, the BVA must promptly determine whether it is filed for a case that concerns a claim for compensation based on MST and for which the appellant has requested a hearing in the notice. The VA must audit the language used in letters sent to individuals to explain decisions denying claims for compensation based on MST. Letters must be modified to ensure (1) the use of trauma-informed language, and (2) veterans are not retraumatized through insensitive language. The VA must establish protocols for VA medical providers and contract medical providers to ensure that the medical providers use trauma-informed practices in conducting examinations in relation to claims for compensation based on MST.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6961"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 301 East Congress Parkway in Crystal Lake, Illinois, as the \"Ryan J. Cummings Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 301 East Congress Parkway in Crystal Lake, Illinois, as the Ryan J. Cummings Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6917"
      }
    },
    {
      "billData": {
        "title": "For the relief of Rebecca Trimble.",
        "date": "2022-12-27"
      },
      "billSummary": "This bill provides for the relief of Rebecca Trimble.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "681"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 1400 N Kraemer Blvd. in Placentia, California, as the \"PFC Jang Ho Kim Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 1400 N Kraemer Blvd. in Placentia, California, as the PFC Jang Ho Kim Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6630"
      }
    },
    {
      "billData": {
        "title": "Veterans Eligible to Transfer School (VETS) Credit Act",
        "date": "2022-12-27"
      },
      "billSummary": "Veterans Eligible to Transfer School (VETS) Credit Act This act addresses eligibility for Department of Veterans Affairs (VA) educational assistance for individuals who are transferring credits due to the closure or disapproval of a program of education. Currently, an individual who transfers fewer than 12 credits from a program of education that is closed or disapproved must be deemed to have not received such credits, and the period for which the entitlement is not charged must be the entire period of the individual's enrollment in the program. Under the act, the VA must require an individual to certify in writing the transfer of fewer than 12 credits from a program of education that is closed or disapproved. The VA must accept such a certification as proof that the individual is transferring fewer than 12 credits.  The VA must provide a certificate of eligibility (to demonstrate proof of full educational assistance entitlement) to individuals who make the certification and acknowledge that if 12 or more credits are transferred (1) they may not be deemed to be someone who did not receive such credits, and (2) the VA must rescind the certificate of eligibility in such cases. The VA must notify individuals who are eligible to make such a certification and receive a certificate of eligibility. The act also removes the requirement that an individual transferring a Post-9/11 GI Bill entitlement must specify the period for which the transfer must be effective for each dependent who is designated to receive the transfer.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6604"
      }
    },
    {
      "billData": {
        "title": "Red River National Wildlife Refuge Boundary Modification Act",
        "date": "2022-12-27"
      },
      "billSummary": "Red River National Wildlife Refuge Boundary Modification Act This bill modifies the boundary of the Red River National Wildlife Refuge in Louisiana. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6427"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \"Veterans of Iraq and Afghanistan Memorial Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the Veterans of Iraq and Afghanistan Memorial Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6386"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 15 Chestnut Street in Suffern, New York, as the \"Sergeant Gerald T. 'Jerry' Donnellan Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 15 Chestnut Street in Suffern, New York, as the Sergeant Gerald T. &quot;Jerry&quot; Donnellan Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6267"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 155 Main Avenue West in Winsted, Minnesota, as the \"James A. Rogers Jr. Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 155 Main Avenue West in Winsted, Minnesota, as the James A. Rogers Jr. Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6221"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 100 3rd Avenue Northwest in Perham, Minnesota, as the \"Charles P. Nord Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 100 3rd Avenue Northwest in Perham, Minnesota, as the Charles P. Nord Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6220"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 317 Blattner Drive in Avon, Minnesota, as the \"W.O.C. Kort Miller Plantenberg Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 317 Blattner Drive in Avon, Minnesota, as the W.O.C. Kort Miller Plantenberg Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6218"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 5420 Kavanaugh Boulevard in Little Rock, Arkansas, as the \"Ronald A. Robinson Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 5420 Kavanaugh Boulevard in Little Rock, Arkansas, as the Ronald A. Robinson Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6080"
      }
    },
    {
      "billData": {
        "title": "To direct the Secretary of Veterans Affairs to seek to enter into an agreement with the National Academies of Sciences, Engineering, and Medicine for a review of examinations, furnished by the Secretary, to individuals who submit claims to the Secretary for compensation under chapter 11 of title 38, United States Code, for mental and physical conditions linked to military sexual trauma.",
        "date": "2022-12-27"
      },
      "billSummary": "This act requires the Department of Veterans Affairs (VA) to seek to enter into an agreement with the National Academies of Sciences, Engineering, and Medicine (NASEM) to conduct a comprehensive review of VA medical examinations provided to individuals who submit claims for compensation for a service-connected disability related to military sexual trauma.  Specifically, NASEM must review VA examinations that are provided for mental and physical conditions linked to military sexual trauma and are conducted to assess the impairments of individuals arising from such trauma. NASEM must report on its review, and the VA must report on its plans to implement actions based on NASEM's findings and recommendations.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6064"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 213 William Hilton Parkway in Hilton Head Island, South Carolina, as the \"Caesar H. Wright Jr. Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 213 William Hilton Parkway in Hilton Head Island, South Carolina, as the Caesar H. Wright Jr. Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6042"
      }
    },
    {
      "billData": {
        "title": "Great Lakes Fish and Wildlife Restoration Reauthorization Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Great Lakes Fish and Wildlife Restoration Reauthorization Act of 2022 This act reauthorizes through FY2028 the Great Lakes Fish and Wildlife Restoration Act of 1990.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5973"
      }
    },
    {
      "billData": {
        "title": "To make revisions in title 5, United States Code, as necessary to keep the title current, and to make technical amendments to improve the United States Code.",
        "date": "2022-12-27"
      },
      "billSummary": "This act restates current law concerning federal advisory committees, Offices of Inspector General, and financial disclosure requirements for federal personnel (including the President, Vice President, and executive branch officers and employees), as well as limitations on outside earned income and employment.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5961"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 123 East Main Street, in Vergas, Minnesota, as the \"Jon Glawe Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": " This act designates the facility of the United States Postal Service located at 123 East Main Street, in Vergas, Minnesota, as the Jon Glawe Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5952"
      }
    },
    {
      "billData": {
        "title": "To designate the outpatient clinic of the Department of Veterans Affairs in Greenville, South Carolina, as the \"Lance Corporal Dana Cornell Darnell VA Clinic\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the outpatient clinic of the Department of Veterans Affairs in Greenville, South Carolina, as the Lance Corporal Dana Cornell Darnell VA Clinic.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5943"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \"Marine Corps Reserve PVT Jacob Cruz Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the Marine Corps Reserve PVT Jacob Cruz Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5900"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 4110 Bluebonnet Drive in Stafford, Texas, as the \"Leonard Scarcella Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 4110 Bluebonnet Drive in Stafford, Texas, as the Leonard Scarcella Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5865"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 850 Walnut Street in McKeesport, Pennsylvania, as the First Sergeant Leonard A. Funk, Jr. Post Office Building.",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 850 Walnut Street in McKeesport, Pennsylvania, as the First Sergeant Leonard A. Funk, Jr. Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5794"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 1961 North C Street in Oxnard, California, as the \"John R. Hatcher III Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 1961 North C Street in Oxnard, California, as the John R. Hatcher III Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5659"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 16605 East Avenue of the Fountains in Fountain Hills, Arizona, as the \"Dr. C.T. Wright Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 16605 East Avenue of the Fountains in Fountain Hills, Arizona, as the Dr. C.T. Wright Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5650"
      }
    },
    {
      "billData": {
        "title": "FLOODS Act",
        "date": "2022-12-27"
      },
      "billSummary": "Flood Level Observation, Operations, and Decision Support Act or the FLOODS Act This act addresses forecasting and the communication of flood, tornado, and hurricane events by the National Oceanic and Atmospheric Administration (NOAA). For example, the act directs NOAA to establish a National Integrated Flood Information System to inform and provide for timely decisions to reduce flood-related effects and costs. NOAA must also establish partnerships with institutions of higher education and federal agencies to improve total water predictions. In addition, NOAA must (1) evaluate and improve flash flood watches and warnings, (2) estimate and communicate the frequency of precipitation, and (3) identify gaps in the availability of snow-related data to assess and predict floods and flood impacts. Further, NOAA must ensure that the tornado warning improvement and extension program periodically examines the value of incorporating innovative observations, such as acoustic or infrasonic measurements, observations from phased array radars, and observations from mesonets (i.e., a network of certain weather observing stations). In addition, the National Weather Service must designate a service coordination hydrologist at each of its River Forecast Centers to increase impact-based decision support services at the state and local level. Finally, the act establishes an Interagency Committee on Water Management and Infrastructure to ensure that federal agencies that engage in water-related matters work together where such agencies have joint or overlapping responsibilities.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "558"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 1550 State Road S-38-211 in Orangeburg, South Carolina, as the \"J.I. Washington Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 1550 State Road S-38-211 in Orangeburg, South Carolina, as the J.I. Washington Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5349"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 2245 Rosa L Parks Boulevard in Nashville, Tennessee, as the \"Thelma Harper Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 2245 Rosa L Parks Boulevard in Nashville, Tennessee, as the Thelma Harper Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "5271"
      }
    },
    {
      "billData": {
        "title": "Billy's Law",
        "date": "2022-12-27"
      },
      "billSummary": "Billy's Law or the Help Find the Missing Act This act provides statutory authority for the Department of Justice (DOJ) to maintain the National Missing and Unidentified Persons System (NamUs) consistent with its existing purpose and structure. NamUs is a national information clearinghouse and resource center for cases involving missing persons and unidentified or unclaimed remains. NamUs is administered by the National Institute of Justice within DOJ. The act also establishes new requirements. First, it requires a law enforcement agency that submits a missing child report to the National Crime Information Center (NCIC) to also submit the missing child report to NamUs. The NCIC is a computerized index of criminal justice data and files for reports of missing and unidentified persons. Current law requires law enforcement agencies to submit missing child reports to the NCIC database but not to the NamUs databases. Second, the act establishes requirements to facilitate data sharing between the NCIC database and the NamUs databases with respect to missing and unidentified persons. Specifically, the act requires DOJ to give the National Institute of Justice access to the NCIC missing person and unidentified person records for the purpose of validating cases and reconciling data with NamUs.  Additionally, the act requires DOJ to assess the NCIC and NamUs systems and governing statutes, policies, and procedures and create a plan for NCIC to automatically transmit certain records to NamUs. Third, the act requires DOJ to report to forensic medicine service providers and law enforcement agencies on best practices for collecting, reporting, and analyzing data and information on missing persons and unidentified human remains. DOJ must also report to Congress biennially on the status of the NCIC database and the NamUs databases. The report must describe the process of information sharing between the NCIC database and NamUs databases.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5230"
      }
    },
    {
      "billData": {
        "title": "A bill to direct the Joint Committee of Congress on the Library to remove the bust of Roger Brooke Taney in the Old Supreme Court Chamber of the Capitol and to obtain a bust of Thurgood Marshall for installation in the Capitol or on the Capitol Grounds, and for other purposes.",
        "date": "2022-12-27"
      },
      "billSummary": "This act directs the Joint Committee on the Library to remove the bust of Roger Brooke Taney in the Old Supreme Court chamber of the Capitol and install a bust of Thurgood Marshall in a prominent location in the Capitol or on the Capitol Grounds. In determining the location for the permanent installation of the bust of Thurgood Marshall, the committee shall give priority to identifying an appropriate location near the Old Supreme Court Chamber of the Capitol.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5229"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 10 Broadway Street West, in Akeley, Minnesota, as the \"Neal Kenneth Todd Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 10 Broadway Street West, in Akeley, Minnesota, as the Neal Kenneth Todd Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4899"
      }
    },
    {
      "billData": {
        "title": "Old Pascua Community Land Acquisition Act",
        "date": "2022-12-27"
      },
      "billSummary": "Old Pascua Community Land Acquisition Act This act directs the Department of the Interior to take tribally owned lands in Pima County, Arizona, into trust for the benefit of the Pascua Yaqui Tribe of Arizona. Lands taken into trust shall be part of the Pascua Yaqui Reservation. The act allows gaming on the land taken into trust.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4881"
      }
    },
    {
      "billData": {
        "title": "Blackwater Trading Post Land Transfer Act",
        "date": "2022-12-27"
      },
      "billSummary": "Blackwater Trading Post Land Transfer Act This act directs the Department of the Interior to take the approximately 55.3 acres of land of the Blackwater Trading Post in Pinal County, Arizona, into trust for the benefit of the Gila River Indian Community, if the community conveys to Interior all of its interest in the land. The land is made part of the community's reservation.  Further, the act prohibits gaming on the land taken into trust.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "478"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 226 North Main Street in Roseville, Ohio, as the Ronald E. Rosser Post Office.",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 226 North Main Street in Roseville, Ohio, as the Ronald E. Rosser Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4622"
      }
    },
    {
      "billData": {
        "title": "Don Young Alaska Native Health Care Land Transfers Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Don Young Alaska Native Health Care Land Transfers Act of 2022 This act directs the Department of Health and Human Services (HHS) to convey specified property in Alaska to certain nonprofit entities that support Alaska Native communities. Specifically, HHS must convey specified property in (1) Tanana, Alaska, to the Tanana Tribal Council for use in connection with health and social services programs; (2) Sitka, Alaska, to the Southeast Alaska Regional Health Consortium for use in connection with health and social services programs; and (3) Anchorage, Alaska, to the Alaska Native Tribal Health Consortium for use in connection with health programs.  These conveyances shall not require any consideration from, or impose any obligation, term, or condition on, the consortia or council or allow for any U.S. reversionary interest in the property.  The consortia or council shall not be liable for any environmental contamination that occurred before these conveyances.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "441"
      }
    },
    {
      "billData": {
        "title": "War Crimes Rewards Expansion Act",
        "date": "2022-12-27"
      },
      "billSummary": "War Crimes Rewards Expansion Act This act expands the Department of State's rewards program to authorize rewards for providing information leading to the arrest, conviction, or transfer of a foreign national accused of war crimes, crimes against humanity, or genocide as such crimes are defined under the law of an international criminal tribunal, the applicable country, or the United States. Currently, rewards are authorized for information leading to the arrest, conviction, or transfer of a foreign national accused of such crimes only as defined under the statutes of the relevant tribunal.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4250"
      }
    },
    {
      "billData": {
        "title": "Law Enforcement De-Escalation Training Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Law Enforcement De-Escalation Training Act of 2022 This act directs the Department of Justice (DOJ) to develop scenario-based training curricula (or identify existing curricula) that includes topics such as alternatives to the use of force, de-escalation tactics, and safely responding to an individual experiencing a mental, behavioral health, or suicidal crisis. The act also directs DOJ to make grants to states for costs associated with providing the training to law enforcement officers or mental health professionals.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4003"
      }
    },
    {
      "billData": {
        "title": "Preventing Organizational Conflicts of Interest in Federal Acquisition Act",
        "date": "2022-12-27"
      },
      "billSummary": "Preventing Organizational Conflicts of Interest in Federal Acquisition Act This act addresses conflicts of interest in federal acquisitions. Specifically, the act directs the Federal Acquisition Regulatory Council to revise the Federal Acquisition Regulation (FAR) to provide and update  definitions related to specific types of organizational conflicts of interest; definitions, guidance, and illustrative examples related to relationships of contractors with public, private, domestic, and foreign entities that may cause contract support to be subject to potential organizational conflicts; and illustrative examples of situations related to the potential organizational conflicts identified.  Further, the council must revise the FAR to  provide executive agencies with solicitation provisions and contract clauses to avoid or mitigate organizational conflicts, for agency use as needed, that require contractors to disclose information relevant to potential organizational conflicts and limit future contracting with respect to potential conflicts with the work to be performed under awarded contracts; allow agencies to tailor such solicitation provisions and contract clauses as necessary to address risks associated with conflicts of interest and other considerations that may be unique to the agency;  require agencies to establish or update agency conflict of interest procedures to implement the revisions to the FAR made under this act and periodically assess and update such procedures as needed to address agency-specific conflict issues; and  update FAR procedures to permit contracting officers to take into consideration professional standards and procedures to prevent organizational conflicts of interest to which an offeror or contractor is subject.  ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3905"
      }
    },
    {
      "billData": {
        "title": "Justice and Mental Health Collaboration Reauthorization Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Justice and Mental Health Collaboration Reauthorization Act of 2022 This act expands the allowable use of grants under the Justice and Mental Health Collaboration Program. The program provides state, local, and tribal grants to improve the criminal justice system's response to people with mental health disorders. Among the provisions, the act  allows funds for diversion and alternative prosecution and sentencing programs to be used for training for state and local prosecutors related to diversion programs; allows funds for multidisciplinary teams to be used to support police officers and mental health crisis workers responding together to mental health calls; and  allows grants to be awarded for additional purposes such as suicide prevention programs and services, case management services, and state and local implementation of the 988 suicide hotline.    Additionally, the act reauthorizes through FY2027 the requirement for the Department of Justice to examine and report on the prevalence of mentally ill offenders in prisons and jails.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3846"
      }
    },
    {
      "billData": {
        "title": "21st Century President Act",
        "date": "2022-12-27"
      },
      "billSummary": "21st Century President Act This act revises the definition of immediate family for purposes of a criminal offense involving a threat to kill, kidnap, or inflict bodily harm on a former President or a member of the immediate family of a former President. Specifically, it replaces gender-specific references to a former President's wife and widow with the gender-neutral terms spouse and surviving spouse.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3285"
      }
    },
    {
      "billData": {
        "title": "Countering Human Trafficking Act of 2021",
        "date": "2022-12-27"
      },
      "billSummary": "Countering Human Trafficking Act of 2021 This act provides statutory authority for the Center for Countering Human Trafficking (CCHT) within the Department of Homeland Security (DHS). The CCHT coordinates DHS efforts to combat human trafficking and the importation of goods produced with forced labor. The act requires the CCHT to develop a strategy to improve the systems and processes used throughout DHS to combat human trafficking and the importation of goods produced with forced labor. The act transfers the functions and resources of the Blue Campaign (i.e., the national public awareness effort to combat human trafficking) to the CCHT. DHS may also transfer to the CCHT any other component, directorate, or office of the department related to combating human trafficking.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2991"
      }
    },
    {
      "billData": {
        "title": "Prison Camera Reform Act of 2021",
        "date": "2022-12-27"
      },
      "billSummary": "Prison Camera Reform Act of 2021 This act establishes various requirements to ensure that the security camera, radio, and public address systems used by the Bureau of Prisons (BOP) have the capabilities necessary to (1) ensure the health and safety of staff and inmates; and (2) ensure the documentation and accessibility of video evidence pertaining to misconduct, maltreatment, or criminal activity within correctional facilities.  Among the requirements, the BOP must evaluate the systems currently in use at its facilities and implement a plan that addresses deficiencies in and makes upgrades to the systems. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2899"
      }
    },
    {
      "billData": {
        "title": "VA Peer Support Enhancement for MST Survivors Act",
        "date": "2022-12-27"
      },
      "billSummary": "This act prescribes that a peer support specialist of the Department of Veterans Affairs (VA) must not be responsible for providing assistance to a veteran regarding a claim for compensation for a covered mental health condition (e.g., post-traumatic stress disorder) based on military sexual trauma (MST) experienced during active service. Such specialists must only provide counseling services, guidance, and support and must not participate in the adjudication of the claim. As part of the forms for claims for compensation for a covered mental health condition based on MST, the VA must include an option for a veteran to elect to be referred to a MST trauma coordinator at the VA facility closest to the veteran's residence. Additionally, the VA must (1) ensure that its peer support specialists receive annual training on providing peer support regarding MST, and (2) provide annual training on the processing of claims for compensation for covered mental health conditions based on MST to its MST coordinators and peer specialists. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2724"
      }
    },
    {
      "billData": {
        "title": "Iran Hostages Congressional Gold Medal Act",
        "date": "2022-12-27"
      },
      "billSummary": "Iran Hostages Congressional Gold Medal Act This bill provides for the award of a Congressional Gold Medal to the 53 hostages of the Iran Hostage Crisis (November 4, 1979-January 21, 1981) in recognition of their bravery and endurance throughout their captivity.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2607"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 275 Penn Avenue in Salem, Ohio, as the \"Howard Arthur Tibbs Post Office\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 275 Penn Avenue in Salem, Ohio, as the Howard Arthur Tibbs Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2473"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 82422 Cadiz Jewett Road in Cadiz, Ohio, as the John Armor Bingham Post Office.",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 82422 Cadiz Jewett Road in Cadiz, Ohio, as the John Armor Bingham Post Office.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2472"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "203"
      }
    },
    {
      "billData": {
        "title": "Small Business Cyber Training Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Small Business Cyber Training Act of 2022 This bill requires the Small Business Administration to establish a program for certifying at least 5 or 10% of the total number of employees of a small business development center to provide cybersecurity planning assistance to small businesses.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1687"
      }
    },
    {
      "billData": {
        "title": "Saline Lake Ecosystems in the Great Basin States Program Act of 2022",
        "date": "2022-12-27"
      },
      "billSummary": "Saline Lake Ecosystems in the Great Basin States Program Act of 2022 This act requires the U.S. Geological Survey (USGS) to establish a Saline Lake Ecosystems in the Great Basin States Assessment and Monitoring Program. Under the program, the USGS must assess, monitor, and conserve saline lake ecosystems in the Great Basin as well as the wildlife that depend on those ecosystems.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1466"
      }
    },
    {
      "billData": {
        "title": "To designate the facility of the United States Postal Service located at 101 South Willowbrook Avenue in Compton, California, as the \"PFC James Anderson, Jr., Post Office Building\".",
        "date": "2022-12-27"
      },
      "billSummary": "This act designates the facility of the United States Postal Service located at 101 South Willowbrook Avenue in Compton, California, as the PFC James Anderson, Jr., Post Office Building.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1095"
      }
    },
    {
      "billData": {
        "title": "Jordan McNair Student-Athlete Heat Fatality Prevention Act",
        "date": "2022-12-27"
      },
      "billSummary": "Jordan McNair Student-Athlete Heat Fatality Prevention Act This bill requires each institution of higher education that participates in federal student-aid programs and is a member of an athletic association or athletic conference to develop and implement a venue-specific heat emergency action plan for operating and using automatic external defibrillators and cold-water immersion equipment.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9698"
      }
    },
    {
      "billData": {
        "title": "Impeaching Joseph R. Biden.",
        "date": "2022-12-27"
      },
      "billSummary": "This resolution impeaches President Biden for treason and other high crimes and misdemeanors. The resolution alleges a variety of offenses ranging from the way he managed the withdrawal of the U.S. military from Afghanistan, to his handling of migrants on the border, to shielding his son from prosecution.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1532"
      }
    },
    {
      "billData": {
        "title": "Platform Integrity Act",
        "date": "2022-12-27"
      },
      "billSummary": "Platform Integrity Act   This bill specifies that providers and users of interactive computer services (e.g., social media) may be held liable for third-party content if they promote or otherwise recommend the content.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9695"
      }
    },
    {
      "billData": {
        "title": "To prohibit the use of funds to provide United States military support for the Saudi-led military intervention in Yemen, and for other purposes.",
        "date": "2022-12-27"
      },
      "billSummary": "This bill prohibits the Department of Defense from using funds to provide specified support to the Saudi-led coalition operations against the Houthis in Yemen.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9697"
      }
    },
    {
      "billData": {
        "title": "To direct the Secretary of Defense to provide certain resources to implement the Department of Defense policy on civilian harm in connection with United States military operations, and for other purposes.",
        "date": "2022-12-27"
      },
      "billSummary": "This bill requires the Department of Defense to assign personnel to specified offices and commands to be responsible for providing guidance related to the prevention of harm to civilians.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9696"
      }
    },
    {
      "billData": {
        "title": "Blocked Rail Crossings Safety Improvement Act of 2021",
        "date": "2022-12-26"
      },
      "billSummary": "Blocked Rail Crossings Safety Improvement Act of 2021 This bill addresses safety and congestion along railroad right-of-way and highway-rail grade crossings. For example, the bill directs the Department of Transportation (DOT) to provide grants to (1) assist state, local, and tribal governments in funding the cost of highway-rail grade crossing separation projects; and (2) help nonprofit organizations carry out public information and education programs to help prevent and reduce rail-related pedestrian, motor vehicle, and other incidents, injuries, and fatalities, and to improve awareness along railroad right-of-way and at highway-rail grade crossings. Additionally, the bill prohibits railroad carriers from obstructing travel at public highway-rail crossings for more than 10 minutes, except under limited circumstances (e.g., safety issues). Further, DOT must (1) establish a national blocked crossings database for the public to report blocked crossing incidents; (2) conduct a comprehensive review of the national highway-rail crossing inventory; and (3) revise its regulations, guidance, or other relevant agency documents to include the number of suicides on a railroad crossing or railroad right-of-way in the total number of rail fatalities it reports each year.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9690"
      }
    },
    {
      "billData": {
        "title": "James M. Inhofe National Defense Authorization Act for Fiscal Year 2023",
        "date": "2022-12-23"
      },
      "billSummary": "test ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7776"
      }
    },
    {
      "billData": {
        "title": "Further Additional Continuing Appropriations and Extensions Act, 2023",
        "date": "2022-12-23"
      },
      "billSummary": "Further Additional Continuing Appropriations and Extensions Act, 2023 This act provides continuing FY2023 appropriations to federal agencies through December 30, 2022, and extends several expiring programs and authorities. DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2023 Further Additional Continuing Appropriations Act, 2023 This division provides continuing FY2023 appropriations to federal agencies through the earlier of December 30, 2022, or the enactment of the applicable appropriations act. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2023 appropriations bills have not been enacted when the existing CR expires on December 23, 2022.  The CR funds most programs and activities at the FY2022 levels. It also extends several exceptions that provide funding flexibility or additional appropriations for various programs. DIVISION B--OTHER MATTERS TITLE I--EXTENSIONS This title extends several expiring programs and authorities through December 30, 2022. (Sec. 101) This section extends the authority of the Federal Communications Commission to conduct auctions for electromagnetic spectrum licenses. (Sec. 102) This section extends a special assessment on nonindigent persons or entities convicted of certain offenses involving sexual abuse or human trafficking. The assessment funds programs for human-trafficking survivors. United States Parole Commission Further Extension Act of 2022 (Sec. 103) This section extends the U.S. Parole Commission. (Sec. 104) This section extends the Commodity Futures Trading Commission Customer Protection Fund expenses account. (Sec. 105) This section extends provisions that prohibit the Indian Health Service from disbursing funds to Alaska Native villages or corporations that are located in areas served by Alaska Native regional health entities. TITLE II--BUDGETARY EFFECTS This title exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4373"
      }
    },
    {
      "billData": {
        "title": "Aviation Funding Stability Act of 2021",
        "date": "2022-12-23"
      },
      "billSummary": "Aviation Funding Stability Act of 2021 This bill provides continuing appropriations to the Federal Aviation Administration (FAA) from the Airport and Airway Trust Fund if an appropriations bill for the FAA has not been enacted before a fiscal year begins or a joint resolution making continuing appropriations for the FAA is not in effect.  The bill provides appropriations at the rate of operations that was provided for the prior fiscal year to continue programs, projects, and activities for which funds were provided in the preceding fiscal year. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "4042"
      }
    },
    {
      "billData": {
        "title": "Black Lung Benefits Improvement Act of 2022",
        "date": "2022-12-23"
      },
      "billSummary": "Black Lung Benefits Improvement Act of 2022 This bill revises requirements for miners' claims for pneumoconiosis (black lung disease) benefits. Specifically, the bill requires the Department of Labor to  pay the attorneys' fees of specified parties on a qualifying benefit claim,  give a claimant the opportunity to substantiate a claim for benefits through a pulmonary evaluation, authorize a CT (computerized tomography) scan in diagnosing complicated pneumoconiosis, and develop a strategy to reduce delays in adjudication of black lung disease benefits claims.  The bill also establishes criteria that a mining operator must meet to self-insure against claims and increases from $1,000 to $25,000 the daily penalty amount that may be assessed against a mining operator that fails to make black lung benefits payments. The bill authorizes (1) black lung disease clinics to use federal funds to help individuals file claims, and (2) certain previously denied claimants to file a new claim for black lung disease benefits within one year. The bill prohibits a person from (1) knowingly and willfully making a false statement or misrepresentation in increasing or reducing black lung disease benefits, or (2) threatening or misleading a participant in a proceeding regarding such benefits. Further, the bill revises (1) the standards of medical evidence that establish a presumption that a miner is totally disabled by black lung disease, and (2) payments to such miners. Lastly, the bill provides statutory authority for the Office of Workers' Compensation Programs.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "6102"
      }
    },
    {
      "billData": {
        "title": "A concurrent resolution providing for a correction in the enrollment of H.R. 4373.",
        "date": "2022-12-23"
      },
      "billSummary": "This concurrent resolution makes a correction to the official title of H.R. 4373 (Further Additional Continuing Appropriations and Extensions Act, 2023).",
      "billRequestData": {
        "congress": "117",
        "billType": "sconres",
        "billNumber": "52"
      }
    },
    {
      "billData": {
        "title": "A concurrent resolution providing for a correction in the enrollment of H.R. 2617.",
        "date": "2022-12-23"
      },
      "billSummary": "This concurrent resolution amends the official title of, and makes other changes to, H.R. 2617 (Consolidated Appropriations Act, 2023).",
      "billRequestData": {
        "congress": "117",
        "billType": "sconres",
        "billNumber": "51"
      }
    },
    {
      "billData": {
        "title": "Condemning the atrocities that occurred in Atlanta, Georgia, in 1906, in which White supremacist mobs brutalized, terrorized, and killed dozens of Black Americans, and reaffirming the commitment of the House of Representatives to combating hatred, injustice, and White supremacy.",
        "date": "2022-12-23"
      },
      "billSummary": "This resolution condemns the actions of a White supremacist mob that drove Black residents out of Atlanta, Georgia in 1906 and supports the designation of a national day of remembrance for the victims of forced migrations of Black Americans.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1382"
      }
    },
    {
      "billData": {
        "title": "Promoting awareness of motorcyclist profiling and encouraging collaboration and communication with the motorcycle community and law enforcement officials to prevent instances of profiling.",
        "date": "2022-12-23"
      },
      "billSummary": "This resolution promotes increased public awareness of motorcyclist profiling. The resolution also encourages the motorcyclist community and law enforcement to collaborate and communicate on efforts to end motorcyclist profiling.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "366"
      }
    },
    {
      "billData": {
        "title": "Providing for consideration of the Senate amendment to the House amendment to the Senate amendment to the bill (H.R. 2617) to amend section 1115 of title 31, United States Code, to amend the description of how performance goals are achieved, and for other purposes; relating to consideration of the Senate amendment to the bill (H.R. 4373) making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2022, and for other purposes; relating to consideration of the Senate amendments to the bill (H.R. 1082) to prohibit the unauthorized sale of ride-hailing signage and study the incidence of fatal and non-fatal assaults in TNC and for-hire vehicles in order to enhance safety and save lives; and for other purposes.",
        "date": "2022-12-23"
      },
      "billSummary": "This resolution sets forth the rule for consideration of H.R. 2617, H.R. 4373, and H.R. 1082.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1531"
      }
    },
    {
      "billData": {
        "title": "Justice for the Living Victims of Lockerbie Act",
        "date": "2022-12-23"
      },
      "billSummary": "Justice for the Living Victims of Lockerbie Act This bill establishes a mechanism for compensating certain victims of the bombing of Pan American Flight 103 over Lockerbie, Scotland, on December 21, 1988. Specifically, the Department of the Treasury must establish a fund to compensate qualifying victims of the bombing (generally, former employees of Pan American who were part of an earlier lawsuit seeking compensation from Libya for the bombing). The Foreign Claims Settlement Commission must establish a process for claimants to apply for compensation from the fund.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5357"
      }
    },
    {
      "billData": {
        "title": "Save Our Seas 2.0 Amendments Act",
        "date": "2022-12-23"
      },
      "billSummary": "Save Our Seas 2.0 Amendments Act This bill revises provisions governing the administration of the Marine Debris Foundation and the Marine Debris Program. Specifically, the bill allows the foundation to use appropriated funds for employee salaries for the two years following the bill's enactment. The bill also allows the foundation to locate its principal office outside of the District of Columbia and encourages the foundation to locate it in a coastal state. In addition, the bill requires the foundation to develop best practices for conducting outreach to Indian tribes. The bill also requires the National Oceanic and Atmospheric Administration (NOAA) to approve appointments to the foundation's board of directors. NOAA may enter into other agreements, outside of contracts, under the Marine Debris Program. NOAA may also make in-kind contributions for projects under the program.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4321"
      }
    },
    {
      "billData": {
        "title": "Supply Chain Disruptions Relief Act",
        "date": "2022-12-23"
      },
      "billSummary": "Supply Chain Disruptions Relief Act This bill modifies the treatment of liquidations of new motor vehicle inventory as qualified LIFO (last in first out accounting method) inventory. It allows new motor vehicle dealers to elect to wait until the end of 2025 to replace their inventory for purposes of determining income attributable to the sale of such inventory during 2020 and 2021.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4105"
      }
    },
    {
      "billData": {
        "title": "A bill to designate the outdoor amphitheater at the Blue Ridge Music Center in Galax, Virginia, as the \"Rock Boucher Amphitheater\".",
        "date": "2022-12-23"
      },
      "billSummary": "This bill designates the outdoor amphitheater at the Blue Ridge Music Center, located at 700 Foothills Road in Galax, Virginia, as the Rick Boucher Amphitheater.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3873"
      }
    },
    {
      "billData": {
        "title": "A bill to require the Secretary of Energy to establish a Nuclear Fuel Security Program, expand the American Assured Fuel Supply Program, and submit a report on a civil nuclear credit program, and for other purposes.",
        "date": "2022-12-23"
      },
      "billSummary": "Fission for the Future Act  This bill establishes new programs and expands existing programs to increase domestic supplies of certain types of low-enriched uranium.  First, the Department of Energy (DOE) must establish a program to increase the production of certain types of low-enriched uranium by U.S. nuclear energy companies.  Second, DOE must expand the existing American Assured Fuel Supply Program to ensure the availability of certain types of domestically produced uranium in the event of a supply disruption.  Third, DOE must establish a demonstration program to make certain types of low-enriched uranium available from its inventories, stockpiles, or allies to meet the needs and schedules of advanced nuclear reactor developers until such time that commercial enrichment and deconversion capability for the uranium exists in the United States at a scale sufficient to meet future needs. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3428"
      }
    },
    {
      "billData": {
        "title": "Root and Stem Project Authorization Act of 2022",
        "date": "2022-12-23"
      },
      "billSummary": "Root and Stem Project Authorization Act of 2022 This bill authorizes the Forest Service and the Bureau of Land Management (BLM) to conduct certain forest restoration projects. Specifically, the Forest Service or BLM may enter into an agreement for a project on federal land that was developed through a collaborative process that meets local and rural community needs if    the party with whom it enters into an agreement initially provides the Forest Service or BLM with a portion of the funding necessary to complete any analysis deemed necessary under federal law for consideration of the proposed project; the Forest Service or BLM uses the funding to pay a contractor included on a list of contractors that it maintains to conduct the analysis;  upon completion of the analysis, the Forest Service or BLM solicits bids to carry out the project and enters into a contract or agreement under the Healthy Forests Restoration Act of 2003 to carry out the project; and using certain receipts from the project, the Forest Service or BLM repays the initially provided funding.  For purposes of a civil action relating to such a project, any person that participated in the collaborative process to develop the proposal for the project shall be (1) entitled to intervene, as of right, in any subsequent civil action; and (2) considered to be a full participant in any settlement negotiation relating to the project. The authority to enter into an agreement and the requirement to maintain a list of contractors shall expire on January 1, 2033.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3046"
      }
    },
    {
      "billData": {
        "title": "Land Grant-Mercedes Traditional Use Recognition and Consultation Act",
        "date": "2022-12-23"
      },
      "billSummary": "Land Grant-Mercedes Traditional Use Recognition and Consultation Act  This bill requires the Department of Agriculture (USDA) and the Department of the Interior to issue guidance related to certain community land grants in New Mexico made by Spain or Mexico to individuals, groups, and communities to promote the settlement of the southwestern United States (land grant-mercedes). The guidance shall set forth the policies and procedures for notice and comment on planning decisions, routine engagement, and major federal actions that could impact historical-traditional uses of a qualified land grant-merced.  In developing, maintaining, and revising land management plans and National Forest System land and resource management plans, as applicable, the USDA or Interior shall consider and, as appropriate, provide for and evaluate impacts to historical-traditional uses by qualified land grant-mercedes.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2708"
      }
    },
    {
      "billData": {
        "title": "A bill to amend the Alaska Native Claims Settlement Act to exclude certain payments to aged, blind, or disabled Alaska Natives or descendants of Alaska Natives from being used to determine eligibility or certain programs, and for other purposes.",
        "date": "2022-12-23"
      },
      "billSummary": "This bill excludes certain settlement trust payments to an Alaska Native or descendant of an Alaska Native who is aged, blind, or disabled for purposes of determining the individual's eligibility for need-based federal programs (e.g., the Supplemental Nutrition Assistance Program).",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "2524"
      }
    },
    {
      "billData": {
        "title": "For the relief of Jan van Hoek.",
        "date": "2022-12-23"
      },
      "billSummary": "Provides for the relief of Jan van Hoek.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9694"
      }
    },
    {
      "billData": {
        "title": "Proposing a balanced budget amendment to the Constitution of the United States.",
        "date": "2022-12-23"
      },
      "billSummary": "This joint resolution proposes a constitutional amendment prohibiting total outlays for a fiscal year from exceeding total receipts for that fiscal year or 18.5% of the economic output of the United States. The amendment also requires a cancellation of budget authority that is equal to the amount by which total outlays exceeded these limits during the preceding fiscal year.  The amendment requires a three-fourths roll call vote of each chamber of Congress to increase the public debt limit or increase revenue.  The amendment also requires the President to submit an annual budget in which total outlays do not exceed total receipts.  Congress may waive these requirements due to a declaration of war or a military conflict that causes an imminent and serious military threat to national security. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hjres",
        "billNumber": "106"
      }
    },
    {
      "billData": {
        "title": "Lobbying Disclosure Reform Act of 2022",
        "date": "2022-12-23"
      },
      "billSummary": "Lobbying Disclosure Reform Act of 2022 This bill makes a series of changes to requirements relating to registered lobbyists, including by requiring unique identification numbers for lobbyists, clients, and providers of strategic lobbying services, and by requiring additional disclosures and reporting with respect to such individuals and activities.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9693"
      }
    },
    {
      "billData": {
        "title": "Congressional Budget Office Termination Act",
        "date": "2022-12-23"
      },
      "billSummary": "Congressional Budget Office Termination Act This bill abolishes the Congressional Budget Office. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9692"
      }
    },
    {
      "billData": {
        "title": "Justice For Journalists Act",
        "date": "2022-12-23"
      },
      "billSummary": "Justice For Journalists Act This bill requires the Federal Bureau of Investigation to conduct a criminal investigation of each nonnatural death of a U.S. journalist in a foreign country.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9691"
      }
    },
    {
      "billData": {
        "title": "Uyghur Forced Labor Prevention Act",
        "date": "2022-12-22"
      },
      "billSummary": "Uyghur Forced Labor Prevention Act This bill imposes various restrictions related to China's Xinjiang Uyghur Autonomous Region, including by prohibiting certain imports from Xinjiang and imposing sanctions on those responsible for human rights violations there.  Goods manufactured or produced in Xinjiang shall not be entitled to entry into the United States unless U.S. Customs and Border Protection (1) determines that the goods were not manufactured by convict labor, forced labor, or indentured labor under penal sanctions; and (2) reports such a determination to Congress and to the public. The President shall periodically report to Congress a list of foreign entities and individuals knowingly facilitating (1) the forced labor of Uyghurs, Kazakhs, Kyrgyz, and members of other Muslim minority groups in Xinjiang; and (2) efforts to contravene U.S. laws regarding the importation of forced labor goods from Xinjiang. The President shall impose property-blocking sanctions on the listed individuals and entities and impose visa-blocking sanctions on the listed individuals. Securities issuers required to file annual or quarterly reports with the Securities Exchange Commission shall disclose in such reports instances in which the issuer knowingly engaged in certain activities related to Xinjiang, such as working with an entity building detention facilities or surveillance systems there. After such a disclosure, the President shall determine whether to investigate&nbsp;if sanctions or criminal charges are warranted.  The Forced Labor Enforcement Task Force and the Department of State shall report to Congress strategies to address forced labor in Xinjiang or any other part of China. The State Department shall also report to Congress a determination of whether the treatment of Muslim groups in Xinjiang constitutes crimes against humanity or genocide under U.S. law.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "1155"
      }
    },
    {
      "billData": {
        "title": "Presidential Tax Filings and Audit Transparency Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Presidential Tax Filings and Audit Transparency Act of 2022  This bill requires the Internal Revenue Service (IRS) to conduct an examination to determine the correctness of a Presidential income tax return as rapidly as practicable after it is filed. The IRS must disclose and make publicly available (on the internet) an initial report, periodic reports, and a final report on the examination of such tax returns. The final report must include the date on which the IRS examination of the return was completed, a list of audit materials, and a description of each proposed adjustment to a return and any controversy relating to its examination. This disclosure of tax return information is an exception to the general rule of confidentiality of taxpayer returns.  The bill provides criteria for approving a request for an extension of the filing of a tax return and for failing to file a return within the required time period. The bill defines Presidential income tax return as any relevant income tax return of (1) a president while the president is in office, (2) the spouse of a president, (3) a corporation or partnership controlled by a president or a president's spouse, and (4) the estate of a president or a president's spouse.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9640"
      }
    },
    {
      "billData": {
        "title": "A resolution designating October 30, 2022, as a national day of remembrance for the workers of the nuclear weapons program of the United States.",
        "date": "2022-12-22"
      },
      "billSummary": "This resolution designates October 30, 2022, as a national day of remembrance for the workers of the nuclear weapons program, including uranium miners, millers, and haulers, plutonium processors, and on-site participants at atmospheric nuclear weapons tests.",
      "billRequestData": {
        "congress": "117",
        "billType": "sres",
        "billNumber": "785"
      }
    },
    {
      "billData": {
        "title": "Robert C. Byrd Mine Safety Protection Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Robert C. Byrd Mine Safety Protection Act of 2022 This bill revises requirements governing (1) investigations of mine accidents, (2) miners' rights and protections (e.g., whistle-blower rights and protections), (3) mine health and safety standards, (4) underground coal mines, and (5) health and safety training for miners. The Department of Labor, when investigating coal or other mines, must (1) determine why an accident occurred and whether there were violations of law, mandatory health and safety standards, or other requirements; and (2) make recommendations to avoid a recurrence of an accident. The bill expands Labor's enforcement authority, including by requiring Labor to (1) revoke the approval of mine operators' plans or programs based on certain criteria, and (2) order mine operators to withdraw all persons from a mine until Labor approves a new plan. The bill revises civil and criminal penalties, including by subjecting a mine operator who knowingly violates health or safety standards to a felony punishable by up to five years in prison and a $1 million fine. Underground coal mine operators must implement a communication program to brief miners of current mine conditions and install atmospheric monitoring systems. The bill amends the Occupational Safety and Health Act of 1970 to expand its coverage to government employees and increase civil and criminal penalties for violations of the act. The bill also expands whistle-blower rights and protections against retaliation under the act, establishes employee rights with respect to work-related bodily injuries or death, and establishes procedures for correcting serious, willful, or repeated violations of occupational safety and health standards.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5356"
      }
    },
    {
      "billData": {
        "title": "To amend the Water Infrastructure Finance and Innovation Act of 2014 to establish payment and performance security requirements for projects, and for other purposes.",
        "date": "2022-12-22"
      },
      "billSummary": "This bill establishes bonding requirements for the recipient of a water infrastructure construction loan under the Water Infrastructure Finance and Innovation Act. A borrower must secure the financed project with payment and performance bonds in minimum amounts set out in the bill. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9665"
      }
    },
    {
      "billData": {
        "title": "Aviation WORKS Act",
        "date": "2022-12-22"
      },
      "billSummary": "Aviation Workforce, Opportunity, Recruiting, Knowledge, and Supply Act or the Aviation WORKS Act  This bill extends through FY2028 and expands aviation workforce development programs of the Department of Transportation (DOT). Specifically, the bill directs DOT to establish an aviation manufacturing development grant program to develop the aviation manufacturing and supplier workforce. It also requires DOT to develop and support the education of workers who design or produce any aircraft, aircraft engine, propeller, or appliance, or a component, part, or system thereof, that (1) is produced under a production approval issued by the Federal Aviation Administration (FAA), (2) has been issued a design approval by the FAA, or (3) has an active application for a design approval. Additionally, DOT must establish a program to provide grants for eligible projects to plan, establish, and expand workforce development partnership programs in the aviation and aerospace industry sector.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9662"
      }
    },
    {
      "billData": {
        "title": "Bus Rapid Transit Act",
        "date": "2022-12-22"
      },
      "billSummary": "Bus Rapid Transit Act This bill directs the Federal Transit Administration (FTA) to establish a grant program to provide grants to state, local, and tribal governments for the design and implementation of bus rapid transit systems, including for the redesign, retrofit, renovation, update, and repair of existing bus systems. As a condition of receiving a grant, eligible entities must certify that fares for riding the bus rapid transit system shall not increase solely due to improvements carried out with grant funds and for any reason for at least one year after completion of a project funded by the bill. In carrying out the program, the FTA must prioritize projects located in economically disadvantaged communities.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9648"
      }
    },
    {
      "billData": {
        "title": "Light Rail Transit Act",
        "date": "2022-12-22"
      },
      "billSummary": "Light Rail Transit Act This bill directs the Federal Transit Administration (FTA) to establish a grant program to provide grants to state, local, and tribal governments for the design and implementation of light rail projects, including for the redesign, retrofit, renovation, update, and repair of existing light rail systems. As condition of receiving a grant, eligible entities must certify that fares for riding the light rail transit system shall not increase solely due to improvements carried out with grant funds and for any reason for at least one year after completion of a project funded by the bill. In carrying out the program, the FTA must prioritize projects located in economically disadvantaged communities.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9647"
      }
    },
    {
      "billData": {
        "title": "Disaster Relief Supplemental Appropriations Act, 2023",
        "date": "2022-12-22"
      },
      "billSummary": "Disaster Relief Supplemental Appropriations Act, 2023 This bill provides FY2023 supplemental appropriations to several federal departments and agencies for programs and activities to respond to natural disasters, such as hurricanes, tornadoes, wildfires, and flooding. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5355"
      }
    },
    {
      "billData": {
        "title": "Authorizing the printing of a revised and updated version of the House document entitled \"Black Americans in Congress, 1870-1989\".",
        "date": "2022-12-22"
      },
      "billSummary": "This concurrent resolution requires the printing of a revised and updated version of House Document 101-117, titled Black Americans in Congress, 1870-1989.",
      "billRequestData": {
        "congress": "117",
        "billType": "hconres",
        "billNumber": "82"
      }
    },
    {
      "billData": {
        "title": "ORBITS Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Orbital Sustainability Act of 2022 or the ORBITS Act of 2022 This bill directs specified agencies to take actions to remediate orbital debris (human-made space objects that are no longer in use and can harm orbiting satellites and on-orbit activities). First, the National Aeronautics and Space Administration (NASA) must  publish and periodically update a list of orbital debris that pose the greatest immediate risk of harm to orbiting satellites and on-orbit activities, establish a demonstration program to foster the development of technologies to remediate the orbital debris on the list, and carry out other research and development activities to advance technologies for remediating orbital debris.  NASA (and other relevant agencies) may also contract for remediation services to support the commercial availability of such services. Second, the National Space Council must update the Orbital Debris Mitigation Standard Practices within 90 days of the enactment of the bill and update them periodically thereafter. The updates must address matters including satellite constellations and other planned space systems, collision risks, and disposal of space systems after missions. The updates must inform (1) regulations of other agencies concerning orbital debris, and (2) bilateral and multilateral discussions with other countries concerning certain space activities. Third, the Department of Commerce must facilitate the development of standard practices to coordinate on-orbit space traffic. Upon completion of the practices, Commerce and other federal departments must promote their adoption and use for space missions. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4814"
      }
    },
    {
      "billData": {
        "title": "RARE Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Rare disease Advancement, surveillance Research, and Education Act of 2022 or the RARE Act of 2022 The bill reauthorizes through FY2028 the National Institutes of Health Rare Disease Regional Centers of Excellence and expands activities to facilitate research and increase awareness of rare diseases and conditions. (Rare diseases and conditions are those with a prevalence&nbsp;of fewer than 200,000 individuals in the United States.) The Centers for Disease Control and Prevention may expand infrastructure and activities to track the epidemiology of up to four rare diseases and conditions and incorporate&nbsp;this information into a National Rare Disease or Condition Surveillance System. The Agency for Healthcare Research and Quality must expand its activities to increase health care providers' awareness of rare diseases and conditions. The National Academies of Sciences, Engineering, and Medicine, or another appropriate entity, must update the 2010 report Rare Diseases and Orphan Products: Accelerating Research and Development.  ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9676"
      }
    },
    {
      "billData": {
        "title": "Interstate Teaching Mobility Act",
        "date": "2022-12-22"
      },
      "billSummary": "Interstate Teaching Mobility Act This bill authorizes the Department of Education to establish a voluntary interstate teaching application program for participating states. Under the program, a teacher in a participating state may obtain licensure or certification and apply for an open teaching position in another participating state without completing additional requirements. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9675"
      }
    },
    {
      "billData": {
        "title": "Immersive Technology for the American Workforce Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Immersive Technology for the American Workforce Act of 2022 This bill establishes a grant program to assist community colleges and career and technical schools in developing immersive technology education and workforce training programs.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9674"
      }
    },
    {
      "billData": {
        "title": "To designate a peak in the State of Washington as \"qʷəɬtmáyqn-ʔistiqayuʔ-Mount Cleator\".",
        "date": "2022-12-22"
      },
      "billSummary": "This bill designates a 7,630-foot peak in the Glacier Peak Wilderness in the state of Washington as q&#695;&#601;&#620;tm&aacute;yqn-&#660;istiqayu&#660;-Mount Cleator. The new name includes Wolverine Head written in the languages of the Wenatchi and Sauk-Suiattle peoples.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9673"
      }
    },
    {
      "billData": {
        "title": "Protect Against Terrorist Threats (PATT) Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Protect Against Terrorist Threats (PATT) Act of 2022 This bill expands, for immigration purposes, the definition of engaging in terrorist activity to include threatening, attempting, or conspiring to take certain acts considered to be terrorist activity under current law, such as gathering information on potential targets for terrorist activity.  Currently, non-U.S. nationals (aliens under federal law) who engage in terrorist activity are barred from admission into the United States.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9683"
      }
    },
    {
      "billData": {
        "title": "Assault Weapon Financing Accountability Act",
        "date": "2022-12-22"
      },
      "billSummary": "Assault Weapon Financing Accountability Act This bill makes it a crime to offer or accept certain short-term loans for the purchase of specified semiautomatic assault weapons.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9686"
      }
    },
    {
      "billData": {
        "title": "Recognizing the 50th Anniversary of the National Minority Supplier Development Council.",
        "date": "2022-12-22"
      },
      "billSummary": "This resolution recognizes the 50th anniversary of the National Minority Supplier Development Council.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1530"
      }
    },
    {
      "billData": {
        "title": "Medical Innovation Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Medical Innovation Act of 2022 This bill requires certain drug manufacturers to make payments to fund research supported by the Food and Drug Administration (FDA) and the National Institutes of Health (NIH). A drug manufacturer with over $1 billion in net income in a fiscal year that has entered into a relevant settlement agreement regarding specified violations must pay 0.75%-1.5% of its net income to the Department of Health and Human Services for each of its covered blockbuster drugs. A covered blockbuster drug is a drug that has at least $1 billion in net sales in a year and was developed, in whole or in part, through federal investments in medical research. Payments are divided between the FDA and the NIH in proportion to the discretionary funding of those agencies, excluding FDA user fees. Payments are not disbursed if appropriations for the FDA or the NIH are lower than in the prior fiscal year. Priorities for payments must include advancing regulatory science for medical products and research related to diseases that disproportionately account for federal health care spending. A covered blockbuster drug for which a manufacturer has not made a required payment is considered misbranded and subject to prohibitions on introducing or receiving misbranded drugs in interstate commerce. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9687"
      }
    },
    {
      "billData": {
        "title": "Low-Income Tax Clinic Modernization Act",
        "date": "2022-12-22"
      },
      "billSummary": " Low-Income Tax Clinic Modernization Act  This bill modifies provisions relating to clinics that provide free representation to low-income taxpayers in tax controversies before the Internal Revenue Service (IRS). It expands the definition of low-income taxpayer clinics to require clinics to provide technical advice and litigation support for its programs. The bill also increases the aggregate amount that the IRS may allocate for grants to such clinics and the annual amount of such grants.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9677"
      }
    },
    {
      "billData": {
        "title": "People Over Long Lines Act (POLL Act)",
        "date": "2022-12-22"
      },
      "billSummary": " People Over Long Lines Act (POLL Act) This bill sets forth provisions related to voting and the administration of federal elections. Specifically, the bill requires states to ensure that voters wait no more than 30 minutes at any polling place to cast their vote in a federal election, establishes a private right of action for voters who experience longer waiting times, and directs the Election Assistance Commission to make payments to eligible states to prevent unreasonable waiting times. Next, the bill requires each state to provide for the minimum required number of voting systems, poll workers, and other election resources for each polling location on the day of any federal election and each day of early voting. The Department of Justice must issue uniform standards regarding the minimum number and distribution of such systems, workers, and other resources.  The bill also prohibits a chief state election administration official from taking an active part in political management or in a political campaign with respect to any federal election over which the official has supervisory authority, with certain exceptions.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9688"
      }
    },
    {
      "billData": {
        "title": "Earth Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Earth Act of 2022 This bill addresses climate change by establishing requirements concerning renewable energy, zero emission vehicles, regenerative agriculture, and tax incentives related to climate transition costs. Specifically, the bill requires that by 2030, 100% of   electricity sold by certain retail electric suppliers must be from renewable energy resources (e.g., wind energy); new motor vehicles (e.g., certain cars and trucks) sold by manufacturers must be zero emission vehicles; land and livestock managed by certain publicly-traded corporations must be managed with regenerative agricultural practices.  The Department of Energy (DOE), the Department of Transportation, and the Department of Agriculture (USDA) must create grants to pay up to 50% of the costs of meeting those requirements. DOE must also issue regulations regarding the sourcing, recycling, and disposal of materials used to manufacture renewable energy sources (e.g., equipment that stores renewable energy). The goals of the regulations must be to (1) eliminate the use of rare earth metals in the manufacture of those sources, and (2) ensure the recycling of all such materials. USDA must issue regulations that (1) require the reduction of greenhouse gas emissions resulting from certain land or livestock corporations, and (2) ensure the well-being of animals raised for human consumption or the production of dairy products. The bill also provides tax incentives for electric suppliers, vehicle manufacturers, and such corporations to meet the requirements established by this bill by allowing them to double certain tax deductions for qualified capital climate transitions costs.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9678"
      }
    },
    {
      "billData": {
        "title": "Stateless Protection Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Stateless Protection Act of 2022 This bill provides protections for stateless persons (a person who is not considered a national of any state by that state's law). For example, the bill establishes stateless protected status, which shall provide protections against deportation and other benefits to certain stateless persons present in the United States who meet certain criteria.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9671"
      }
    },
    {
      "billData": {
        "title": "HEAL Act",
        "date": "2022-12-22"
      },
      "billSummary": "Holocaust Education and Antisemitism Lessons Act or the HEAL Act This bill directs the Institute of Education Sciences to study and report on Holocaust education efforts in public elementary and secondary schools. Among other elements, the study must (1) identify the states and local educational agencies that require (and those that do not require) Holocaust education as part of the curriculum taught in public elementary and secondary schools, (2) assess the quality of Holocaust education provided by schools, and (3) assess the types and quality of instructional material used to teach students about the Holocaust.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9681"
      }
    },
    {
      "billData": {
        "title": "Farmers Feeding Families Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Farmers Feeding Families Act of 2022 This bill amends The Emergency Food Assistance Program (TEFAP) to authorize the Food and Nutrition Service (FNS) to provide funds for states to purchase priority agricultural products (e.g., fruits, vegetables, meats, and grains) from eligible small businesses and distribute them to needy persons through emergency feeding organizations. New farmers and small or mid-sized family farms qualify as eligible small businesses under this FNS program, as well as packers, distributors, cooperatives, and others that source agricultural products from them. The bill also requires a state's TEFAP plan eligibility standards to include, at a minimum, all individuals or households with an income less than 250% of the poverty line.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9672"
      }
    },
    {
      "billData": {
        "title": "Refugee Protection Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Refugee Protection Act of 2022 This bill modifies provisions related to asylum seekers and addresses related issues.  For example, the bill (1) eliminates the statutory time limit for applying for asylum (currently one year after arriving in the United States), (2) establishes stateless protected status for individuals who are not considered a national by any country under that country&rsquo;s law, and (3) requires the goal for refugee admissions for any given fiscal year to be no fewer than 125,000.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9685"
      }
    },
    {
      "billData": {
        "title": "Medical Cannabis Research Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Medical Cannabis Research Act of 2022 This bill establishes a new, separate registration process for manufacturers of cannabis for research. As a part of this process, the Drug Enforcement Administration must annually assess whether there is an adequate and uninterrupted supply of research cannabis and register additional manufacturers. The bill also authorizes health care providers of the Department of Veterans Affairs to provide information to veterans regarding participation in federally approved cannabis clinical trials.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9679"
      }
    },
    {
      "billData": {
        "title": "Amateur Radio Emergency Preparedness Act",
        "date": "2022-12-22"
      },
      "billSummary": "Amateur Radio Emergency Preparedness Act This bill limits the adoption and enforcement of private land use restrictions (e.g., rules of a homeowners' association) that prohibit or impair the installation, operation, or maintenance of an amateur station antenna on property controlled by an amateur radio operator.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9670"
      }
    },
    {
      "billData": {
        "title": "To amend the Internal Revenue Code to establish a flat tax, and for other purposes.",
        "date": "2022-12-22"
      },
      "billSummary": "This bill imposes a 15% flat tax on the taxable income of each individual taxpayer. It defines taxable income as the excess of the sum of wages, taxable retirement distributions, plus unemployment compensation, over the standard deduction. The bill also imposes a 15% flat tax on business taxable income and on noncash compensation provided to employees not engaged in business activity.  The bill repeals various existing tax provisions, including the alternative minimum tax, certain tax credits, and estate and gift taxes.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9680"
      }
    },
    {
      "billData": {
        "title": "Kansas Indian Country Law Enforcement Improvement Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Kansas Indian Country Law Enforcement Improvement Act of 2022 This bill revises Kansas's criminal jurisdiction over offenses committed on the reservation of a covered Indian tribe. Covered Indian tribe means the Iowa Tribe of Kansas and Nebraska, the Kickapoo Tribe of Indians of the Kickapoo Reservation in Kansas, the Prairie Band Potawatomi Nation, and the Sac &amp; Fox Nation of Missouri in Kansas and Nebraska. Specifically, the bill requires affirmative consent from the governing body of a covered tribe for Kansas to have criminal jurisdiction over offenses committed on the tribe's reservation. The bill authorizes federal agencies and state and local governments in Kansas to enter into cooperative agreements or compacts with the governing bodies of covered Indian tribes for specified purposes, such as reducing crime in Indian country and nearby communities.  Each cooperative agreement or compact entered into under the bill must (1) authorize law enforcement officers to be deputized, (2) include requirements for reporting crimes, and (3) describe the geographic limits within the reservation and categories of criminal offenses over which Kansas may exercise its jurisdiction. The Department of Justice must, upon request from the governing body of a covered Indian tribe, provide technical assistance in developing cooperative agreements or compacts.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9684"
      }
    },
    {
      "billData": {
        "title": "Know Your Body Act",
        "date": "2022-12-22"
      },
      "billSummary": "Know Your Body Act This bill directs the Office on Women's Health of the Department of Health and Human Services to create educational materials with respect to covered disorders for elementary and secondary school students. Covered disorders refer to uterine, ovarian, and related hormonal and menstrual disorders, such as endometriosis, uterine fibroids, and polycystic ovary syndrome.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9689"
      }
    },
    {
      "billData": {
        "title": "Preventing Terrorist Entry Act of 2022",
        "date": "2022-12-22"
      },
      "billSummary": "Preventing Terrorist Entry Act of 2022 This bill bars non-U.S. nationals (aliens under federal law) who are former members or representatives of terrorist organizations from admission into the United States. (Current law bars current members and representatives.)",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9682"
      }
    },
    {
      "billData": {
        "title": "One Health Security Act",
        "date": "2022-12-22"
      },
      "billSummary": "One Health Security Act This bill establishes an interagency policy council that is focused on matters pertaining to One Health and national security. One Health refers to a multisectoral and transdisciplinary approach for achieving optimal health outcomes for people, domestic and wild animals, plants, and their shared environments and ecosystems. Specifically, the council must advise the President about, develop a strategy for, and generally coordinate federal activities related to One Health Security (i.e., the operational and functional security of the United States against naturally occurring, accidental, and deliberate biological threats, including identified threats, criminal acts, terrorist acts, supply chain failure and system failure, cyberattacks, or other relevant threats affecting One Health and national security).",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5354"
      }
    },
    {
      "billData": {
        "title": "Quantum Computing Cybersecurity Preparedness Act",
        "date": "2022-12-21"
      },
      "billSummary": "Quantum Computing Cybersecurity Preparedness Act This act addresses the migration of executive agencies' information technology systems to post-quantum cryptography. Post-quantum cryptography is encryption strong enough to resist attacks from quantum computers developed in the future. The act does not apply to national security systems. The Office of Management and Budget (OMB) shall issue guidance on the migration of information technology to post-quantum cryptography. Each executive agency must maintain an inventory of all information technology in use by the executive agency that is vulnerable to decryption by quantum computers.  After the National Institutes of Standards and Technology (NIST) has issued post-quantum cryptography standards, the OMB shall issue guidance requiring each executive agency to develop a plan to migrate information technology of the agency to post-quantum cryptography. OMB shall submit to Congress a report on  a strategy to address the risk posed by the vulnerabilities of information technology of executive agencies to weakened encryption due to the potential and possible capability of a quantum computer to breach such encryption; the funding needed by executive agencies to secure such information technology from the risk posed by an adversary of the United States using a quantum computer to breach the encryption; and   a description of federal civilian executive branch coordination efforts led by NIST, including timelines, to develop standards for post-quantum cryptography. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "7535"
      }
    },
    {
      "billData": {
        "title": "PROTECT Our Children Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Providing Resources, Officers, and Technology to Eradicate Cyber Threats to Our Children Act of 2022 or the PROTECT Our Children Act of 2022  This act reauthorizes through FY2024 (1) the National Strategy for Child Exploitation Prevention and Interdiction, and (2) the National Internet Crimes Against Children Task Force Program.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4834"
      }
    },
    {
      "billData": {
        "title": "SBA Cyber Awareness Act",
        "date": "2022-12-21"
      },
      "billSummary": "SBA Cyber Awareness Act This act requires the Small Business Administration (SBA) to annually report specified information related to cybersecurity awareness. Such reports must include (1) a strategy to increase the cybersecurity of the SBA's information technology (IT) infrastructure, (2) a supply chain risk management strategy that includes risk mitigation activities for IT components originating from an entity that has its principal place of business in China, and (3) any SBA cybersecurity incident that occurred during the two years prior to the initial report (including the SBA's action to respond to or remediate it).",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3462"
      }
    },
    {
      "billData": {
        "title": "Klamath Tribe Judgment Fund Repeal Act",
        "date": "2022-12-21"
      },
      "billSummary": "Klamath Tribe Judgment Fund Repeal Act This act repeals the Klamath Tribe Judgment Fund Act, which sets forth how funds credited to the Klamath Tribe must be distributed. The Department of the Interior must disburse to the tribe the balance of funds that were appropriated or deposited into per capita trust accounts and trust accounts for remaining legal fees and administration.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "314"
      }
    },
    {
      "billData": {
        "title": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
        "date": "2022-12-21"
      },
      "billSummary": "This act directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the posthumous award of a Congressional Gold Medal to commemorate Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, four Americans killed in the September 11, 2012, attack on the U.S. consulate in Benghazi, Libya. (Stevens was the U.S. Ambassador to Libya at the time, Smith was an&nbsp;officer in the Foreign Service, and&nbsp;Doherty and&nbsp;Woods were both government contractors and former&nbsp;Navy SEALs.)  After the medal has been awarded, it shall be given to the Central Intelligence Agency Museum. ",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "310"
      }
    },
    {
      "billData": {
        "title": "Safeguard Tribal Objects of Patrimony Act of 2021",
        "date": "2022-12-21"
      },
      "billSummary": "Safeguard Tribal Objects of Patrimony Act of 2021 This act prohibits the exportation of Native American cultural items and archaeological resources that were illegally obtained; provides for the return of such items, including voluntary returns; and establishes and increases related criminal penalties. Specifically, the act makes it a federal crime to export, attempt to export, or otherwise transport from the United States Native American cultural items and archaeological resources without obtaining an export certification. U.S. Customs and Border Protection must detain any item requiring an export certification that does not have one. The act requires the Department of the Interior and the Department of State to each designate a liaison to facilitate and hold trainings and workshops on the voluntary return of human remains and cultural items. Additionally, Interior must   refer individuals and organizations to Indian tribes and Native Hawaiian organizations to facilitate the voluntary return of human remains and cultural items;  convene an interagency working group; and  convene a Native working group consisting of representatives of Indian tribes and Native Hawaiian organizations to provide advice on issues concerning the return of, and illegal trade in, human remains and cultural items.   The act also increases the maximum criminal penalties for violating the Native American Graves Protection and Repatriation Act. In particular, the act increases from 5 years to 10 years the maximum prison term for an individual convicted of a second or subsequent violation of selling, purchasing, using for profit, or transporting for sale or profit human remains or cultural items that were illegally obtained.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2930"
      }
    },
    {
      "billData": {
        "title": "To amend title 40, United States Code, to modify the treatment of certain bargain-price options to purchase at less than fair market value, and for other purposes.",
        "date": "2022-12-21"
      },
      "billSummary": "This act specifies that a bargain-price purchase option (i.e., the option to purchase property at less than fair market value) in a lease agreement for a federal building may be exercised only to the extent the option is specifically provided for in subsequent acts of Congress. The act applies to lease agreements that are entered into on or after January 1, 2021.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "2220"
      }
    },
    {
      "billData": {
        "title": "Reaffirming the preemptive authority of the Federal Food, Drug, and Cosmetic Act (21 U.S.C. 301 et seq.) and the Public Health Service Act (42 U.S.C. 201 et seq.) (including regulations thereunder) with respect to State laws that inhibit access to or use of any reproductive health product.",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution affirms that there is well-established authority for the Food and Drug Administration to approve, license, and otherwise regulate reproductive health products under the Federal Food, Drug, and Cosmetic Act and the Public Health Service Act. The resolution also affirms that (1) such federal laws preempt (i.e., supersede conflicting state or local laws) any state or local laws that prohibit or limit access to or use of any reproductive health product, and (2) the Department of Justice has authority to enforce the preemptive effect of such federal laws by suing any state or political subdivision of a state that prohibits or limits access to or use of any reproductive health product.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1434"
      }
    },
    {
      "billData": {
        "title": "Recognizing the 25th anniversary of Radio Free Asia and its mission to provide an independent source of news to closed societies in Asia.",
        "date": "2022-12-21"
      },
      "billSummary": " This resolution recognizes the importance of Radio Free Asia on its 25th anniversary as an independent news organization chartered and funded by Congress with a mission to bring uncensored, accurate news to people living in closed societies in Asia.  The resolution also honors the dedication and courage of the former and current journalists of Radio Free Asia in the face of threats and adversity from foreign governments and rising risks for press freedom in Asia and across the globe.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "693"
      }
    },
    {
      "billData": {
        "title": "A resolution designating the week of September 18 through September 24, 2022, as \"Community School Coordinators Appreciation Week\".",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution designates the week of September 18-September 24, 2022, as Community School Coordinators Appreciation Week.",
      "billRequestData": {
        "congress": "117",
        "billType": "sres",
        "billNumber": "877"
      }
    },
    {
      "billData": {
        "title": "Providing for consideration of the bill (H.R. 9640) to amend the Internal Revenue Code of 1986 to provide for examination and disclosure with respect to Presidential income tax returns; providing for consideration of the bill (S. 1942) to standardize the designation of National Heritage Areas, and for other purposes; and for other purposes.",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution sets forth the rule for consideration of H.R. 9640 and S. 1942.",
      "billRequestData": {
        "congress": "117",
        "billType": "hres",
        "billNumber": "1529"
      }
    },
    {
      "billData": {
        "title": "Refugee Protection Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Refugee Protection Act of 2022 This bill modifies provisions related to asylum seekers and addresses related issues.  For example, the bill (1) eliminates the statutory time limit for applying for asylum (currently one year after arriving in the United States), (2) establishes stateless protected status for individuals who are not considered a national by any country under that country&rsquo;s law, and (3) requires the goal for refugee admissions for any given fiscal year to be no fewer than 125,000.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5353"
      }
    },
    {
      "billData": {
        "title": "Trade with China Strategic Assessment Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Trade with China Strategic Assessment Act of 2022 This bill directs the Department of Commerce to report to Congress on the state of economic integration between the United States and China.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5352"
      }
    },
    {
      "billData": {
        "title": "Stopping Unlawful Negative Machine Impacts through National Evaluation Act",
        "date": "2022-12-21"
      },
      "billSummary": "Stopping Unlawful Negative Machine Impacts through National Evaluation Act This bill makes an entity that uses artificial intelligence (AI) to make or inform decisions liable for violations of civil rights laws caused by those decisions in the same manner and to the same extent as if the entity made the decision without using AI. Additionally, the bill establishes a temporary program within the National Institute of Technology and Standards to evaluate AI systems for bias and discrimination on the basis of race, sex, age, and other protected characteristics and assist in mitigating those effects. The program terminates on December 31, 2028.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5351"
      }
    },
    {
      "billData": {
        "title": "A resolution reaffirming the partnership between the United States and the Dominican Republic and advancing opportunities to deepen diplomatic, economic, and security cooperation between the two nations.",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution reaffirms the Senate's commitment to strengthening the historic partnership between the United States and the Dominican Republic based on shared democratic values and efforts to advance economic prosperity and national security. The resolution also encourages continued actions by the government of the Dominican Republic to assume a regional leadership role in promoting human rights, democratic values, and humanitarian assistance.",
      "billRequestData": {
        "congress": "117",
        "billType": "sres",
        "billNumber": "472"
      }
    },
    {
      "billData": {
        "title": "A resolution commemorating the 50th anniversary of the Coastal Zone Management Act of 1972, commonly known as the \"Coastal Zone Management Act\".",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution commemorates the 50th anniversary of the enactment of the Coastal Zone Management Act of 1972.",
      "billRequestData": {
        "congress": "117",
        "billType": "sres",
        "billNumber": "876"
      }
    },
    {
      "billData": {
        "title": "Transit Ban Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Transit Ban Act of 2022 This bill bars non-U.S. nationals (aliens under federal law) from receiving asylum if they traveled through at least one other country to arrive at or enter the United States through the U.S.-Mexico border, with certain exceptions, such as if the individual is a victim of a severe form of human trafficking. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5350"
      }
    },
    {
      "billData": {
        "title": "International Competition for American Jobs Act",
        "date": "2022-12-21"
      },
      "billSummary": " International Competition for American Jobs Act  This bill modifies provisions relating to the taxation of foreign entities.  Among other provisions, the bill   makes permanent the look-thru rule for controlled foreign corporations (CFCs). (A look-thru rule provides that dividends, interest, rents and royalties that one CFC receives or accrues from a related CFC are not treated as foreign personal holding company income);  modifies the tax deduction for foreign-derived intangible income and global intangible low-taxed income;  modifies the base erosion minimum tax (10% minimum tax imposed to prevent corporations operating in the United States from avoiding tax liability by shifting profits out of the United States); modifies tax rules allocating certain tax deductions for purposes of the foreign tax credit limitation;  restores the limitation on the attribution of stock ownership for purposes of applying constructive ownership rules; and  includes specified amounts in the gross income of CFC shareholders. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5349"
      }
    },
    {
      "billData": {
        "title": "Protecting Veteran Community Care Act",
        "date": "2022-12-21"
      },
      "billSummary": "Protecting Veteran Community Care Act This bill modifies the community care program for veterans, including to expand access to community mental health care providers.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5348"
      }
    },
    {
      "billData": {
        "title": "A resolution commending and congratulating the Northern Arizona University Lumberjacks Men's Cross Country Team for winning the 2022 National Collegiate Athletic Association Cross Country National Championship.",
        "date": "2022-12-21"
      },
      "billSummary": "This resolution honors the Northern Arizona University Lumberjacks men's cross country team for winning the 2022 National Collegiate Athletic Association men's cross country national championship.",
      "billRequestData": {
        "congress": "117",
        "billType": "sres",
        "billNumber": "865"
      }
    },
    {
      "billData": {
        "title": "Consumer Transaction Account Protection Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Consumer Transaction Account Protection Act of 2022 This bill specifies that consumer transaction account deposits of an insured depository institution are not funds obtained through a deposit broker.&nbsp;In general, current law prohibits&nbsp;an insured depository institution that is not well capitalized&nbsp;from accepting for deposit funds obtained through a deposit broker.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5345"
      }
    },
    {
      "billData": {
        "title": "Asset Growth Restriction Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Asset Growth Restriction Act of 2022 This bill repeals restrictions related to brokered deposits and provides for asset growth restrictions applicable to insured depository institutions.  Brokered deposits are deposits made to an insured institution, such as a bank, through a third-party broker for investment purposes. Currently, only well-capitalized banks are allowed to solicit and accept brokered deposits, while institutions that are adequately capitalized may accept if granted a waiver. Undercapitalized banks are prohibited from accepting these deposits.  The bill repeals these brokered deposit restrictions and directs the Federal Deposit Insurance Corporation to establish limits on growth of average total assets for less than well-capitalized institutions to maintain their safety and soundness. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5347"
      }
    },
    {
      "billData": {
        "title": "Brokered Deposit Affiliate-Subsidiary Modernization Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Brokered Deposit Affiliate-Subsidiary Modernization Act of 2022 This bill excludes affiliates&nbsp;and subsidiaries of an insured depository institution from certain limitations applicable to brokered deposits. (Brokered deposits are a type of deposit accepted by an institution from a third-party deposit broker for investment purposes. Institutions that accept brokered deposits are subject to additional regulatory requirements, including those related to liquidity.)  The bill also expands the definition of an employee of an insured depository institution, thereby exempting these individuals from treatment as a deposit broker. Specifically, the bill includes as an employee (1) an individual who receives compensation in any form from an insured depository institution or from an affiliate or subsidiary, and (2) a registered representative of a broker or dealer that is an affiliate or subsidiary of an insured depository institution.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5346"
      }
    },
    {
      "billData": {
        "title": "SUCCESS Act",
        "date": "2022-12-21"
      },
      "billSummary": "Solving the Unnecessary Contracting Cliff for Enterprises to Scale Successfully Act or the SUCCESS Act This bill establishes a pilot program that permits certain commercial construction and engineering services enterprises to maintain eligibility for certain small business contracts during a transitional period after they otherwise exceed the applicable small business size standards for such contracts.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5344"
      }
    },
    {
      "billData": {
        "title": "Cruise Passenger Protection Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Cruise Passenger Protection Act of 2022 This bill revises provisions related to passenger vessel security and safety. The bill directs the Department of Transportation (DOT) to develop standards for cruise ship owners to provide passengers with a conspicuous and unambiguous summary of key terms of passage contracts before they are binding. Vessel owners must provide each passenger with a summary meeting those standards and include the summary in promotional literature. The bill prescribes civil and criminal penalties for violations.  DOT must (1) establish a hotline for passenger complaints, (2) determine whether any of the enumerated rights in the international cruise line passenger bill of rights (adopted by the members of the Cruise Lines International Association) are enforceable under federal law, and (3) establish an advisory committee for passenger vessel consumer protection. Vessel owners must ensure that a vessel is staffed with sea marshals and medical staff. DOT must  designate a director of victim support services, establish a 24-hour telephone number for crime victims, develop a written summary of rights for crime victims, maintain a statistical compilation of reported incidents, and study the feasibility of having an individual on board each vessel to provide victim support and related services.  The Department of Homeland Security may withhold or revoke the clearance of, and the Coast Guard may deny entry into the United States to, any vessel owner who commits an act or omission for which a penalty is imposed under this bill or fails to pay the penalty.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5343"
      }
    },
    {
      "billData": {
        "title": "Preserving Homes and Communities Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Preserving Homes and Communities Act of 2022  This bill establishes requirements for the sale by the Department of Housing and Urban Development of non-performing single-family residential mortgages that are insured under the National Housing Act. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5342"
      }
    },
    {
      "billData": {
        "title": "Aviation Security Checkpoint Technology Fund Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Aviation Security Checkpoint Technology Fund Act of 2022 This bill establishes the Aviation Security Checkpoint Technology Fund within the Department of Homeland Security to fund the procurement, deployment, and sustainment of aviation security checkpoint technology.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9625"
      }
    },
    {
      "billData": {
        "title": "Preventing Child Sex Abuse Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Preventing Child Sex Abuse Act of 2022 This bill makes changes to the federal law prohibiting child sexual tourism.  First, the bill revises the specific intent required for certain offenses involving interstate or foreign travel to engage in or facilitate illicit sexual conduct. Specifically, this bill requires the government to prove that an individual traveled (or facilitated travel) with the intent to engage in illicit sexual conduct (currently, with a motivating purpose of engaging in illicit sexual conduct). Further, it specifies that the term intent is to be construed as any intention to engage in illicit sexual conduct at the time of the travel.  Second, the bill establishes new criminal offenses for acts in furtherance of illicit sexual conduct by an officer, director, employee, or agent of an organization through his or her connection to or affiliation with the organization. A violation is subject to a fine, a prison term of up to 30 years, or both.  Finally, the bill specifies that the term sexual activity for which any person can be charged with a criminal offense does not require interpersonal physical contact. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4719"
      }
    },
    {
      "billData": {
        "title": "Veterans Benefits Improvement Act of 2021",
        "date": "2022-12-21"
      },
      "billSummary": "Veterans Benefits Improvement Act of 2021 This bill implements programs and policies related to veterans' benefit claims.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "3388"
      }
    },
    {
      "billData": {
        "title": "Federal Reserve Accountability Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Federal Reserve Accountability Act of 2022  This bill reduces the number of Federal Reserve districts from 12 to 5, requires Senate confirmation for Federal Reserve bank presidents, and makes other changes to the operation of the Federal Reserve Board and Federal Reserve banks. ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5341"
      }
    },
    {
      "billData": {
        "title": "END Child Exploitation Act",
        "date": "2022-12-21"
      },
      "billSummary": "Eliminate Network Distribution of Child Exploitation Act or the END Child Exploitation Act  This bill modifies the reporting requirements for electronic communication service providers and remote computing service providers (providers) that report information to the CyberTipline of the National Center for Missing and Exploited Children on crimes involving the sexual exploitation of children. Specifically, the bill increases the amount of time&#8212;from 90 days to 180 days&#8212;that a provider must preserve the contents of a report. Additionally, the bill permits a provider to voluntarily retain the contents for longer than 180 days to reduce the proliferation of or to prevent the online sexual exploitation of children.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "365"
      }
    },
    {
      "billData": {
        "title": "Stablecoin TRUST Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Stablecoin Transparency of Reserves and Uniform Safe Transactions Act of 2022 or the Stablecoin TRUST Act of 2022  This bill establishes a regulatory framework for payment stablecoins (digital assets which an issuer must directly convert to fiat currency). Specifically, the bill only allows the following entities to issue stablecoins   a money transmitting business, a non-depository trust company, or any other person that is authorized by a state banking supervisor to issue payment stablecoins;  a national limited payment stablecoin issuer;  a depository institution; or  a national trust bank.  ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5340"
      }
    },
    {
      "billData": {
        "title": "A bill to amend title 38, United States Code, to expand eligibility for supportive services for very low-income veteran families to include former members of the reserve components of the Armed Forces, and for other purposes.",
        "date": "2022-12-21"
      },
      "billSummary": "This bill makes eligible under the Supportive Services for Veteran Families program former members of a reserve component of the Armed Forces who have retired or separated from service after serving a term of enlistment. This includes families in which the head of household or spouse of the head of household is a former member of a reserve component who has retired or separated from service after serving a term of enlistment.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5337"
      }
    },
    {
      "billData": {
        "title": "Platform Accountability and Transparency Act",
        "date": "2022-12-21"
      },
      "billSummary": "Platform Accountability and Transparency Act This bill increases access to the data of large technology platforms (i.e., platforms with at least 50 million unique monthly users in the United States) in order to facilitate research concerning activities on those platforms, particularly by requiring platforms to disclose data to researchers who participate in a research program jointly established by the National Science Foundation and the Federal Trade Commission.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5339"
      }
    },
    {
      "billData": {
        "title": "Healthy Climate and Family Security Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Healthy Climate and Family Security Act of 2022 This bill addresses the reduction of greenhouse gas emissions by establishing a program that caps the emissions of carbon dioxide and auctions carbon permits to producers or importers of crude oil, domestic or foreign coal operations, or certain natural gas entities. The bill also establishes the Healthy Climate Trust Fund for the proceeds of the auctions to be distributed as dividend payments to U.S. individuals.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5338"
      }
    },
    {
      "billData": {
        "title": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status With Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment\".",
        "date": "2022-12-21"
      },
      "billSummary": "This joint resolution nullifies the final rule issued by the U.S. Fish and Wildlife Service titled Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status With Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment and published on November 25, 2022. The rule adds the Northern Distinct Population Segment of lesser prairie-chicken to the list of threatened species and the Southern District Population Segment of lesser prairie-chicken to the list of endangered species.",
      "billRequestData": {
        "congress": "117",
        "billType": "sjres",
        "billNumber": "70"
      }
    },
    {
      "billData": {
        "title": "PREEMIE Reauthorization Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "PREEMIE Reauthorization Act of 2022 This bill reauthorizes through FY2028 research, health care provider education, and other activities focused on preventing and treating preterm birth.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5336"
      }
    },
    {
      "billData": {
        "title": "Redistricting Reform Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Redistricting Reform Act of 2022 This bill outlines criteria for congressional redistricting and generally prohibits mid-decade redistricting.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5335"
      }
    },
    {
      "billData": {
        "title": "FACE IT Act",
        "date": "2022-12-21"
      },
      "billSummary": "Facial, Accountability, Clarity, and Efficiency in Technology Act or the FACE IT Act This bill establishes requirements with respect to the federal use of facial recognition technology.  For example, the National Institute for Standards and Technology and the Department of Homeland Security must develop minimum accuracy requirements specific to each federal agency for use in cases of facial recognition technology in the government.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5334"
      }
    },
    {
      "billData": {
        "title": "American Innovation and Choice Online Act",
        "date": "2022-12-21"
      },
      "billSummary": "American Choice and Innovation Online Act This bill prohibits certain large online platforms from engaging in specified acts, including giving preference to their own products on the platform, excluding or disadvantaging competing products from another business on the platform, or discriminating among similarly situated users.  Further, a platform may not materially restrict or impede the capacity of a competing business user to access or interoperate with the same platform, operating system, or hardware or software features. The bill also restricts the platform's use of nonpublic data obtained from or generated on the platform and prohibits the platform from restricting access to platform data generated by the activity of a competing business user. The bill also provides additional restrictions related to installing or uninstalling software, search or ranking functionality, and retaliation for contact with law enforcement regarding actual or potential violations of law.  The bill establishes affirmative defenses for the prohibited conduct.  The Federal Trade Commission or the Department of Justice must designate whether an entity is a platform covered by the bill, and both must carry out enforcement activities. The bill also provides for civil penalties, injunctions, conflicts of interest, a private right of action, and the forfeit of profits for repeat offenders.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "3816"
      }
    },
    {
      "billData": {
        "title": "State, Local, Tribal, and Territorial Fiscal Recovery, Infrastructure, and Disaster Relief Flexibility Act",
        "date": "2022-12-21"
      },
      "billSummary": "State, Local, Tribal, and Territorial Fiscal Recovery, Infrastructure, and Disaster Relief Flexibility Act This bill allows states, tribes, territories, and localities to use certain COVID-19 relief funds for new categories of spending, including for natural disasters and infrastructure projects. It also makes changes to expenditure deadlines and other aspects of this funding. Specifically, recipients may use funds for emergency relief from natural disasters and associated negative economic impacts of natural disasters. In addition, recipients may use a portion of their COVID-19 relief funds for designated infrastructure projects, such as nationally significant freight and highway projects. Furthermore, the bill allows recipients to expend COVID-19 relief funds on these types of infrastructure projects until September 30, 2026. Under current law, recipients must expend the funds by December 31, 2024. Other changes in the bill include (1) modifying eligibility and allocation requirements for funding set aside for counties and Indian tribes that are near public lands, (2) allowing Indian tribes an additional year to expend their COVID-19 relief funds, and (3) establishing a process for government entities to decline COVID-19 relief funds and requiring any declined funds to be used to reduce the federal deficit.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5323"
      }
    },
    {
      "billData": {
        "title": "Project Safe Neighborhoods Reauthorization Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Project Safe Neighborhoods Reauthorization Act of 2022 This bill reauthorizes through FY2026 the Project Safe Neighborhoods Block Grant Program within the Department of Justice. The bill also allows funds under the program to be used for  \thiring crime analysts to assist with violent crime reduction efforts; the cost of overtime for law enforcement officers, prosecutors, and law enforcement assistants who assist with the program;  purchasing, implementing, and using technology to assist with violent crime reduction efforts; and supporting multijurisdictional task forces.  ",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "4859"
      }
    },
    {
      "billData": {
        "title": "Advancing Skills-Based Hiring Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Advancing Skills-Based Hiring Act of 2022 This bill allows employers to submit to the Equal Employment Opportunity Commission (EEOC) evidence that a competency-based skills test or other employment selection process is consistent with lawful employment practices. The EEOC must review each submission and determine whether the procedure is job-related and consistent with a business necessity, or provide technical assistance to the employer about potential changes that would allow the EEOC to make such a determination. Such a determination may be used by the employer to satisfy the burden of proof under the disparate impact analysis with respect to a claim of an unlawful discrimination.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5333"
      }
    },
    {
      "billData": {
        "title": "Civilian Cybersecurity Reserve Act",
        "date": "2022-12-21"
      },
      "billSummary": "Civilian Cybersecurity Reserve Act This bill authorizes the Cybersecurity and Infrastructure Security Agency (CISA) to create a temporary Civilian Cybersecurity Reserve to address U.S. cybersecurity needs with respect to national security.  Reserve members must (1) be former employees or contractors of the executive branch, former military personnel, or former state or local government employees; (2) have cybersecurity expertise; and (3) obtain any necessary security clearances. Membership in the reserves is contingent on a mutual agreement between the agency and the individual. CISA must submit an implementation plan for congressional review before taking any further action with respect to the reserve. In addition, CISA and the Government Accountability Office must evaluate and report on the reserve, including whether it should be made permanent.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "1324"
      }
    },
    {
      "billData": {
        "title": "Election Security Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Election Security Act of 2022 This bill addresses election security through grant programs and requirements for voting systems and paper ballots. Among other provisions, the bill (1) establishes requirements for voting systems, including that systems use individual, durable, voter-verified paper ballots; (2) directs the Election Assistance Commission to award grants to states for specified activities, including replacing voting systems and improving the security of the systems; and (3) requires states and jurisdictions to carry out postelection audits for all federal elections.",
      "billRequestData": {
        "congress": "117",
        "billType": "s",
        "billNumber": "5332"
      }
    },
    {
      "billData": {
        "title": "SUCCESS Act",
        "date": "2022-12-21"
      },
      "billSummary": "Solving the Unnecessary Contracting Cliff for Enterprises to Scale Successfully Act or the SUCCESS Act This bill establishes a pilot program that permits certain commercial construction and engineering services enterprises to maintain eligibility for certain small business contracts during a transitional period after they otherwise exceed the applicable small business size standards for such contracts.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9642"
      }
    },
    {
      "billData": {
        "title": "SIFIA Act",
        "date": "2022-12-21"
      },
      "billSummary": " School Infrastructure Finance and Innovation Act or the SIFIA Act  This bill allows a new tax credit for the issuance of school infrastructure finance and innovation bonds (SIFIA bonds). The bill defines SIFIA bonds as any bond issue if 100% of the project proceeds of such issue are to be used for the design, construction, expansion, renovation, furnishing, or equipping of qualified school facilities.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9668"
      }
    },
    {
      "billData": {
        "title": "Students Helping Young Students Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Students Helping Young Students Act of 2022 This bill&nbsp;expands&nbsp;the federal work-study programs at&nbsp;institutions of higher education to include work-study programs that compensate students employed in the educational after-school, before-school, or out-of-school community service activities of public elementary or secondary schools.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9650"
      }
    },
    {
      "billData": {
        "title": "Emerging Business Encouragement Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Emerging Business Encouragement Act of 2022 This bill directs the Small Business Administration (SBA) to establish criteria and procedures for small businesses to be designated as emerging business enterprises. The bill provides for various benefits to such enterprises, such as waiving various loan fees and requiring federal agencies to award at least 3% of contracts in each fiscal year to such enterprises.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9649"
      }
    },
    {
      "billData": {
        "title": "Healthy Climate and Family Security Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Healthy Climate and Family Security Act of 2022 This bill addresses the reduction of greenhouse gas emissions by establishing a program that caps the emissions of carbon dioxide and auctions carbon permits to producers or importers of crude oil, domestic or foreign coal operations, or certain natural gas entities. The bill also establishes the Healthy Climate Trust Fund for the proceeds of the auctions to be distributed as dividend payments to U.S. individuals.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9645"
      }
    },
    {
      "billData": {
        "title": "Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status With Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment\".",
        "date": "2022-12-21"
      },
      "billSummary": "This joint resolution nullifies the final rule issued by the U.S. Fish and Wildlife Service titled Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status With Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment and published on November 25, 2022. The rule adds the Northern Distinct Population Segment of lesser prairie-chicken to the list of threatened species and the Southern District Population Segment of lesser prairie-chicken to the list of endangered species.",
      "billRequestData": {
        "congress": "117",
        "billType": "hjres",
        "billNumber": "105"
      }
    },
    {
      "billData": {
        "title": "Offshore Energy Modernization Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "Offshore Energy Modernization Act of 2022 This bill addresses the implementation and administration of offshore renewable energy projects, including by establishing the Offshore Power Administration to (1) construct, finance, facilitate, plan, operate, maintain, acquire, and study covered transmission infrastructure; and (2) support construction, financing, facilitation, planning, operation, maintenance, acquisition, and study of covered transmission infrastructure.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9641"
      }
    },
    {
      "billData": {
        "title": "National All-Payer Claims Database Act of 2022",
        "date": "2022-12-21"
      },
      "billSummary": "National All-Payer Claims Database Act of 2022 This bill establishes a national all-payer claims database to collect and publish health care claims and payment information from various insurers.",
      "billRequestData": {
        "congress": "117",
        "billType": "hr",
        "billNumber": "9644"
      }
    }
  ]
}